[
    {
        "id": "657f7d25f8c1e948e722119bfcaf65f54c8a3bdf92abbf36b839b3ce77636416",
        "title": "Chinese economist Lu Feng on why the time is ripe for a consumption rebalance",
        "summary": "Lu Feng is a professor of economics and a former deputy dean at Peking University’s National School of Development. In more than 40 academic papers, six books and numerous magazine articles, he has studied issues critical to China’s economy, including the exchange rate, industrial development, food security and external imbalances. Lu has also served as an adviser to several government agencies, including the Ministry of Finance and the Ministry of Human Resources and Social Security.\nThis...",
        "source": "smcp",
        "date": "2025-11-17T07:00:31+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3332805/chinese-economist-lu-feng-why-time-ripe-consumption-rebalance?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cadb14293a495616f15c08c6040d2b4b6ab1738a429c61a3251e2175edfe14d6",
        "title": "China’s jumbo Sichuan 076 amphibious assault ship completes first sea trials",
        "summary": "China’s next-generation “drone-carrier” amphibious assault ship, the Sichuan, completed its first sea trials on Sunday afternoon, state broadcaster CCTV said.\nThe three-day trial marks a major step forward for the People’s Liberation Army to take delivery of its first Type 076 amphibious assault carrier, seen as a key asset for China’s unmanned aerial vehicle (UAV) operations.\nThe trials, which began on Friday morning, aimed to test the reliability and stability of the supersized warship’s...",
        "source": "smcp",
        "date": "2025-11-16T23:41:20+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3333001/chinas-076-amphibious-assault-ship-sichuan-completes-first-sea-trials?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3a0cefc306b7583e2905acf6e755556d6a75e4b409b25cffc23eb521de23ed5d",
        "title": "How China’s Fujian aircraft carrier deceived US military experts at launch",
        "summary": "It happens in an instant – your eyes register motion, your brain predicts what comes next and, in a split second, you think you understand what you are seeing. But what if that instinct is wrong?\nThat happened when the world saw China’s most advanced warship, the Fujian, in action earlier this month.\nWhen a video was released on November 8 showing the carrier’s electromagnetic catapult firing in an empty launch, viewers saw the catapult accelerate down the deck with blinding force and then stop...",
        "source": "smcp",
        "date": "2025-11-16T23:00:11+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3332806/how-chinas-fujian-aircraft-carrier-deceived-us-military-experts-launch?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6c2a47f51329a1f998589096b123b878a8fa6806749dc9bde33a2320ff76745c",
        "title": "How does China’s modernising navy stack up against the US seventh fleet?",
        "summary": "When President Xi Jinping commissioned the Fujian on November 5, China became only the second nation to have an aircraft carrier with an electromagnetic catapult system. It is also notable that, last month, two navy aircraft from the USS Nimitz crashed into the South China Sea.\nThese events crystallise a strategic reality often obscured by aggregate force comparisons: the relevant naval balance is not between the 11 US aircraft carriers and China’s three, but between what the United States can...",
        "source": "smcp",
        "date": "2025-11-16T21:30:10+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3332517/south-china-sea-how-third-pla-navy-aircraft-carrier-changes-dynamics-us?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "90fc9c66e0ce1b44ecb23160eb8838a3ec0545b22a54eab20af787483c9bc880",
        "title": "Chinese team finds ‘iron rust’ in lunar soil, challenging moon surface myths",
        "summary": "Chinese scientists have identified micron-sized grains of “iron rust” in lunar soil samples brought back by the Chang’e-6 mission last year. This finding challenges the traditional understanding of the moon’s surface chemistry and offers new clues to explain lunar magnetic anomalies.\nThe results were published on Friday in the peer-reviewed journal Science Advances. A research team from Shandong University, in collaboration with the Institute of Geochemistry of the Chinese Academy of Sciences...",
        "source": "smcp",
        "date": "2025-11-16T20:10:46+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3332987/chinese-team-finds-iron-rust-lunar-soil-challenging-old-ideas-about-moons-surface?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fa78f94581e1fa60b8dff4c9d5307aea686886eefef5daa51c8a7eb4edcbdc08",
        "title": "US ends arms embargo, but can it pry Cambodia away from China on defence?",
        "summary": "By lifting its arms embargo on Cambodia, Washington has signalled that President Donald Trump aims to lure Phnom Penh away from Beijing – a move experts warn would be difficult to achieve.\nAccording to a notice from the US Federal Register, the State Department formally ended its arms embargo on Cambodia as of November 7, and any arms sales to the country will now be decided on a case-by-case basis.\n“Based on Cambodia’s diligent pursuit of peace and security, including through renewed engagement...",
        "source": "smcp",
        "date": "2025-11-16T20:00:11+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3332974/us-ends-arms-embargo-can-it-pry-cambodia-away-china-defence?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1f8168b6562b838d81a7ad9f397dbb5de683be5e7cc54f1c9f2b02bc8a7ff739",
        "title": "Shaolin Temple abbot Shi Yongxin closer to prosecution over money scandals",
        "summary": "Local authorities have formally approved the arrest of the former head of China’s famous Shaolin Temple, four months after he was placed under criminal investigation for alleged financial and sex scandals.\nShi Yongxin’s arrest had been approved “on suspicion of embezzlement, misappropriation of funds, and accepting bribes as a non-state functionary”, the Xinxiang Procuratorate announced in a statement on Sunday.\nXinxiang, in China’s central Henan province, is about two hours’ drive from the...",
        "source": "smcp",
        "date": "2025-11-16T18:02:48+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3332977/disgraced-shaolin-temple-abbot-shi-yongxin-closer-prosecution-over-money-scandals?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8b5c49f412a8b2edd108d8f40f88fdb76a5b35bbb8ec4b976d227262694c31f0",
        "title": "Alibaba revamps chatbot amid US ‘panic’ over firm’s AI progress",
        "summary": "Alibaba Group Holding has begun a revamp of its artificial intelligence chatbot in a move to match OpenAI’s ChatGPT, according to app store information and media reports, as some observers see “panic” in Silicon Valley over the Chinese tech giant’s rapid AI progress.\nThe new chatbot app, Qwen, an upgraded and renamed version of the previous app, Tongyi, became available on Android and Apple app stores on Friday.\nAlibaba dubbed the updated app the “most powerful official AI assistant for its...",
        "source": "smcp",
        "date": "2025-11-16T17:36:45+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3332979/alibaba-revamps-qwen-chatbot-some-see-silicon-valley-panic-over-firms-ai-progress?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6792a000c14fee1e62f189adc099efc01a0095aaa1bd4cb8a6cd3ea31303bfc3",
        "title": "China’s LGBTQ community loses key lifeline as Blued, Finka apps vanish",
        "summary": "The vulnerability of safe digital spaces for China’s LGBTQ community has been underscored by the abrupt removal of the country’s two most popular same-sex dating apps – Blued and Finka – from mainland app stores under government orders.\nThe apps, both owned by Hong Kong-based BlueCity Holdings Ltd, were first noticed missing by Chinese social media users last weekend. Apple confirmed the removals in a statement sent to the South China Morning Post on Thursday, explaining that it follows the laws...",
        "source": "smcp",
        "date": "2025-11-16T17:00:15+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3332962/chinas-lgbtq-community-loses-key-lifeline-blued-finka-apps-abruptly-vanish?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c8bc7f7a15bc24cd9d01694fd7b94af9adb78aa1abf46f362b4ca79ed6eafcf9",
        "title": "Japan risks ‘path of no return’ if it intervenes in Taiwan, PLA Daily warns",
        "summary": "Japan risked turning the entire country into a battlefield if it intervened militarily in the Taiwan Strait, an article published by Beijing’s military mouthpiece PLA Daily warned on Sunday, marking the latest escalation in a diplomatic clash sparked by comments from the Japanese leader.\nPrime Minister Sanae Takaichi told the Japanese parliament on November 7 that the use of force against Taiwan could be seen as a “survival-threatening situation”, a scenario that would allow Tokyo to deploy its...",
        "source": "smcp",
        "date": "2025-11-16T16:13:39+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3332970/pla-daily-warns-japan-path-no-return-if-its-military-intervenes-taiwan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "831d814b1baada0a7f97cb5e369311d01b48219e3f3077b2b2029c8ac7eb096d",
        "title": "Shanghai dreams of a new era of ‘AI restaurants’. But can diners stomach it?",
        "summary": "China’s premier metropolis has a vision for the future of dining – and it is one involving restaurants run by artificial intelligence, with automated kitchens, robot servers, data-driven menus and intelligent supply chains.\nThe spread of automation in the catering sector has become a hot-button issue in China over recent months, but Shanghai appears committed to charging ahead with a plan to transform local eateries using smart technology.\nThe city has set a target of becoming a “nationally...",
        "source": "smcp",
        "date": "2025-11-16T15:00:21+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3332815/shanghai-unveils-radical-plan-new-era-ai-dining-and-robot-kitchens?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5bf542f89a87368ee5cd5d7eda495c6c3ee262523df2216d5d6840efd73d0c7b",
        "title": "China’s chip leaders bank on AI, RISC-V as industry’s growth engines",
        "summary": "The use of chips for artificial intelligence and electric vehicles (EVs) will offer strong demand underpinning the development of mainland China’s semiconductor industry, according to veterans of the sector at an annual gathering in Shanghai.\nAt the 2025 Global Semiconductor Market Summit, chip executives discussed the industry’s future amid US-China tech rivalry and surging demand for chips, as well as different technology trajectories. The two-day event, which wrapped up on Friday, was...",
        "source": "smcp",
        "date": "2025-11-16T14:00:09+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3332881/chinas-chip-leaders-bank-ai-evs-risc-v-industrys-future-growth-engines?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "680bb0e5b61e5750df5664a9e2476d674cbd12db49b055d5dacae0963fca84d1",
        "title": "How a Japan-Philippines defence pact could become a ‘template’ to deter China",
        "summary": "A new defence pact between Tokyo and Manila allows the Japanese military to deploy in the Philippines for the first time since World War II – with the goal of deterring Beijing in the South China Sea.\nAnalysts said the “quasi-security alliance” – which took effect in September and is known as a reciprocal access agreement – could harden Manila’s stance in the contested waters, and that other US allies in the region could follow suit.\nDing Duo, an associate research fellow at the National...",
        "source": "smcp",
        "date": "2025-11-16T13:00:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3332807/how-japan-philippines-defence-pact-could-become-template-deter-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fc66a105b9aca2de79984928008f1137aeb22f006ad1b9cfb9eb39f605ca4e2f",
        "title": "Australia draws mainland China, Hong Kong homebuyers amid stable policies, economy",
        "summary": "Australia, with its stable political and economic landscape, is likely to attract more property investors from Hong Kong and mainland China in the coming year, according to agents.\nThe luxury property segment of the world’s sixth-largest country is also expected to see increased interest from affluent investors looking for cost-efficient safe havens amid changes in the immigration and residency requirements of the US and the UK, among other jurisdictions.\n“For many years, Australia has been a...",
        "source": "smcp",
        "date": "2025-11-16T12:00:16+09:00",
        "url": "https://www.scmp.com/business/article/3332923/australia-draws-mainland-hong-kong-homebuyers-back-stable-policies-economy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7c4aa46899718cc2a95ef6572604314a41b03f6b2bad2200e965526e09457930",
        "title": "Taiwan draft dodging concerns highlight growing unease over military service",
        "summary": "Taiwan is facing an intensifying debate about draft dodging among young men after the government moved to extend the term of compulsory military service amid heightened tensions with Beijing.\nThe island’s government has extended the term conscripts must serve to one year, and the contrast between its warning that the stakes have never been higher in the face of increased pressure from Beijing and the growing reluctance to serve has fuelled a debate about weaknesses in its mobilisation system.\nA...",
        "source": "smcp",
        "date": "2025-11-16T11:00:33+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3332946/taiwan-draft-dodging-concerns-highlight-growing-public-unease-over-military-service?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b40dda6302dc62d51a895019052d4cf8534766593da6dc6d61e4a49cae710eba",
        "title": "Chinese vendors on Shein, Temu face tax changes at home and abroad",
        "summary": "Chinese merchants who sell to overseas markets via popular sites like Shein and Temu are struggling with escalating tax and compliance burdens from both their main export market, the European Union, and the domestic tax authority.\nThe latest pressure came from the EU, which on Thursday agreed to abolish a rule that allowed goods worth less than €150 (US$174) to enter the region without customs duties. The new rule will apply once an EU customs data hub is ready, scheduled for 2028. However, the...",
        "source": "smcp",
        "date": "2025-11-16T11:00:20+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3332873/chinese-vendors-shein-temu-face-double-tax-trouble-levies-home-and-abroad?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "626048bdda64b36eb0b6dc5eb2b0ccf27e39defd1e97e1da988c281a749cf9dd",
        "title": "The Busan silence: how great-power pragmatism is rewriting Taiwan’s future",
        "summary": "When Chinese President Xi Jinping and US President Donald Trump met in Busan, South Korea, on October 30, they spent nearly two hours discussing rare earths, fentanyl and trade. Taiwan, the one issue most likely to bring the world’s two largest powers into direct conflict, never came up. That silence was the message.\nIt revealed how both leaders prefer to manage rivalry through quiet understanding rather than confrontation. The approach reduces the risk of war but narrows Taiwan’s options. The...",
        "source": "smcp",
        "date": "2025-11-16T10:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3332430/busan-silence-how-great-power-pragmatism-rewriting-taiwans-future?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8810620acd965a9a302a3b822e1b0185c2edcc9264defe9b1263854106ab0228",
        "title": "Why Chinese grass-roots culture may be finally taking its place in the limelight",
        "summary": "In a small town in the US Midwest, 47-year-old military veteran Natalie Hubble loves spending her evenings lost in the mythic worlds portrayed in Chinese fantasy stories.\nHubble has never been to China, yet few could describe Chinese mythical tales as well as she does.\nShe described her growing connection to Chinese culture, ancient and modern, as a “natural progression”, since she reads over 150 books a year and likes to take recommendations from all over the world.\nShe said her favourite...",
        "source": "smcp",
        "date": "2025-11-16T07:00:19+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3332914/why-chinese-grass-roots-culture-may-be-finally-taking-its-place-global-limelight?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cfcabf84b8287cacbb8e20e2238b0af2ed1f684551207c8adea6306c0c17a294",
        "title": "In ‘soybean diplomacy’ with the US, China now holds the remote control",
        "summary": "After US President Donald Trump and Chinese President Xi Jinping shook hands in Busan last month, the headlines highlighted smiles and tariff rollbacks. Washington hailed it as a “massive victory”, saying China had pledged to buy 12 million tonnes of American soybeans by January and at least 25 million tonnes annually for the next three years. Futures on the Chicago Board of Trade surged and farmers in the US Midwest cheered.\nUS Treasury Secretary Scott Bessent declared that “our great soybean...",
        "source": "smcp",
        "date": "2025-11-16T06:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3332390/soybean-diplomacy-us-china-now-holds-remote-control?utm_source=rss_feed",
        "reportUrl": ""
    }
]