[
    {
        "id": "1166295edd87daf2562e4383f27cbe7d57ff6241c9766e86e97292a05f34804f",
        "title": "When mines run dry: why some Chinese cities are racing to reinvent themselves",
        "summary": "Few areas of China reflect the country’s decades-long economic transformation more vividly than its cities. Rapid development has made villages into dense urban landscapes and already sizeable metro areas into some of the world’s largest population centres. As the rate of urbanisation slows and the country transitions into a new economic era, we explore how select Chinese cities are navigating the change. Read the rest of our series here.\nOnce a remote industrial powerhouse forged deep in the...",
        "source": "smcp",
        "date": "2025-10-28T07:00:13+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330490/chinas-old-industrial-cities-race-reinvent-themselves-rapidly-changing-economy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a5ce7af3570c7e66f382d955bb4bda1869a30dc72ae143d66a5ab867654238db",
        "title": "China’s transition to a global powerhouse hinges on more than innovation",
        "summary": "China’s 15th five-year plan is more than a policy blueprint; it is a pivotal turning point. This plan and the next one will define an era of innovation-led growth, solidifying China’s status as a major power and peer competitor to the United States.\nSince the reform and opening-up policy was launched, China’s economic development has had distinct phases. The 1978-1992 period marked the initial stage of opening up. Reform and opening-up was imperative in the wake of economic challenges after the...",
        "source": "smcp",
        "date": "2025-10-28T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3330435/chinas-transition-global-powerhouse-hinges-more-innovation?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3681180306ee3041d8315ba86b36ba81ece9d17284f949d66ca40a91a39d256d",
        "title": "‘Partnership, not pressure’: US soybean farmers urge Trump before Xi talks",
        "summary": "Increasingly desperate US farmers, including many who voted for US President Donald Trump, are urging him to adopt a conciliatory approach rather than a confrontational one if a lasting soy deal can be reached when he meets Chinese President Xi Jinping this week.\nAs the harvest season slips by with no orders from China and rising input costs – from equipment to fertiliser – farmers say partnership, not strong-arming Beijing, would serve both sides better.\nMany voiced frustration at Washington’s...",
        "source": "smcp",
        "date": "2025-10-28T04:50:27+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3330537/us-soybean-farmers-urge-trump-choose-partnership-not-pressure-ahead-xi-meeting?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "51cbea53459c4c87d27fd52707f226956eba1691c6f48792f047abe8ea12f12e",
        "title": "French cyclist freed by Russia says detention was ‘strange experience’",
        "summary": "A French cyclist freed after weeks in a Russian jail for illegally crossing the border on Monday described his time in the country as a “rather strange experience” but said the Russians he met were “friendly”.\nSofiane Sehili, 44, was arrested on the Russian-Chinese border in early September while attempting to break the record for the fastest endurance cycle from Lisbon to Vladivostok.\nSehili, who describes himself as an ultra-endurance racer and adventure cyclist, had faced two years in a...",
        "source": "smcp",
        "date": "2025-10-28T04:03:13+09:00",
        "url": "https://www.scmp.com/news/world/russia-central-asia/article/3330536/french-cyclist-freed-russia-says-detention-was-strange-experience?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e515380fb24d0fd999338b31228e2a176c9b2b95a893c91a0a21b6aa6af02b8e",
        "title": "German foreign minister urges ‘fair’ rare earth, chip trade with China",
        "summary": "German Foreign Minister Johann Wadephul on Monday called for “fair” trade with China in chips and rare earth minerals, amid heightened tensions between China and the European Union.\nWadephul, who last week was forced to cancel a planned visit to China, said he plans to speak to Chinese representatives by phone “as soon as possible and reschedule the trip”.\n“It’s only postponed, not cancelled,” Wadephul said of the visit.\nGermany called off the trip after the Chinese side were unable to confirm...",
        "source": "smcp",
        "date": "2025-10-28T02:10:20+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330532/german-foreign-minister-urges-fair-rare-earth-chip-trade-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f442a16d3d6190dd15cbc7ca9541dd186bea53fa79a1d6fb5cdf536d93130310",
        "title": "China doubles down on crypto crackdown as central bank vows to expand digital yuan",
        "summary": "China on Monday reaffirmed its hardline approach towards virtual currencies at home, warning of the risks of stablecoins, despite growing concerns that the United States might have consolidated its US dollar dominance through them.\nInstead, the world’s second largest economy vowed to broaden the use of its central bank digital currency known as e-CNY, according to Pan Gongsheng, governor of the People’s Bank of China.\n“[Stablecoins] are still in their early stages of development,” said Pan,...",
        "source": "smcp",
        "date": "2025-10-28T00:36:10+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3330525/china-doubles-down-crypto-crackdown-central-bank-vows-expand-digital-yuan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "64235c4e2c35667fe5c8e9b32972e29e8a5991216aee99fc2cf2fb7626f4c47b",
        "title": "‘Hawkish’ interpretations rise as US, China discourse gets lost in translation",
        "summary": "Would the Cold War have unfolded differently if Nikita Khrushchev had chosen a different interpreter? It is a decades-old thought experiment, born of the phrase translated as “we will bury you”, but it is chiming with today’s strategic rivalry between China and the US.\nWhether the statement, attributed to the then-leader of the Soviet Union in 1956, should instead have been interpreted as the less aggressive “we will outlive you”, the incident sheds light on a recurrent headache in modern...",
        "source": "smcp",
        "date": "2025-10-28T00:00:15+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330459/hawkish-interpretations-rise-us-china-discourse-gets-lost-translation?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6676099fb5c6fae50802d111a27aa6ecd32fb2c11daa6d7ad3de5b8276d637c6",
        "title": "China’s Wang Yi hails ‘multipolar world’ ahead of Trump-Xi talks",
        "summary": "China’s Foreign Minister Wang Yi said “a multipolar world is emerging”, positioning Beijing’s latest vision for global governance as a unifying and stabilising framework at a time of increasing turbulence and Washington-driven unilateralism.\nSpeaking in Beijing on Monday, Wang also called for “an end to politicising economic and trade issues, artificially fragmenting global markets, and frequently provoking trade and tariff battles”, a thinly veiled jab at US President Donald Trump.\nHis remarks...",
        "source": "smcp",
        "date": "2025-10-27T23:00:35+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330512/chinas-top-diplomat-wang-yi-hails-multipolar-world-ahead-trump-xi-talks-apec?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b47561675178ddca19c48c2887e74824df1eb433ded40840d956e31126b05ce3",
        "title": "Trump hints at trade deal, end to TikTok saga in run-up to China summit",
        "summary": "US President Donald Trump has said a final ownership deal on TikTok could be struck during an expected meeting with Chinese President Xi Jinping this week, a summit that would build on the latest round of trade talks between representatives of the world’s two largest economies in Malaysia.\nWhen asked whether he anticipated a concrete deal over Chinese firm ByteDance’s divestment of the American version of its short-video app – a persistent sticking point in bilateral relations – Trump said it...",
        "source": "smcp",
        "date": "2025-10-27T23:00:26+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3330504/trump-hints-trade-deal-end-tiktok-saga-run-china-summit?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "dc8ebe10988bcfd69150593928e0aa8d08fb8d5e2b489b029f7cb0132c65d0a7",
        "title": "Tech war: Chinese researchers claim breakthrough in lithography materials",
        "summary": "Chinese researchers claim to have achieved a key breakthrough in lithography technology in the latest step in the country’s effort to achieve self-sufficiency with advanced chips.\nA group of scientists from Peking University, along with other collaborators, made a breakthrough in visualising the molecular behaviour of photoresist, a light-sensitive material used in chipmaking, according to a paper published in top scientific journal Nature. The advance could lead to a significant reduction in...",
        "source": "smcp",
        "date": "2025-10-27T23:00:18+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3330492/tech-war-chinese-researchers-claim-breakthrough-advanced-lithography-materials?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "54456086757f99ae03c0924d5bbe880b77cf022b7dec893989d5e800206705c3",
        "title": "Trump’s Asia trip, South China Sea air crashes: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. To counter China, Trump’s Asia trip seen shoring up shipbuilding with key allies\nWith US President Donald Trump having kicked off his visit to Asia, new collaborations in shipbuilding with Japan and South Korea are set to advance amid ongoing port-fee disputes with China, as Washington seeks to counter Beijing’s dominance in the maritime sector.\n2. Beijing...",
        "source": "smcp",
        "date": "2025-10-27T22:15:13+09:00",
        "url": "https://www.scmp.com/news/china/article/3330510/trumps-asia-trip-south-china-sea-air-crashes-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b51f16dbc901602971966731828aed2c436f91f7f74ca34fe6ca823f2071123c",
        "title": "US-China framework deal only ‘first step’ towards ending trade war: analysts",
        "summary": "After two days of high-level US-China trade talks in Malaysia, Washington hinted the world’s two largest economies had found common ground on key issues ranging from tariffs to Beijing’s expanded rare earth export controls. But analysts cautioned the “real test” would come when both sides had to execute a resulting deal.\nBoth Chinese and US trade officials described the negotiations in Kuala Lumpur over the weekend as “constructive”, with US Treasury Secretary Scott Bessent adding that the...",
        "source": "smcp",
        "date": "2025-10-27T22:00:19+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330479/us-china-framework-deal-only-first-step-towards-ending-trade-war-analysts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f809ac6652dd8479bc015ed8ca25c2dea68a9f159684811d25d5cb0503228dad",
        "title": "China and the US should ‘meet each other halfway’ to solve disputes: Wang Yi",
        "summary": "China and the US should “meet each other halfway” to solve disputes via dialogue instead of exerting pressure, Beijing’s top diplomat Wang Yi told his American counterpart in a phone call on Monday.\n“Healthy, stable and sustainable” Sino-American relations not only benefit both countries but are widely expected by the global community, Wang told US Secretary of State Marco Rubio, according to Xinhua.\nTheir phone call took place after the two countries agreed on a framework deal to extend their...",
        "source": "smcp",
        "date": "2025-10-27T21:49:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330515/china-and-us-should-meet-each-other-halfway-solve-disputes-wang-yi?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4ce12c0a5f912da140aef296595dca7ee53335bfc850a63aab573c0eda876cc5",
        "title": "PLA mouthpiece puts focus on ‘political rectification’ after generals purged",
        "summary": "China’s military mouthpiece has launched a series on “political rectification” – linking it to the ideological purity of the People’s Liberation Army – days after several generals were expelled from the ruling Communist Party for corruption.\nIn the first instalment on Monday, PLA Daily ran four pages of commentary and reporting urging the military to “strengthen and consolidate the consciousness of alignment and adherence”.\nThat was a reference to the alignment between the party leadership and...",
        "source": "smcp",
        "date": "2025-10-27T21:00:13+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3330506/chinas-military-mouthpiece-puts-focus-political-rectification-after-generals-purged?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cd9f019e79942307324c3fd156a22a0503c3425735e5830c51cf1657fed67b10",
        "title": "To counter China, Trump’s Asia trip seen shoring up shipbuilding with key allies",
        "summary": "With US President Donald Trump having kicked off his visit to Asia, new collaborations in shipbuilding with Japan and South Korea are set to advance amid ongoing port-fee disputes with China, as Washington seeks to counter Beijing’s dominance in the maritime sector.\nThe US government has committed to reviving its nearly defunct shipbuilding industry through strategic partnerships, with key allies Japan and South Korea – major shipbuilding countries – welcoming the initiative with open...",
        "source": "smcp",
        "date": "2025-10-27T20:00:32+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3330484/counter-china-trumps-asia-trip-shore-maritime-alliances-japan-south-korea?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ece61928369db2031030bda1d85c5897b6404cf6f6a5b5163443ed0c8ece9072",
        "title": "Why China’s J-16 Hidden Dragon makes headlines despite rise of more advanced jets",
        "summary": "While the world’s air forces are racing to build sixth-generation stealth fighters, it was an older model that made the headlines earlier this month.\nA Chinese J-16, a 4.5-generation multirole fighter, was reported by state media to have intercepted two unidentified foreign warplanes near China’s east coast and to have performed a barrel roll over one of the planes.\nReports said it may have got as close as 10 metres (33 feet) to the other plane during the manoeuvre last year, which was only...",
        "source": "smcp",
        "date": "2025-10-27T20:00:17+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3330388/why-chinas-j-16-hidden-dragon-now-making-headlines-despite-rise-more-advanced-jets?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "56c942a654e9a237138fafa9acbfd4088c52a55d8c8203419fbdfc259c510056",
        "title": "China’s state media reveals Taiwan reunification ‘patriots rule’, economic perks",
        "summary": "A commentary by state news agency Xinhua on Monday said that Taiwan would be “governed by patriots” after reunification with mainland China, and that all of its products would be able to enter the mainland’s market duty-free.\n“We not only seek reunification in formality, what’s more important is the mental bonding of compatriots on the two sides of the strait,” the commentary said, using the pseudonym of Zhong Tai Wen, a new byline that suggested it was important Taiwan-related commentary.\nThe...",
        "source": "smcp",
        "date": "2025-10-27T20:00:12+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3330466/chinas-state-media-reveals-patriots-rule-taiwan-reunification-economic-incentives?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "867ba074ca96283e166108d0ef776647b65a2510f69c024a0e7a5eeec582e4d4",
        "title": "US signs rare earth MOUs with Malaysia, Thailand. Can it hedge against China?",
        "summary": "The United States has ramped up efforts to hedge against rare earth export controls by China – the world’s dominant supplier – through agreements signed on Sunday with two Southeast Asian countries, including one that experts believe could deliver results relatively quickly.\nMemoranda of understanding with Malaysia and Thailand pave the way for increased critical mineral exports to US automotive, defence and hi-tech hardware manufacturers – following a US$8.5 billion US-Australia framework deal...",
        "source": "smcp",
        "date": "2025-10-27T19:30:15+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3330468/us-signs-rare-earth-mous-malaysia-thailand-can-it-hedge-against-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6faf725900f0a4efb58f76b108741565106827326970a21ab2b8d81de01efa30",
        "title": "Chinese premier urges EU to steer ties in ‘right direction’ amid trade discord",
        "summary": "Chinese Premier Li Qiang on Monday urged the European Union to steer their ties in the “right direction” and address trade discord through dialogue, as tensions simmer between Beijing and Brussels.\nAt a bilateral meeting with European Council President Antonio Costa in Kuala Lumpur, Malaysia, Li said Beijing was willing to work with the EU on matters ranging from the environment to technological innovation to supply chains.\n“The development of China-EU relations currently presents both...",
        "source": "smcp",
        "date": "2025-10-27T19:10:34+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330493/chinese-premier-li-qiang-urges-eu-steer-ties-right-direction-amid-trade-discord?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ddce427e6e7960460ab40c441a58001a76081a7e11c44e9ed668b429d3082b23",
        "title": "DeepSeek and Qwen AI models crush Western rivals in cryptocurrency trading challenge",
        "summary": "Chinese artificial intelligence models DeepSeek and Qwen have surged ahead of Western rivals, including GPT, with returns exceeding 100 per cent in just nine days during an ongoing real-market cryptocurrency trading competition.\nDeepSeek’s Chat V3.1 model grew its initial capital of US$10,000 to US$22,500 by 4pm on Monday – a 125 per cent gain since trading began on October 18 – according to the latest update from Alpha Arena, a crypto investment project launched by US research firm Nof1.\nQwen 3...",
        "source": "smcp",
        "date": "2025-10-27T18:00:24+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3330461/deepseek-and-qwen-ai-models-crush-western-rivals-cryptocurrency-trading-challenge?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5e98b5ec6abe974f59f6ff2a4cecdf1c5230fe61116a98602f8f47499b7b32dd",
        "title": "China should step up borrowing to boost domestic demand, economist says",
        "summary": "China’s central government should borrow more to lift domestic demand through supportive monetary and fiscal policy, a Chinese economist has urged.\n“If I can make a recommendation, what I think we could also do is to put together a more aggressive macroeconomic policy using central government leverage or adding central government leverage,” said Huang Yiping, a professor at Peking University and dean of its National School of Development, at the Bund Summit in Shanghai on Saturday.\nThe potential...",
        "source": "smcp",
        "date": "2025-10-27T16:00:13+09:00",
        "url": "https://www.scmp.com/economy/policy/article/3330430/china-should-step-borrowing-boost-domestic-demand-economist-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "062ce24d4606c975f1c535969a56b184a7df9d261cbf538d65707d7f4c27e834",
        "title": "Beijing accuses US of undermining South China Sea peace after twin air crashes",
        "summary": "China said frequent US military deployments in the South China Sea were the “root cause” of maritime security problems after a US Navy fighter and a helicopter crashed into the South China Sea in separate incidents while operating from the same aircraft carrier.\nAt a regular press conference on Monday, Chinese foreign ministry spokesman Guo Jiakun said that if Washington asked, Beijing was “willing to provide assistance to the US from a humanitarian perspective”.\nBut he added: “The US frequently...",
        "source": "smcp",
        "date": "2025-10-27T15:00:13+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3330434/us-navy-helicopter-and-warplane-crash-south-china-sea-same-day?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0bc9a6f16e9b6d780f0b1d9a68224a86c84a9e941004b4849d1ebd913a17770f",
        "title": "China’s industrial profits surge, logging highest growth in nearly 2 years",
        "summary": "Chinese industrial firms saw their highest earnings surge in nearly two years last month, as production revved up while declines in factory-gate prices eased amid a government campaign to rein in excess capacity.\nIndustrial profits climbed for the second straight month in September, rising 21.6 per cent from a year earlier, their biggest gain since November 2023. That followed a 20.4 per cent jump in August.\nFor the first nine months of the year, profits were up 3.2 per cent, according to data...",
        "source": "smcp",
        "date": "2025-10-27T12:29:25+09:00",
        "url": "https://www.scmp.com/economy/economic-indicators/article/3330417/chinas-industrial-profits-surge-september-logging-highest-growth-nearly-2-years?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3e7fc1e17c2ea86a5879d6896754d1ea60fd365372a2ed56b1a3d63c49bf4a4f",
        "title": "Who’s hiring in China? Pet care and advanced manufacturing stand out",
        "summary": "Advanced manufacturing and the provision of services and entertainment – including pet and aged care and the production of short dramas – are powering pockets of growth in an otherwise sluggish Chinese job market, according to data from an online recruitment platform.\nA report looking at third-quarter employment trends published this week by the platform, Zhaopin, said the new materials sector led all employment categories with a 66.7 per cent year-on-year increase in job postings in the period...",
        "source": "smcp",
        "date": "2025-10-27T12:00:13+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330226/new-materials-caring-pets-and-elderly-emerge-bright-spots-chinas-job-market?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3b09fab2e4c46f0cab5281ff92216556dcd04f9560ae8ef4e5d88032ddf3667d",
        "title": "‘We live in anarchy’: John J. Mearsheimer on the limits of containing US, China",
        "summary": "John J. Mearsheimer is the R. Wendell Harrison Distinguished Service Professor of Political Science at the University of Chicago, where he has taught since 1982. He has written extensively on security issues and international politics and is best known for his theory of offensive realism in international relations, which holds that to dominate the international system, great powers must constantly engage in security competition with each other, sometimes leading to war.\nIn this interview,...",
        "source": "smcp",
        "date": "2025-10-27T07:00:26+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330356/john-j-mearsheimer-unavoidable-anarchy-and-what-trump-gets-right-china-russia?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "36b70b02d267afad24484b378008d4c249f3ee34e48f750cf81453eb8fee83f8",
        "title": "India and China resume direct flights as ties improve after 5-year suspension",
        "summary": "India and China resumed direct flights on Sunday after a five-year suspension, a move important both for trade and a symbolic step as Asia’s giants cautiously rebuild relations.\nIndiGo flight 6E1703 from Kolkata touched down in the southern Chinese city of Guangzhou just before 4am, officially resuming non-stop air links that had been suspended since 2020 due to the coronavirus pandemic and subsequent geopolitical tensions.\nThe neighbours – the world’s two most populous nations – remain...",
        "source": "smcp",
        "date": "2025-10-27T06:19:28+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330404/india-and-china-resume-direct-flights-ties-improve-after-5-year-suspension?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8eb9b40c2220a953d06c2418ef355636068ba289db7b6c8949f19fd03eb55c4f",
        "title": "China gives Japan’s new prime minister Sanae Takaichi the cold shoulder",
        "summary": "China has held off on congratulating Japan’s new prime minister nearly a week after her appointment, a break with precedent that sends alarm about the state of relations between the two countries.\nChina hawk Sanae Takaichi, 64, took office on Tuesday, becoming the first woman prime minister in the country’s history and the fifth person to hold the office in five years.\nShe took over from Shigeru Ishiba, who was congratulated by both Chinese President Xi Jinping and Premier Li Qiang on the day he...",
        "source": "smcp",
        "date": "2025-10-27T00:55:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330382/china-gives-japans-new-prime-minister-sanae-takaichi-cold-shoulder?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "53bfd9b8440bfbcc4fbf929babc0bd4b2766527950273f80de3f41c568ab94ff",
        "title": "China unveils ‘mini fridge’ AI server that uses 90% less power than other systems",
        "summary": "Chinese scientists have unveiled what they say is the world’s first brain-like intelligent computer the size of a mini fridge, which has the capabilities of a room-sized supercomputer while using 90 per cent less power.\nThe BI Explorer computing system, or BIE-1, was revealed by members of the Guangdong Institute of Intelligence Science and Technology (GDIIST) at a forum held in the Guangdong-Macau In-depth Cooperation Zone in southern China on Friday.\nThe device packs the capabilities of a...",
        "source": "smcp",
        "date": "2025-10-27T00:00:12+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330383/china-unveils-mini-fridge-ai-server-uses-90-less-power-other-systems?utm_source=rss_feed",
        "reportUrl": ""
    }
]