[
    {
        "id": "e2941732df5a8e8cabcac33ee3020c78e9a7468bddc8c2226034a1d78d4fc769",
        "title": "Can China’s hugely popular mini dramas find success in the US?",
        "summary": "The massive success of China’s mini dramas at home has prompted the industry to set its sights more squarely on the global market, with ever more studios exploring potential in North America, Southeast Asia and beyond.\nThe productions going overseas include translated Chinese dramas and original ones made with local teams.\nThe push comes as Beijing urges more mainland productions to improve the quality of on-air content. A document released on Monday said more support would be given for...",
        "source": "smcp",
        "date": "2025-08-21T10:00:13+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3322495/can-chinas-hugely-popular-mini-dramas-find-success-us-and-other-markets?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d6f5e9926b46f2b8ee190dd70ee02a8014dea4ea44cd968d375bcecf2580e190",
        "title": "Hong Kong’s rally has room to run on ‘reasonable’ valuations: Templeton",
        "summary": "Hong Kong stocks remain favourable, as attractive valuations and easing tariff uncertainty have enhanced the predictability of corporate earnings on the city’s stock market, according to US fund manager Franklin Templeton.\nThe firm, which manages US$1.5 trillion of assets worldwide, was “constructive” on Hong Kong and mainland China’s stock markets, as the valuations remained reasonable and Beijing had introduced supportive policies, said Ferdinand Cheuk, portfolio manager at Templeton Global...",
        "source": "smcp",
        "date": "2025-08-21T08:30:08+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3322518/hong-kongs-stock-rally-still-has-room-run-reasonable-valuations-templeton-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "24016ac6035f9978827d1eb2d915235dea8dbedf90fce532ecfee5d1540b1905",
        "title": "Is the PHL16 multiple rocket launcher China’s answer to the US Himars system?",
        "summary": "As tensions intensify across the Taiwan Strait, Beijing has ramped up its firepower capacity to prepare for a possible war in the region.\nOne of the weapon systems key to these efforts is the PHL-16, a truck-mounted self-propelled multiple rocket launcher (MRL) that incorporates modular design and long-range precision-strike capabilities.\nThe system is often described as the mainland Chinese version of Lockheed Martin’s High Mobility Artillery Rocket System (Himars) that Taiwan has bought and...",
        "source": "smcp",
        "date": "2025-08-21T07:00:30+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3322516/phl16-multiple-rocket-launcher-chinas-answer-us-himars-system?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2d8b450885f6af289213c7397d75e0ff636b69de3024c32e93c48430a874642b",
        "title": "Brazil seeks China’s support to salvage maritime emissions pact opposed by Trump",
        "summary": "Brazil is banking on China to support a landmark UN effort to cut greenhouse gas emissions generated by international shipping as governments prepare for a decisive October vote on the plan.\nOne of the staunchest supporters of the International Maritime Organisation’s proposed Net-Zero Framework, Brasilia is waiting for China to clarify its position on implementation of the plan, Ports and Airports Minister Sílvio Filho told reporters on Wednesday.\nThe situation is setting up a stand-off with...",
        "source": "smcp",
        "date": "2025-08-21T05:06:00+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322577/brazil-seeks-chinas-support-salvage-maritime-emissions-pact-opposed-trump?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3dba02ca4bbd161e39f01dbc2ea8b97f67e8e1a1adb3a89e077360179e181138",
        "title": "Top mathematician Zhang says he left US for China due to political climate",
        "summary": "Mathematician Zhang Yitang, who joined Sun Yat-sen University in Guangzhou from California in June, has called the wave of Chinese researchers exiting the US a “positive trend”.\nZhang, known for his prime number research, told Phoenix TV, a partially state-owned broadcaster, in a programme aired on Monday that he had been thinking about returning to the mainland “in light of recent international political issues that have strained China-US relations”.\nThe Shanghai native, 70, is now a full...",
        "source": "smcp",
        "date": "2025-08-21T00:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322381/mathematician-zhang-yitang-says-he-left-us-china-due-political-climate?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b4ba26ac0eea62727850cbaaeb5548826baca9e20653fe9f7053276b4d6669cd",
        "title": "President Xi Jinping stresses building modern socialist new Xizang",
        "summary": "Chinese President Xi Jinping on Wednesday urged Xizang Autonomous Region to build a modern socialist new Xizang that is united, prosperous, civilized, harmonious and beautiful.",
        "source": "cgtn",
        "date": "2025-08-20T22:47:52+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/President-Xi-Jinping-stresses-building-modern-socialist-new-Xizang-1FZMm5n13vG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ac187d144a2e3791cc6ead98ce4e70d06405d8962b59a447f66458b2db594d43",
        "title": "President Xi meets representatives from across Xizang",
        "summary": "Chinese President Xi Jinping on Wednesday met representatives of various ethnic groups and different walks of life in Lhasa, capital of southwest China's Xizang Autonomous Region.",
        "source": "cgtn",
        "date": "2025-08-20T22:46:09+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/President-Xi-meets-representatives-from-across-Xizang-1FZOVgVw5BC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "8388a8979eca1cb91b3c509ca38ffd3213c05c076fed2e9ac1876e95e8fa4563",
        "title": "An India-China reset, biotech potential for ancient city: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Trump’s tariff blitz sparks unexpected India-China reset\nThe world’s two most-populous countries made significant progress on the diplomatic front recently, and those championing such moves may have Washington to thank.\n2. From space mining to tourism, China’s Guangdong blasts off in pursuit of Musk\nSouth China’s Guangdong province has announced its...",
        "source": "smcp",
        "date": "2025-08-20T22:15:08+09:00",
        "url": "https://www.scmp.com/news/china/article/3322549/trump-tariffs-spark-india-china-reset-chinese-citys-biotech-dream-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9657a65b31823c6be790025457cae6277f40b3b75176bb378ce5424a0f73a624",
        "title": "From Wukong to Zhong Kui: Game Science expands its mythic universe",
        "summary": "From Wukong to Zhong Kui: Game Science expands its mythic universe",
        "source": "cgtn",
        "date": "2025-08-20T22:04:29+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/From-Wukong-to-Zhong-Kui-Game-Science-expands-its-mythic-universe-1FZH4T3EbSM/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "711f045c3e1c380e89da9de356a53c189e4fae0ab73da8593745a5d6acd1bed9",
        "title": "China turns up oil tap from Russia as purchases of US crude remain suspended",
        "summary": "China’s crude oil imports remained robust in July, fuelled by higher Russian shipments, while China’s purchases from the US remained suspended for a second straight month.\nThe latest customs data shows that the volume of inbound crude oil reached 47.2 million tonnes in July, up 11.5 per cent from a year earlier.\nChina purchased 8.71 million tonnes of crude oil from Russia, making it the top source of China’s crude imports last month, according to the official data. This marked a year-on-year...",
        "source": "smcp",
        "date": "2025-08-20T22:00:18+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3322541/china-turns-oil-tap-russia-purchases-us-crude-remain-suspended-july?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c057848285a77fb8e54dee5e392fccc3b29e28bfad606cec92b972da28e9ad36",
        "title": "Xi to attend gathering for Xizang Autonomous Region's 60th anniversary",
        "summary": "Chinese President Xi Jinping will attend a grand gathering in Lhasa, capital of Xizang Autonomous Region, in celebration of the 60th anniversary of the founding of the region on Thursday.",
        "source": "cgtn",
        "date": "2025-08-20T21:12:11+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Xi-to-attend-gathering-for-Xizang-Autonomous-Region-s-60th-anniversary-1FZEFVZas0M/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "48a36ddd2ee42b2206f09c39cc0c87db4f5412ffd27ab7894e6f8bfdd58ef3dc",
        "title": "Did Zhuque-2E launch failure deal a blow to China’s Guo Wang satellite project?",
        "summary": "China’s push to build broadband mega constellations could face further delays after one of the country’s leading privately developed rockets failed after take-off last week from the Jiuquan Satellite Launch Centre in the Gobi Desert.\nThe Zhuque-2E – an upgraded version of the LandSpace rocket that saw the company beat SpaceX in the race to send the world’s first methane-fuelled projectile into orbit – experienced a flight anomaly after lift-off on Friday morning, the company said.\nLandSpace...",
        "source": "smcp",
        "date": "2025-08-20T21:05:07+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322530/did-zhuque-2e-launch-failure-deal-blow-chinas-guo-wang-satellite-project?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "88523f6b88bd3ab3480b5648d6a7033176c8ef3a35f1fc3882d24de04899f1c6",
        "title": "China's growing national parks boost wildlife conservation",
        "summary": "China's growing national parks boost wildlife conservation",
        "source": "cgtn",
        "date": "2025-08-20T20:58:19+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/China-s-growing-national-parks-boost-wildlife-conservation-1FZGNh0fdyE/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ac49e261bdf03805890f91847140c184022ba5d0d91f45ab41825d4f4daefe3d",
        "title": "China's central bank adds 100 bln yuan to quota for disaster relief",
        "summary": "China's central bank adds 100 bln yuan to quota for disaster relief",
        "source": "cgtn",
        "date": "2025-08-20T20:54:45+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/China-s-central-bank-adds-100-bln-yuan-to-quota-for-disaster-relief-1FZGrgO45uE/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f8e2d3146e8ed161f946521937625fd98e5998f686227ab1f5129a2f2c2a84ef",
        "title": "Chinese President Xi Jinping arrives in Tibet for landmark anniversary",
        "summary": "Xi Jinping has arrived in Tibet for events to mark the 60th anniversary of the autonomous region, making him the first Chinese president to attend the once-a-decade activities.\nHe arrived in Lhasa around noon on Wednesday with a high-level entourage including Wang Huning, China’s top political adviser and fourth-ranking official; Cai Qi, the president’s chief of staff; Li Ganjie, head of the United Front Work Department; Vice-Premier He Lifeng; and Public Security Minister Wang Xiaohong,...",
        "source": "smcp",
        "date": "2025-08-20T20:22:54+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3322542/chinese-president-xi-jinping-arrives-tibet-landmark-anniversary?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "71d0d9cbc0fc6f0efb09390bbaf1d5837164938dfc4e0edf1aa51cf863596586",
        "title": "Why China is advancing integrated development of Yangtze River Delta",
        "summary": "Over the past years, Chinese President Xi Jinping has visited the Yangtze River Delta many times, presided over a series of relevant meetings, and given key guidance at the critical junctures in the region's integration path.",
        "source": "cgtn",
        "date": "2025-08-20T19:10:07+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Why-China-is-advancing-integrated-development-of-Yangtze-River-Delta-1FZdGjNTY4w/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "cf1879863d9b596299cdf85ed1974b38e2cf564bae9f6251222d83cc84762d64",
        "title": "Why has China sent research ships to Scarborough Shoal after a collision?",
        "summary": "At least two Chinese research vessels have been operating around Scarborough Shoal at the same time as a Philippine coastguard ship has been patrolling the disputed area of the South China Sea.\nThe Xiang Yang Hong 10, an ocean research vessel operated by China’s Ministry of Natural Resources, has been operating near the reef since last Friday, according to information from the satellite-based Automatic Identification System.\nAnother Chinese research vessel, the Zhuhai Yun, a maritime drone...",
        "source": "smcp",
        "date": "2025-08-20T19:00:25+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322497/why-has-china-sent-research-vessels-scarborough-shoal-after-collision?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2f83ade1357e0d421387bc52a2e1797406535bcc9354f59d3a6061f252b8a7c2",
        "title": "Chinese jeweller Laopu Gold shines as earnings nearly triple",
        "summary": "Robust growth at home and abroad nearly tripled Laopu Gold’s earnings in the first half of the year, with managers predicting even stronger momentum in the second half.\nNet profit soared 290.6 per cent from a year earlier to 2.35 billion yuan (US$327 million) in the six months ended June 30, the Beijing-based company said in a statement on Wednesday. Revenue surged 251 per cent to 12.4 billion yuan.\nThe Hong Kong-listed jeweller attributed its rapid growth to its premium positioning, noting that...",
        "source": "smcp",
        "date": "2025-08-20T18:30:13+09:00",
        "url": "https://www.scmp.com/business/companies/article/3322514/chinese-jeweller-laopu-gold-shines-earnings-nearly-triple-sales-bump-home-abroad?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3daa788206729eaefc464d18cce8cf23f96a7d9981759d3e7957d6d1777072ac",
        "title": "China expands regulatory arsenal in fight against solar industry price wars",
        "summary": "Beijing has signalled stronger action against price wars, convening a high-level symposium of enterprises and regulators – including many left out of previous meetings – to tackle cutthroat competition in the solar sector.\nAuthorities vowed to tighten oversight of new project investments, phasing out outdated capacity through market-based and rule-of-law approaches, according to the Ministry of Industry and Information Technology (MIIT), one of the meeting’s hosts.\n“Efforts will focus on...",
        "source": "smcp",
        "date": "2025-08-20T18:30:09+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3322512/china-expands-regulatory-arsenal-fight-against-solar-industry-price-wars?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "55a3eb2d17c7da93feb50b7cd5d43b7643595db8d47186fc4d917c74a186b3b8",
        "title": "Exquisite phoenix coronet draws crowds at National Museum of China",
        "summary": "The Phoenix Coronet for Empress Xiaoduan is one of the most celebrated artifacts at the National Museum of China in Beijing, attracting long queues of visitors eager to admire and photograph its intricate beauty.",
        "source": "cgtn",
        "date": "2025-08-20T18:20:13+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Exquisite-phoenix-coronet-draws-crowds-at-National-Museum-of-China-1FZCoaoHmQE/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "303b52557fedd5669d152d59ea1907168606c868cda57275c80d5331d8af988b",
        "title": "Dwarkanath Kotnis: The Indian doctor in China's anti-fascist struggle",
        "summary": "During the War of Resistance against Japanese Aggression, Indian doctor Dwarkanath Kotnis volunteered to serve in China, fighting alongside the Chinese people and dedicating his youth and life to Chinese national liberation.",
        "source": "cgtn",
        "date": "2025-08-20T18:18:48+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Dwarkanath-Kotnis-The-Indian-doctor-in-China-s-anti-fascist-struggle-1FZChxtcZYQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "8db8f4370504cdc438f5ae1d1255d44beab0b9d3380204d7d092db1f42b491ae",
        "title": "Dazzling light show in Tianjin features SCO landmarks and culture",
        "summary": "The Haihe River in Tianjin was illuminated with a dazzling light show ahead of the Shanghai Cooperation Organization (SCO) summit from August 31 to September 1.",
        "source": "cgtn",
        "date": "2025-08-20T18:08:42+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Dazzling-light-show-in-Tianjin-features-SCO-landmarks-and-culture-1FZuQkGk7Ys/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b8cb4af4002dc33d419f040e8bd4d9a514a9f5c28b8b6fff2c64435931f8d53d",
        "title": "Chinese Foreign Minister visits Afghanistan for 3-way talks involving Pakistan",
        "summary": "Chinese Foreign Minister Wang Yi has arrived in Kabul to meet his counterparts from Afghanistan and Pakistan.\nIt is Wang’s first trip to the country since a surprise visit in March 2022.\nChina’s Ministry of Foreign Affairs confirmed he arrived in Afghanistan on Wednesday. The ministry had earlier said he would travel to Pakistan later in the day for a three-day visit that will include talks with Ishaq Dar, Pakistan’s deputy prime minister and foreign minister.\nAccording to Geo News, a Pakistani...",
        "source": "smcp",
        "date": "2025-08-20T18:07:45+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322511/chinese-foreign-minister-wang-yi-kabul-3-way-talks-afghan-pakistan-tensions-ease?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e173c3f5512eeef8b34f001dd2a800429cf8acb71277809ba42a750dc58d6a21",
        "title": "Xi arrives in Lhasa for Xizang Autonomous Region founding anniversary",
        "summary": "Chinese President Xi Jinping, who leads a central delegation, arrived in Lhasa, capital of southwest China's Xizang Autonomous Region, on Wednesday to attend activities in celebration of the 60th anniversary of the founding of the region.",
        "source": "cgtn",
        "date": "2025-08-20T18:03:26+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Xi-arrives-in-Lhasa-for-Xizang-Autonomous-Region-founding-celebration-1FZzjqbtXiM/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "95d5835be83d4bc22b0028044585bf3cdb196ed8bd347f7077a2088f30eb5b85",
        "title": "The Chinese City that never sleeps?",
        "summary": "Step into a real-life time machine! This is Datang Everbright City in Xi'an, China.",
        "source": "cgtn",
        "date": "2025-08-20T17:43:13+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/The-Chinese-City-that-never-sleeps--1FZu4O3Q1Qk/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d3460f679a71f389ea6826dc906bbeecef1393beef15be2122167f2b3df531bd",
        "title": "Enjoy a captivating summer trip to Xisha",
        "summary": "Chinese National Geography magazine praised the Xisha Islands in Sansha, Hainan, calling them \"China's most beautiful islands.\" This usually serene paradise has been especially crowded this summer.",
        "source": "cgtn",
        "date": "2025-08-20T17:34:01+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Enjoy-a-captivating-summer-trip-to-Xisha--1FZt4TrKtji/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "30cf1e659c75f9ec55e83ed1f813ff986c5149a6c7f280dabab6671772b45d75",
        "title": "After Shaolin Temple scandal, China’s Buddhists urged to obey law and pay taxes",
        "summary": "Buddhists should obey the law, be patriotic, pay taxes and “play an active role in building the nation and society”, China’s Buddhist regulator said on Tuesday, speaking out for the second time this month about the disgraced abbot of Shaolin Temple.\nIn a statement on its website, the Buddhist Association of China said that Shi Yongxin, the former abbot, had misappropriated and embezzled funds and temple assets, violated Buddhist regulations, and was suspected of criminal offences.\n“This has...",
        "source": "smcp",
        "date": "2025-08-20T17:09:53+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3322500/after-shaolin-temple-scandal-chinas-buddhists-urged-obey-law-and-pay-taxes?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a40291b08c5809ec7158580868c9799c363824c328cd6b545a8f5b775946331c",
        "title": "Wang Yi visits Kabul for meeting with Afghan, Pakistani counterparts",
        "summary": "Chinese Foreign Minister Wang Yi, also a member of the Political Bureau of the Communist Party of China Central Committee, arrived in Kabul, Afghanistan, on Wednesday for the 6th China-Afghanistan-Pakistan Foreign Ministers' Dialogue.",
        "source": "cgtn",
        "date": "2025-08-20T17:08:44+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Wang-Yi-visits-Kabul-for-meeting-with-Afghan-Pakistani-counterparts-1FZwDs388fe/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d3d2233e5a663a874c3bdb649f21852aa22b48c5ae648830366666c838df0505",
        "title": "A frozen tale: The Evenki and their reindeer",
        "summary": "A frozen tale: The Evenki and their reindeer",
        "source": "cgtn",
        "date": "2025-08-20T17:06:03+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/A-frozen-tale-The-Evenki-and-their-reindeer-1FZbuJdq8es/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "74811f3fc8bb8215b089a036ae9c241d56559ca1b3c0fe0e96a06924f72b1691",
        "title": "China-India foreign ministers' meeting achieves 10 outcomes",
        "summary": "Chinese Foreign Minister Wang Yi, also a member of the Political Bureau of the Communist Party of China Central Committee, held talks with his Indian counterpart Subrahmanyam Jaishankar on Monday.",
        "source": "cgtn",
        "date": "2025-08-20T16:50:19+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/China-India-foreign-ministers-meeting-achieves-10-outcomes-1FZrWhVUSac/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "96e802c68e91f2bff457bfb48636a90cb0fbecebf3fd757caa0300a87129ef41",
        "title": "From peaks to prosperity: Xizang's transformation as region turns 60",
        "summary": "From peaks to prosperity: Xizang's transformation as region turns 60",
        "source": "cgtn",
        "date": "2025-08-20T16:25:54+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/From-peaks-to-prosperity-Xizang-s-transformation-as-region-turns-60-1FZi1WhBRqU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "1569f8e2442ca8de931767530ac13f7e6103c0efe5a55a9970ceb4a2f86e823c",
        "title": "Pop Mart targets mobile phones with mini Labubus as it aims to double sales",
        "summary": "Pop Mart said it would be able to easily double this year’s revenue from its 2024 record sales, as it prepares to launch a mini version of the Labubu plush toy to extend its phenomenal success and conquer more hearts beyond mainland China.\nThe company, founded in 2010 in Beijing, could double its 2025 revenue to 30 billion yuan (US$4.2 billion) from last year’s sales of 13 billion yuan, said Pop Mart’s founder and CEO Wang Ning, citing the bigger-than-imagined worldwide market for its plush toys...",
        "source": "smcp",
        "date": "2025-08-20T16:18:13+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3322488/mini-labubus-are-coming-after-your-mobile-phone-pop-mart-aims-double-2025-sales?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f0cace3325592914488db35b8446bb29e386bb6394ef8e5a0b206811b4847246",
        "title": "We shall never forget",
        "summary": "We shall never forget",
        "source": "cgtn",
        "date": "2025-08-20T16:09:50+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/We-shall-never-forget-1FZfsCMCMI8/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "62c0cd4cbd1f035c0a95e92527f0a49badad0bc9cdc87bb19351099ae466dd31",
        "title": "'Black Myth: Zhong Kui' revealed at Gamescom in Cologne",
        "summary": "Chinese studio Game Science revealed \"Black Myth: Zhong Kui\" at Gamescom 2025 in Cologne.",
        "source": "cgtn",
        "date": "2025-08-20T15:59:18+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/-Black-Myth-Zhong-Kui-revealed-at-Gamescom-in-Cologne-1FZfQ8yKRpK/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "01e356f5c4c7462c0de43567189707c72be424ec461390c03199f2f66a5e2ee6",
        "title": "How the SCO is building a model of pragmatic cooperation",
        "summary": "China has made concrete efforts to advance pragmatic cooperation among SCO members since assuming the organization's rotating chairmanship in 2024.",
        "source": "cgtn",
        "date": "2025-08-20T15:36:30+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/How-the-SCO-is-building-a-model-of-pragmatic-cooperation-1FYlgw2Ur3W/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "5cbad816267e8eba13053476a5ae2a3ae79127ada0db5f4d973563f75e4bc6b8",
        "title": "China-India talks: Modi praises ‘stable, predictable, constructive ties’",
        "summary": "China’s top diplomat pointed to progress on border talks and an agreement to reopen various dialogue channels when he met India’s prime minister in New Delhi on Tuesday.\nAs the two countries make cautious efforts to improve relations, Wang Yi told Narendra Modi that he and Indian national security adviser Ajit Doval had reached a consensus on regular management and control to maintain peace in border areas.\nThey also agreed to “properly handle” sensitive points and advance delimitation talks in...",
        "source": "smcp",
        "date": "2025-08-20T15:22:20+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322471/china-india-talks-narendra-modi-praises-stable-predictable-constructive-ties?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "674cfb9d86569e75ec4cf3a09547b091f47f3fea458d717ef3eafe27f6d5f3cc",
        "title": "Sunrise over the Plateau: Enduring Legacy",
        "summary": "Explore the lasting, vibrant, and evolving legacy of culture and nature in southwestern China's Xizang Autonomous Region.",
        "source": "cgtn",
        "date": "2025-08-20T15:19:06+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Sunrise-over-the-Plateau-Enduring-Legacy-1FY4KR1wK9G/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "bf2c0637a54b3f927ad7e7c8272ebc424c3b9e341648c77bc2086a35f05418af",
        "title": "From highlands to happiness: Better lives bloom in Xizang",
        "summary": "Sixty years after its founding, southwest China's Xizang Autonomous Region stands today as a testament to profound change. It shines as a symbol of prosperity, ecological balance and harmonious coexistence between its diverse ethnic groups and the environment.",
        "source": "cgtn",
        "date": "2025-08-20T15:16:59+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/From-highlands-to-happiness-Better-lives-bloom-in-Xizang-1FZa9mZWwsU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "7d9ba91610a16d989f0ba46e3f20f8888beb5c2f53bf2555d919e90be585ef5c",
        "title": "Uzbek edition of Xi Jinping's human rights book launched in Tashkent",
        "summary": "A launch ceremony for the Uzbek-language edition of the book titled \"Xi Jinping: On Respecting and Protecting Human Rights\" was held Tuesday in Tashkent, the capital of Uzbekistan.",
        "source": "cgtn",
        "date": "2025-08-20T15:13:12+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Uzbek-edition-of-Xi-Jinping-s-human-rights-book-launched-in-Tashkent-1FYly3CZjj2/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "8ed2368925c3ffe325eb00e5bfe2752f4042656a819d81fa647da6e056213f8c",
        "title": "Beyond Prejudice: A young German's glimpse of rural China",
        "summary": "Beyond Prejudice: A young German's glimpse of rural China",
        "source": "cgtn",
        "date": "2025-08-20T14:46:35+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Beyond-Prejudice-A-young-German-s-glimpse-of-rural-China-1FZjRqfWWQw/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "56e00de3b623269ed6bd80c854f0bc08cd387845eea5416dbb7b2b89fcb3bac4",
        "title": "Reporter take: How Xizang's development elevates people's well-being",
        "summary": "Reporter take: How Xizang's development elevates people's well-being",
        "source": "cgtn",
        "date": "2025-08-20T14:16:08+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Reporter-take-How-Xizang-s-development-elevates-people-s-well-being-1FZdwMPCm0E/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b7afa0d56ceeee377209cc5c87ddb5c615300050194029971fb51410e76f1867",
        "title": "CMG 'Echoes of Peace' event held in Moscow for Russia edition",
        "summary": "The \"Echoes of Peace\" cultural exchange event, co-hosted by China Media Group (CMG) and the Chinese Embassy in Russia, was held in Moscow on Monday.",
        "source": "cgtn",
        "date": "2025-08-20T14:01:46+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/CMG-Echoes-of-Peace-event-held-in-Moscow-for-Russia-edition-1FZbMyDod8I/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "94b468a53b6549dae8491249a61923cfc88646a5a0762bdac7092b237db225af",
        "title": "HKEX’s first-half profit soars 39% to record high on IPO boom, trading volume",
        "summary": "Hong Kong Exchanges and Clearing (HKEX) set records for second-quarter and first-half earnings amid a boom in initial public offerings (IPOs) and sizzling stock market turnover, according to a stock exchange filing on Wednesday.\nSecond-quarter net profit for the operator of Asia’s third-largest stock market rose 41 per cent to HK$4.44 billion (US$569 million), or HK$3.51 per share, from the previous second-quarter high of HK$3.16 billion in 2024. This is the second consecutive quarterly record...",
        "source": "smcp",
        "date": "2025-08-20T13:33:03+09:00",
        "url": "https://www.scmp.com/business/companies/article/3322459/hkexs-first-half-profit-soars-39-record-ipo-boom-trading-volume?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0af54db82e518e04aa5f389a494a4dfd0aa8b3b9c64da683938bc172ce4f90d8",
        "title": "How the Philippines forced China to adjust historic mission to moon’s far side",
        "summary": "Chinese space engineers made small but deliberate changes to last year’s historic sample retrieval mission to the far side of the moon to avoid political friction in the South China Sea, according to a new paper.\nThe Chang’e-6 spacecraft left the Wenchang spaceport on Hainan Island on board a Long March-5 rocket in May 2024, returning to Earth the following month with the world’s first lunar samples from the moon’s hidden side.\nAccording to the paper published last month by China’s Journal of...",
        "source": "smcp",
        "date": "2025-08-20T13:00:08+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322331/how-philippines-forced-china-adjust-historic-mission-moons-far-side?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5b4d176a311918ba32a5beb277a06fb3d0ec29d2e8182d106ae65e4b3cc003c8",
        "title": "China says it will highlight joint combat groups in next month’s military parade",
        "summary": "The joint combat capabilities of the People’s Liberation Army – a key focus of reforms that began a decade ago – will be showcased during next month’s Victory Day military parade in Beijing.\nWu Zeke, deputy head of the operations bureau at the Central Military Commission’s Joint Staff Department, told reporters on Wednesday there would be “combat-oriented joint formations” made up of land combat, maritime combat, air defence and missile defence groups.\nThe parade would also feature information...",
        "source": "smcp",
        "date": "2025-08-20T12:25:15+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3322448/china-says-it-will-highlight-joint-combat-groups-next-months-military-parade?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5ce81f76279369d29beb766cb39028d35c0e17d335e41d5cae27e52dcef0f830",
        "title": "China unveils parade highlights with many new weapons",
        "summary": "China unveils parade highlights with many new weapons",
        "source": "cgtn",
        "date": "2025-08-20T12:22:07+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/China-unveils-parade-highlights-with-many-new-weapons-1FZ9H2wpejS/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "1783ce9c2ad34910aaa5e4ec9eb76ae59a11107c1a99e99788aef34be9d9507b",
        "title": "From space mining to tourism, China’s Guangdong blasts off in pursuit of Musk",
        "summary": "South China’s Guangdong province has announced its ambition to join the country’s race to expand its commercial space sector, promising financial and policy support for companies wanting to build low-orbit satellite constellation systems and promote their application in futuristic industries including space mining and space tourism.\nGuangdong plans to use government procurement to support key innovative products and application scenarios for satellite constellation systems, which also include...",
        "source": "smcp",
        "date": "2025-08-20T11:52:04+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3322444/mining-tourism-space-ambitions-chinas-guangdong-rival-those-elon-musk?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b1f2dd05138ed2da32018347ae93a890a429f56d623323f5f71cf25e5580cabf",
        "title": "Xi Jinping to review troop formations lining up during V-Day parade",
        "summary": "Chinese President Xi Jinping will review troop formations lining up along Chang'an Avenue during the upcoming military parade, a Chinese official announced on Wednesday.",
        "source": "cgtn",
        "date": "2025-08-20T11:00:32+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/China-briefs-media-on-Sept-3-military-parade-preparations-1FZ64RpatNe/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "05cdcc7c1c295ab1734bfce9b497274387c4dd5563930919522deedf39fa36f1",
        "title": "Trump’s tariff blitz sparks unexpected India-China reset",
        "summary": "The world’s two most-populous countries made significant progress on the diplomatic front recently, and those championing such moves may have Washington to thank.\nIndia has agreed to a long-standing Chinese proposal to ease border tensions while also resuming direct flights and business links, as both sides explore trade cooperation – particularly in strategic sectors like rare earths – in a bid to reset their strained ties.\nExperts highlight that even as deep mistrust lingers, the Asian powers...",
        "source": "smcp",
        "date": "2025-08-20T11:00:19+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322436/india-china-thaw-rare-earths-border-headway-trump-turns-tariff-heat?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b392feabf56522428883fbecca51fb018a0ae6160a51730e3305436662efe053",
        "title": "Is China poised to lead the world with combat-ready ‘loyal wingman’ FH-97 drone?",
        "summary": "The People’s Liberation Army (PLA) is likely to showcase a new type of advanced stealth attack drone during September’s Victory Day parade in Beijing, rehearsal images circulating online suggest.\nThe FH-97, a single-engine, ground-attack uncrewed aircraft, has been described as potentially China’s first combat-ready stealth drone, capable of coordinated aerial warfare alongside crewed jets.\nPhotos leaked online over the weekend appeared to show an FH-97 takng part in the rehearsals for the...",
        "source": "smcp",
        "date": "2025-08-20T10:00:19+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3322417/china-poised-lead-world-combat-ready-loyal-wingman-fh-97-stealth-drone?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c1f30782af02c100933f127f3d610cd6925051fec90d009139424fdfca38bd11",
        "title": "China was the main battlefield against Japanese fascism",
        "summary": "The data poster presents a data-driven perspective on the Chinese battlefield during World War II, highlighting the critical role China played in the defeat of Japanese militarism and uncovering the scale of sacrifice and contribution often overlooked in global narratives.",
        "source": "cgtn",
        "date": "2025-08-20T09:51:24+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/China-was-the-main-battlefield-against-Japanese-fascism-1FZ0xRymwvK/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d8ccc3e77ba474e6a77a2325ec60b9f8be0b6a41ff2d3e168134555396caefdf",
        "title": "How to Make Tsampa?",
        "summary": "Tsampa, flour made from roasted barley grains, has been part of the Tibetan diet for over a thousand years. Join us and learn how to make it the traditional way.",
        "source": "cgtn",
        "date": "2025-08-20T09:24:07+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/How-to-Make-Tsampa--1FXSFXf6pVK/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b64e4e33352bfafedc081b1a77dd3ce0412290bdb35ec872e9bf903bd46fb5a3",
        "title": "Sunrise over the Plateau: Healers on the Plateau",
        "summary": "Despite Xizang's harsh climatic conditions, medical workers have safeguarded the well-being of the Tibetan people through professionalism and perseverance.",
        "source": "cgtn",
        "date": "2025-08-20T09:24:00+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/Sunrise-over-the-Plateau-Healers-on-the-Plateau-1FXAyj9X3Xi/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "52507c3aef4ac4d8373512923689646c387bab84eb230061b1c61a53bb779291",
        "title": "A Day with a Wildlife Ranger",
        "summary": "Journey across Xainza County in SW China's Xizang Autonomous Region with wildlife ranger Tsultrim Tharchin, meet the wild animals that inhabit this land 4,800 meters above sea level.",
        "source": "cgtn",
        "date": "2025-08-20T09:23:53+09:00",
        "url": "https://news.cgtn.com/news/2025-08-20/A-Day-with-a-Wildlife-Ranger-1FXC7x6rhjW/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "c914917c0a5b049b41bc85108a4af3e6af4027f37c8bd3782e1c434260f91031",
        "title": "The ancient Chinese city that dreams to become the world’s biotech powerhouse",
        "summary": "Could a city best known for its classical gardens and ancient canals emerge as China’s answer to Boston – the global epicentre of biotechnology innovation?\nFive years ago, the eastern city of Suzhou set forth a bold vision: to transform itself into the “Pharma Valley of China” by 2030, benchmarking its ambitions directly against Greater Boston’s world-leading life sciences ecosystem.\nThe city in Jiangsu province, steeped in history and famous for its ancient water towns and picturesque gardens,...",
        "source": "smcp",
        "date": "2025-08-20T07:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3321794/chinas-biotech-hub-suzhou-thriving-can-it-become-next-boston?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "38c3d2dc327d895f28c7af22530049da4d83aaa92d2c8e57c5c9fde0a4d2369c",
        "title": "China is not inciting anti-Japan hatred. It is simply remembering",
        "summary": "This year, China marks the 80th anniversary of its victory in the War of Resistance against Japanese Aggression – part of the broader victory in the World Anti-Fascist War. Across the country, commemorative exhibitions, television documentaries and a wave of summer blockbuster films have been rolled out to mark the occasion.\nThese films, set in the dark days of the 1930s and 1940s, are not just historical dramas; they are cultural reminders. They show the destruction of war, the brutality of the...",
        "source": "smcp",
        "date": "2025-08-20T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3322220/chinas-wartime-message-can-sit-alongside-love-todays-japan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3bb514bffbc17d0aaf1dc09d0972b4d3fd034d4e4f817f9bd59af5ce0880f252",
        "title": "US sentences Chinese national to 8 years for smuggling arms to North Korea",
        "summary": "The US has sentenced a Chinese national to eight years in prison for illegally exporting firearms, ammunition, and other military items to North Korea via Hong Kong in return for US$2 million in payments from Pyongyang “for his efforts”, the Justice Department said on Tuesday.\nTaking advantage of lax US gun laws, Shenghua Wen, 42, purchased many of the weapons in Texas and drove them to California, where they were shipped out of the Port of Long Beach, according to court documents. At least one...",
        "source": "smcp",
        "date": "2025-08-20T06:24:14+09:00",
        "url": "https://www.scmp.com/news/us/article/3322431/us-sentences-chinese-national-eight-years-smuggling-arms-north-korea?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7d634dcaddd863c4bc29137ba7f4c28f5b63cde7e4a9aff7f2accf823bfe763d",
        "title": "Argentina registration by China’s BYD hints at local car production",
        "summary": "Chinese electric vehicle giant BYD registered a local unit as a car manufacturer, a possible hint that the world’s biggest EV maker could soon start producing vehicles in South America’s third-largest auto market.\nThe filing, registered with the country’s Justice Ministry, authorises BYD Auto Argentina SAU not only to import and sell cars but also to manufacture and maintain vehicles, batteries and auto parts. Essentially, the registration allows operations across the EV supply and service...",
        "source": "smcp",
        "date": "2025-08-20T05:43:18+09:00",
        "url": "https://www.scmp.com/news/china/article/3322430/argentina-registration-chinas-byd-hints-local-car-production?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "634a218698bf0753e8a9aab31b2825a8c1276285776abce2df41905a3f1f2892",
        "title": "US names 5 more Chinese industries for enforcement under Uygur labour law",
        "summary": "The US Department of Homeland Security (DHS) announced on Tuesday it is designating five new Chinese industry sectors, including copper, lithium and steel, for “high priority” enforcement under a human rights law restricting imports from China’s Xinjiang Uygur autonomous region.\nTuesday’s updated list also names caustic soda – a chemical used in textiles and detergents – and red dates, bringing the total number of high-priority sectors targeted under the law to 12.\nThe Uygur Forced Labour...",
        "source": "smcp",
        "date": "2025-08-20T04:19:51+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3322427/us-names-five-more-chinese-industries-enforcement-under-uygur-labour-law?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d600ecf16dec29c89cec58990675bade426c41dfa23e4d0a39ff4233644f465d",
        "title": "US soybean farmers urge Trump to make purchase deal with China",
        "summary": "American soybean farmers urged US President Donald Trump in a Tuesday letter to reach a trade deal with China that secures significant soybean purchase agreements, warning of dire long-term economic outcomes if the country continues to shun the US crop.\nChina, the world’s largest soybean buyer, is turning to Brazilian cargoes amid trade tensions with the US and continuing negotiations. The country has not pre-purchased soybeans from the coming US harvest, an unusual delay that has worried...",
        "source": "smcp",
        "date": "2025-08-20T02:18:45+09:00",
        "url": "https://www.scmp.com/news/world/united-states-canada/article/3322424/us-soybean-farmers-urge-trump-make-purchase-deal-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "02223dfbfd7e41fab411cb5015c4b2832e548e1b866b8d0576ef75bcf7402009",
        "title": "China's record-breaking sanfu days end, but heat continues",
        "summary": "China's record-breaking sanfu days end, but heat continues",
        "source": "cgtn",
        "date": "2025-08-20T00:19:31+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/China-s-record-breaking-sanfu-days-end-but-heat-continues-1FYcFBlqOFG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "c1f8b6269d9abc6aa1df405db23bb9b28e91e5e802b2e5996563295c5e837a41",
        "title": "Top engineer involved in Boeing 787 and A380 design leaves US for China",
        "summary": "Zhou Ming, renowned as the mastermind behind key industrial software used in planes such as the Boeing 787 and Airbus A380, has left his leadership role at US-based global engineering giant Altair to return to China.\nAn announcement on the website of the College of Engineering at the Eastern Institute of Technology in Ningbo said Zhou had joined as a chair professor and the first dean of the college in June and was already setting up a research team.\nZhou also confirmed the move on his personal...",
        "source": "smcp",
        "date": "2025-08-20T00:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322380/zhou-ming-top-engineer-involved-boeing-787-and-a380-design-leaves-us-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0e401fe66868793ea12cebe79d21e396bdc8f0c339b10482fea1ee37b641e6be",
        "title": "CGTN Poll: Chinese modernization drives Xizang's leaping development",
        "summary": "CGTN Poll: Chinese modernization drives Xizang's leaping development",
        "source": "cgtn",
        "date": "2025-08-19T23:47:25+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/CGTN-Poll-Chinese-modernization-drives-Xizang-s-leaping-development-1FYc8qL3R7y/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "c6b631ad0b207f887cd38b996883c423f869db6d031f5b281eeb6da894ac9072",
        "title": "China’s exports to Global South surge, Putin taps Brazil: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Trump says he will arrange Putin, Zelensky meeting after speaking with both\n\nUS President Donald Trump said on Monday that he was brokering a meeting between Ukraine’s President Volodymyr Zelensky and their Russian counterpart, Vladimir Putin, to be followed by a trilateral meeting that would include the US leader.\n2. China’s exports, investments to Global...",
        "source": "smcp",
        "date": "2025-08-19T22:15:12+09:00",
        "url": "https://www.scmp.com/news/china/article/3322393/trump-encourages-putin-zelensky-talks-sars-virologists-warning-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "054cfca9a69c6dad2dd0ff03bc50d2d75cefd62aae951373317bc30216ffa83f",
        "title": "China confirms Indian Prime Minister Narendra Modi will visit at end of month",
        "summary": "Chinese Foreign Minister Wang Yi has confirmed that Indian Prime Minister Narendra Modi will visit China at the end of the month for the Shanghai Cooperation Organisation (SCO) summit.\nHis comments, made during talks on the two countries’ border dispute with Indian national security adviser Ajit Doval on Tuesday, came in the wake of a series of reports in Indian media that the visit would go ahead.\nIt will be Modi’s first trip to China in seven years and raises expectations he will meet Chinese...",
        "source": "smcp",
        "date": "2025-08-19T22:09:23+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322411/china-confirms-indian-prime-minister-narendra-modi-will-visit-end-month?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6c308d1e6315c21ff771aff494f49144cb71b5ee3d70923c099159dcc25fddcc",
        "title": "‘Not easy’: how a US firm avoided Trump’s China tariffs by sourcing American",
        "summary": "Denis Gagnon had long wanted to establish a manufacturing firm supplied only by American-made parts, a vision shaped by his experience in the international corporate world and his assessment of business risks offshore.\nHe was an outlier in an era of globalisation when businesspeople, including his US peers, waxed lyrical about outsourcing from Asia to minimise production costs.\nThe Gagnons, including his son William, run a medium-sized company called Excel Dryer in the US state of...",
        "source": "smcp",
        "date": "2025-08-19T22:00:09+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3322375/not-easy-how-us-firm-avoided-trumps-china-tariffs-sourcing-american?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b52a68175896239fce787593dbca0c5c9a131d03d098ca3f84c2c021ad1046f5",
        "title": "How Beijing and other South China Sea claimants can see eye to eye",
        "summary": "Few disputes in Asia are as enduring – and as polarising – as those over the South China Sea. For more than a decade, two sharply opposed narratives have dominated. In one, Beijing is seen as using force, or the threat of force, to change the status quo, undermining peace and stability. In the other, China is portrayed as exercising restraint, acting within its rights and working to safeguard regional stability.\nThese perspectives are not merely different; they are mutually exclusive. One side’s...",
        "source": "smcp",
        "date": "2025-08-19T21:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3322260/how-beijing-and-other-south-china-sea-claimants-can-see-eye-eye?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5c7790f0db545e4025e37dd328b04fc7e59abcc1fd156750b1889cba10cf28cf",
        "title": "China’s Weibo shuts down social media accounts for ‘inciting gender antagonism’",
        "summary": "The Chinese social media platform Weibo has shut down several accounts for “inciting gender antagonism” and vowed to continue cracking down on such behaviour.\nOn Monday, the social media site announced via its official account that it had permanently closed an account named “Lilian Shuodao” for “continuously stigmatising the opposite sex and posting extreme anti-marriage remarks”. The term “opposite sex” referred to men.\nAs of Tuesday, the banned account, which had 129,000 followers, was no...",
        "source": "smcp",
        "date": "2025-08-19T21:15:38+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3322407/chinas-weibo-shuts-down-social-media-accounts-inciting-gender-antagonism?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c0739161e094e37d0a4a057ce15acbc7f1265be01dd94dfa750775616e2577af",
        "title": "‘Treat drones like bullets’: Taiwan seeks around 50,000 UAVs over 2 years",
        "summary": "Taiwan is moving to buy nearly 50,000 drones over the next two years as it seeks to bolster its asymmetric combat capabilities against mounting military pressure from Beijing.\nThe move comes as the island’s military prepares to classify unmanned aerial vehicles (UAVs) as consumables to accelerate procurement – a policy that mirrors a recent shift by the United States.\nAccording to a recent tender notice published on the Taiwanese government’s procurement website, the defence ministry’s Armaments...",
        "source": "smcp",
        "date": "2025-08-19T21:12:27+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3322406/treat-drones-bullets-taiwan-seeks-50000-new-uavs-over-two-years-boost-defences?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f74397cd00254b67cd3a643863db955acec481a8500b752269070d68295911c4",
        "title": "Labubu phenomenon drives Pop Mart’s record interim sales, earnings",
        "summary": "Pop Mart established itself as the world’s most valuable toy producer and exporter of China’s “soft power” after the global phenomenon of its Labubu plush toys and figurines drove overseas revenue to soar fivefold in the first half.\nOnline and in-store revenue outside China and Taiwan jumped to 5.59 billion yuan (US$778 million) in the first six months, making up about 40 per cent of the Beijing-based group’s total interim sales of 13.88 billion yuan, which beat analysts’ estimates, Pop Mart...",
        "source": "smcp",
        "date": "2025-08-19T20:11:36+09:00",
        "url": "https://www.scmp.com/business/article/3322400/pop-marts-interim-sales-soar-labubu-craze-fuels-chinese-toymakers-record-earnings?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "96c2f6097d426bbd5156c6376ae99cc1dada937ec8c334024f5f5da5d2cbaf0e",
        "title": "Surprising many, Nobody becomes China’s top 2D animated film at the box office",
        "summary": "There’s a new king atop China’s 2D animated box office, and it’s Nobody.\nShanghai Animation Film Studio’s movie has overtaken Makoto Shinkai’s Suzume as the highest-grossing 2D animated film in Chinese box office history while becoming a dark horse in the nation’s summer movie season.\nWith its success, Nobody has dethroned the dominance of Japanese animated films in China.\nBefore Nobody’s debut on August 2, the all-time top three such movies at the Chinese box office were Suzume, having...",
        "source": "smcp",
        "date": "2025-08-19T19:30:07+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3322376/surprising-many-nobody-becomes-chinas-top-2d-animated-film-box-office?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a6ff1a31502a2191a18edfcc53227ff1805a0ad47b116e7912ad698969bafa8a",
        "title": "Europe breathes sigh of relief, but doubts linger over Trump’s Ukraine pledges",
        "summary": "European leaders left Washington on Monday with a palpable sense of relief, having avoided a breakdown with Donald Trump over Ukraine – but in the cold light of day, doubts are growing over the substance of the “breakthroughs” they claimed.\nAfter meetings with Trump that bordered on the obsequious, eight European leaders – including Ukrainian President Volodymyr Zelensky – trumpeted the trip as a success.\n“This was the best of our meetings,” Zelensky said. “I was able to show many things, even...",
        "source": "smcp",
        "date": "2025-08-19T19:28:43+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322395/european-leaders-breathe-sigh-relief-doubts-linger-over-trumps-pledges-ukraine?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b217810f5f55fe0ced4766c0200c4f01d4e221c4597a23e7635badc260817354",
        "title": "The Front Line: taking stock of China’s military modernisation",
        "summary": "",
        "source": "smcp",
        "date": "2025-08-19T19:03:46+09:00",
        "url": "https://www.scmp.com/news/china/series/3322391/front-line-taking-stock-chinas-military-modernisation?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e0ad3f7505e5e217546dfc4b21cff9222c8b3d37a2feb5506b28501840c06684",
        "title": "80 years on: marking the end of World War II",
        "summary": "",
        "source": "smcp",
        "date": "2025-08-19T18:43:26+09:00",
        "url": "https://www.scmp.com/news/china/series/3322388/80-years-marking-end-world-war-ii?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "284ce03042a143d9c08275d4b15776f0266b284a6f3b814b76ec4f75a7268d20",
        "title": "China launches plan to improve TV and mini-dramas amid soft power push",
        "summary": "China has called for more mini-dramas, documentaries, animations and foreign programmes to air on television to improve the quality of content.\nThe National Radio and Television Administration (NRTA) has released a set of measures, made public on Monday, launching a “content renewal plan” to improve innovation, the management of television series, content censorship and the promotion of programmes.\nThe document stressed that more support would be given to producing quality documentaries and...",
        "source": "smcp",
        "date": "2025-08-19T18:00:26+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3322368/china-launches-plan-improve-tv-and-mini-dramas-amid-soft-power-push?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7483f6c297774ecd9c3d828e82e9a18eedc03043e15c83e3232bb1cc8ce5fdb2",
        "title": "China-India ties: on Delhi trip, Wang Yi appeals for partnership and opportunity",
        "summary": "China and India should see each other as “partners and opportunities” and offer the world “much-needed certainty and stability”, Chinese Foreign Minister Wang Yi said during his first visit to India in three years amid recovering bilateral ties.\nSpeaking to his Indian counterpart, Subrahmanyam Jaishankar, in New Delhi on Monday, Wang said that both countries should “put each other’s precious resources into development and revitalisation”.\n“China and India should explore the right path of...",
        "source": "smcp",
        "date": "2025-08-19T16:56:23+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322353/chinas-wang-yi-appeals-shared-vision-partnership-and-opportunity-india-trip?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2102eba602bf1f000f1a7d999f558718ce2c57dbfb98efc577b1fe6df6955732",
        "title": "China’s youth unemployment hits 11-month high as graduates join job hunt",
        "summary": "China’s youth unemployment rate rose to its highest level in 11 months in July, as a record number of graduates enter an already shaky labour market.\nThe urban jobless rate for the 16-24 age group, excluding students, rose to 17.8 per cent last month from 14.5 per cent in June, putting an end to four straight months of decline and marking the metric’s highest level since last August, according to data released by the National Bureau of Statistics on Tuesday.\nThe figures come as a record 12.2...",
        "source": "smcp",
        "date": "2025-08-19T16:06:16+09:00",
        "url": "https://www.scmp.com/economy/economic-indicators/article/3322347/chinas-youth-unemployment-hits-11-month-high-army-graduates-joins-job-hunt?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "489ff25b9f5af6df300873ee5bf1efef2689fe56eb3cc901d03b2c992e0e1ff1",
        "title": "China unveils crewed tilt-rotor aircraft but how does it compare with US Osprey?",
        "summary": "A Chinese version of the US military’s Osprey tilt-rotor aircraft has been captured conducting what appears to be its maiden flight in a photograph that began circulating on social media in China on Monday.\nThe picture shows a white prototype tilt-rotor aircraft hovering in front of a residential building with its rotors positioned vertically, indicating that it was in helicopter mode.\n\nThe cockpit design suggests it is crewed, although it is unclear from the photo whether there is a pilot on...",
        "source": "smcp",
        "date": "2025-08-19T15:00:15+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3322304/china-unveils-crewed-tilt-rotor-aircraft-how-does-it-compare-us-osprey?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c0ae36d5238a73d7fb466246c4c68113d48b92e2815290c2ff472218a99f36ad",
        "title": "Why are honeybees dying en masse in the United States but thriving in China?",
        "summary": "While the US suffered its largest recorded collapse in its commercial honeybee colonies, China’s bee population has reached a historic high, maintaining the country’s long-standing position as the world’s largest producer of apiary goods.\nAround 62 per cent of managed colonies perished in a devastating wave of losses that swept across the US from June 2024 to January this year, to the alarm of the agricultural sector which relies on bee pollination for about one-third of its crops.\nScientists...",
        "source": "smcp",
        "date": "2025-08-19T13:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322217/why-are-honeybees-dying-massively-united-states-thriving-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "89423b1a5db6345dc99451b44a09d2a7d5949e3fb8f006eb01b8d1721d2a2f09",
        "title": "China’s exports, investments to Global South surge in ‘age of tariffs’: report",
        "summary": "China is accelerating its pivot to the Global South to reduce reliance on the United States, potentially creating “a new order of global commerce”, according to a new report.\nChinese exports to the Global South – covering most of the developing world – have doubled since 2015, with growth seeing a notable uptick after the US-China trade war during US President Donald Trump’s first term, S&amp;P analysts said on Tuesday.\nIn the past five years, these exports have risen by 65 per cent – tripling the...",
        "source": "smcp",
        "date": "2025-08-19T11:00:13+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3322225/chinas-exports-investments-global-south-surge-age-tariffs-report?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b1e2bae4189c48e59e9c6ee2194178deeb70ef5fdef7c327391194000cdfb69f",
        "title": "Hong Kong can’t afford to outsource its healthcare to mainland China",
        "summary": "In recent years, Hongkongers have developed a new habit: going north for their medical check-ups. A 2024 survey found nearly one in three residents had sought medical care in mainland China. The reasons are as predictable as they are troubling: shorter queues, cheaper drugs and upfront prices.\nIf this trend sounds like a temporary release valve for a stressed system, think again. What we’re seeing isn’t a convenient side option; it’s an unofficial outsourcing of healthcare. Left unchecked, it...",
        "source": "smcp",
        "date": "2025-08-19T10:30:09+09:00",
        "url": "https://www.scmp.com/opinion/hong-kong-opinion/article/3322178/hong-kong-cant-afford-outsource-its-healthcare-mainland-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cc7542beeb3bb7309ff78c081934c7b83f67729a51203d3791baf61200fa55f9",
        "title": "China’s Type 99A main battle tank sets benchmark for capability, survivability",
        "summary": "China is preparing for a military parade next month to celebrate the 80th anniversary of Japan’s defeat in World War II, with the People’s Liberation Army expected to showcase its latest line-up of land-based weapons systems.\nOne of the systems playing a crucial role in Chinese ground forces is the Type 99A main battle tank (MBT), which incorporates multiple advanced technologies to enhance survivability and firing capability.\nWhile China continues to focus on modernising its navy and air force,...",
        "source": "smcp",
        "date": "2025-08-19T10:00:08+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3320318/type-99a-chinas-most-advanced-tank-delivers-firepower-agility-and-survivability?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "022c2eec174fc4e15a4c068e8c893b845a890557b407024433bdb4c8be749567",
        "title": "Putin taps Brazil in China-linked peace push as Trump hosts Zelensky",
        "summary": "As US President Donald Trump prepared for the arrival of his Ukrainian counterpart Volodymyr Zelensky, Russia’s Vladimir Putin turned to another partner to discuss a possible path out of the war: Brazil.\nThe South American country’s President Luiz Inácio Lula da Silva spoke by phone with Putin on Monday, the Planalto Palace said, as Moscow pressed its case for new diplomatic efforts over the conflict.\nAccording to the official readout, Putin used the 40-minute call to brief Lula on his meeting...",
        "source": "smcp",
        "date": "2025-08-19T09:44:21+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322294/putin-taps-brazil-china-linked-peace-push-trump-hosts-zelensky?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d32d119083bd16aaf31dbda1076786a5541e57fe6715dea412fd064236a725aa",
        "title": "Alibaba’s Qwen 3 AI coding model gains on Claude Sonnet 4 in popularity",
        "summary": "Alibaba Group Holding’s artificial intelligence coding model Qwen 3 Coder has been gaining popularity globally amid intensified competition in the AI-assisted coding sector, according to data from a third-party agency.\nThe model’s usage share on AI marketplace OpenRouter soared to more than 20 per cent as of mid-August, trailing only Amazon.com-backed Anthropic’s Claude Sonnet 4 with 31 per cent of usage.\nAlibaba’s Qwen team released the Qwen 3 Coder on July 23, claiming it delivers top-tier AI...",
        "source": "smcp",
        "date": "2025-08-19T09:00:20+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3322264/alibabas-ai-coding-model-qwen-3-coder-soars-popularity-challenging-claude-sonnet-4?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7e69240e173feb2595ad31214884a31ce14e1c465bae591e03de135bacf98057",
        "title": "Chinese spacesuit reaches 20 spacewalks, extending in-orbit lifespan",
        "summary": "Chinese spacesuit reaches 20 spacewalks, extending in-orbit lifespan",
        "source": "cgtn",
        "date": "2025-08-18T22:59:23+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Chinese-spacesuit-reaches-20-spacewalks-extending-in-orbit-lifespan-1FWyUx3xGuc/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "97932d8bab5141a91acb5d82d4ef21db189dc12ad65992c5fb0900e90f7c0817",
        "title": "China urges relevant nations to stop interfering in Hong Kong affairs",
        "summary": "China urges relevant nations to stop interfering in Hong Kong affairs",
        "source": "cgtn",
        "date": "2025-08-18T20:49:10+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/China-urges-relevant-nations-to-stop-interfering-in-Hong-Kong-affairs-1FWmhpRomSA/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "97f3b86483fbe0d4eac28e24b9d4c7104b8cb66e851182d165026e757a9d1dbc",
        "title": "BizFocus Ep.132: China's humanoid robotics market reshaping workforce",
        "summary": "BizFocus Ep.132: China's humanoid robotics market reshaping workforce",
        "source": "cgtn",
        "date": "2025-08-18T20:32:25+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/BizFocus-Ep-132-China-s-humanoid-robotics-market-reshaping-workforce-1FWpiv81GFi/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "fac588f645b378981a4aa218b0898a0b61be60861f666a34104429ecc01ea3fb",
        "title": "Tibetan village doctor",
        "summary": "Although Padma Yudron feels frustrated at times, her has become determined to improve healthcare for all.",
        "source": "cgtn",
        "date": "2025-08-18T19:39:49+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Tibetan-village-doctor--1FWf5DIXPig/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "cc57afaa3a410c7dc8525d9e95e0518b4ee5e2450f4791ab79fa15e0c3fc435e",
        "title": "Sunrise over the Plateau: Vibrant Roof of the World",
        "summary": "Sixty years have passed in the unfolding of time. Through the shifting chords, \"Vibrant Roof of the World\" invites you to witness an economic leap across time.",
        "source": "cgtn",
        "date": "2025-08-18T19:39:39+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Sunrise-over-the-Plateau-Vibrant-Roof-of-the-World-1FWkgdmJRo4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "1b2bb6af38c4dbc5538ef9636ecb725e2d1e829b4f9ef4748f16bd51b6e3d0d7",
        "title": "China to work with India to boost peace, tranquility in border areas",
        "summary": "China to work with India to boost peace, tranquility in border areas",
        "source": "cgtn",
        "date": "2025-08-18T19:16:18+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/China-to-work-with-India-to-boost-peace-tranquility-in-border-areas-1FWjRrhAFOM/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "5b48551955e8a7ed7f79caa061155d4dbad9d4c069b901a73d7aa754c7f96be4",
        "title": "Laoniuwan Village: Where the Yellow River meets the Great Wall",
        "summary": "Laoniuwan (Old Ox Bay) Village is famous for its unique location at the point where the Yellow River enters Shanxi Province and meets the Great Wall.",
        "source": "cgtn",
        "date": "2025-08-18T17:38:03+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Laoniuwan-Village-Where-the-Yellow-River-meets-the-Great-Wall--1FWdf0hoKju/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "21a5dbb50271f4b6036848c938bbb552888e8f07c52b77da1154e12407a0a52e",
        "title": "China extends probe into EU dairy products to February 2026",
        "summary": "China extends probe into EU dairy products to February 2026",
        "source": "cgtn",
        "date": "2025-08-18T17:24:28+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/China-extends-probe-into-EU-dairy-products-to-February-2026-1FWdhuFLvI4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "32424368f203cb2b9ddebee87588c02b03c5d6b598f7ea66be325e84b6bdcf3a",
        "title": "Millennial terraces reborn: Hani people's path to poverty alleviation",
        "summary": "Millennial terraces reborn: Hani people's path to poverty alleviation",
        "source": "cgtn",
        "date": "2025-08-18T17:23:20+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Millennial-terraces-reborn-Hani-people-s-path-to-poverty-alleviation-1FW5wkqB5rG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "04f785d8091964f4b06d4852dfc8bd268bcd4f4430d924983288a71c80594bc4",
        "title": "Tidal guardians: Symphony of life in mangrove forests",
        "summary": "Tidal guardians: Symphony of life in mangrove forests",
        "source": "cgtn",
        "date": "2025-08-18T16:57:44+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Tidal-guardians-Symphony-of-life-in-mangrove-forests-1FW5Hy6jjc4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "fc2bb4d7e40d61d6574ae636d1570a986d624144f2c1e73353d1dc98e05740ce",
        "title": "Farewell and thank you, Chengdu – World Games memories live on",
        "summary": "The World Games 2025 in Chengdu have come to an end, but the memories remain vivid. Before heading home, participants from around the globe shared their heartfelt gratitude to the city and its people.",
        "source": "cgtn",
        "date": "2025-08-18T16:39:54+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Farewell-and-thank-you-Chengdu-World-Games-memories-live-on-1FWagorwqEU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "916f4a52720a9405d8cc78e9d217a41f03f9d5445087d653bb0e5bab74b1e36a",
        "title": "A Pakistani scientist's journey of cultivation in China",
        "summary": "From Pakistan to China, Mohammed Khalid Hamid is turning research into results — boosting crop yields by up to 40 percent and building China-Pakistan ties in his own way.",
        "source": "cgtn",
        "date": "2025-08-18T16:31:49+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/A-Pakistani-scientist-s-journey-of-cultivation-in-China-1FW6NJJn212/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "8e6526d79d42807963b53d726baf81c5c644d52476780fd490dac9b4e1358504",
        "title": "China's 2025 summer box office surpasses 10 billion yuan",
        "summary": "China's 2025 summer box office revenue has surpassed 10 billion yuan (about $1.4 billion) as of Monday, with domestic productions dominating the top three spots, according to ticketing platforms Maoyan and Beacon.",
        "source": "cgtn",
        "date": "2025-08-18T16:28:21+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/China-s-2025-summer-box-office-surpasses-10-billion-yuan-1FW9MQeuAQE/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0c24c1a2f06af8008244a3e4e08a810b0c9d30c88ec86581a810b58c9633dc1f",
        "title": "China to hold press conference on military parade preparations",
        "summary": "China's State Council Information Office will host a press conference at 10 a.m. on Wednesday to outline preparations for the upcoming military parade.",
        "source": "cgtn",
        "date": "2025-08-18T15:16:15+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/China-to-hold-press-conference-on-military-parade-preparations-1FW4RyGEB4k/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "80dc87ae445c40cb3b1bef5551047982663d82c4fb88510b3334780f30a81901",
        "title": "'Study in scarlet' in Leshan: Deliveryman, police save trapped woman",
        "summary": "'Study in scarlet' in Leshan: Deliveryman, police save trapped woman",
        "source": "cgtn",
        "date": "2025-08-18T15:11:54+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/-Study-in-scarlet-in-Leshan-Deliveryman-police-save-trapped-woman-1FW4bwiGGcw/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    }
]