[
    {
        "id": "2bb62876f9757573c98a5e93715ba3b06dbc022bd523b11c73f2205dd1346822",
        "title": "China-made motor sales surge in South Africa, cutting into rival brands’ dominance",
        "summary": "Just a few years ago, Chinese-made cars were rare on South African roads, with manufacturers seen only as fringe players. However, this is quickly changing as Chinese carmakers now outsell some established Western, American and Japanese brands.\nIn recent years, South Africans have increasingly been buying Chinese brands like Chery and Haval, a subsidiary of Great Wall Motor (GWM), driven by affordability and feature-rich vehicles. Banking on growing demand, several Chinese car brands are now...",
        "source": "smcp",
        "date": "2025-10-18T13:00:10+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329316/china-made-motor-sales-surge-south-africa-cutting-rival-brands-market-dominance?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "634db353b94534a88bad4409d6957f446b9cba0eb6c9c3514a67dc538cdb7447",
        "title": "Top US and China envoys set trade talks after ‘constructive’ phone call",
        "summary": "Chinese Vice-Premier He Lifeng and US Treasury Secretary Scott Bessent held a phone call on Saturday morning and stated that trade negotiators from their countries would meet next week.\n“This evening, Vice-Premier He Lifeng and I engaged in frank and detailed discussions regarding trade between the United States and China,” Bessent wrote on social media on Friday evening in Washington.\n“We will meet in person next week to continue our discussions.”\nIn a separate read-out, China described He’s...",
        "source": "smcp",
        "date": "2025-10-18T12:46:06+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329494/top-us-and-china-trade-envoys-set-trade-talks-after-constructive-phone-call?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "77d0be619efec7c24089cb59b578ad592276b22f0c6d68669d45c28d6b23ca30",
        "title": "Alibaba Cloud claims to slash Nvidia GPU use by 82% with new pooling system",
        "summary": "Alibaba Group Holding has introduced a computing pooling solution that it said led to an 82 per cent cut in the number of Nvidia graphics processing units (GPUs) needed to serve its artificial intelligence models.\nThe system, called Aegaeon, was beta tested in Alibaba Cloud’s model marketplace for more than three months, where it reduced the number of Nvidia H20 GPUs required to serve dozens of models of up to 72 billion parameters from 1,192 to 213, according to a research paper presented this...",
        "source": "smcp",
        "date": "2025-10-18T12:00:12+09:00",
        "url": "https://www.scmp.com/business/article/3329450/alibaba-cloud-claims-slash-nvidia-gpu-use-82-new-pooling-system?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e82357d9b1bd16756bec97e7f3f09428e3f8ed57248ab62958290458b113d78a",
        "title": "Chinese spy drama Silent Honour inspires praise for real-life agents",
        "summary": "The Chinese public has come out in force to pay tribute to Communist Party undercover agents who perished during the 1940s civil war, inspired by a television drama that gained a passionate following and sparked an outpouring of praise.\nThe fervour centres on Silent Honour, the mainland’s first television series to chronicle the Communist Party’s espionage activities in Taiwan in the war’s final months when one of the party’s major intelligence operations was systematically crushed by the...",
        "source": "smcp",
        "date": "2025-10-18T11:00:11+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3329472/popular-chinese-spy-drama-silent-honour-inspires-outpouring-praise-real-life-agents?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a896426dc9ca87252822ced9a38f5e2b1049fd657e9c75773fa52a406048d01c",
        "title": "New lending and repo plans accelerate the yuan’s challenge to the US dollar",
        "summary": "When Hong Kong businessman Sunny Yip Yuk-chik heard about a new scheme that would make it easier and cheaper to borrow Chinese yuan, he immediately called his staff on the Chinese mainland with the news.\nEarlier this month, the Hong Kong Monetary Authority (HKMA) launched a 100 billion yuan (US$14 billion) Renminbi Business Facility (RBF) that would enable business owners like Yip to borrow yuan from Hong Kong banks for up to 12 months at the onshore yuan interest rate, easing trade...",
        "source": "smcp",
        "date": "2025-10-18T10:00:14+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3329388/how-hong-kong-building-ecosystem-solidify-its-role-offshore-yuan-hub?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "03e25bc4db2660f45d61f9c7c082a5999e5ce8de92b95478bf74ac909d8dd714",
        "title": "The aircraft carrier champion and naval genius behind China’s blue sea strategy",
        "summary": "The commissioning of the Fujian, China’s third and most advanced aircraft carrier, will mark yet another milestone in the country’s naval ambition.\nBehind this gigantic symbol of China’s maritime power lies the vision of one man: Admiral Liu Huaqing, who famously said that he would not die peacefully until his country had an aircraft carrier.\nThe former commander of the Chinese navy was also a revered strategist and a visionary technocrat who directed the comprehensive modernisation of China’s...",
        "source": "smcp",
        "date": "2025-10-18T09:00:10+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3329413/aircraft-carrier-champion-and-naval-genius-behind-chinas-blue-sea-strategy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d8f991dfa2928383d770ab1b78e603c58145e5b97e5dcabb9fbf90f4f5f0c6ef",
        "title": "Trump and Xi’s shock tactics see trade war remain in a stalemate",
        "summary": "Blame games, tit-for-tat threats, off-again on-again meetings between US President Donald Trump and Chinese President Xi Jinping, and wild tariff swings seem to be the recent order of the day.\nAccording to former government officials and analysts, however, this should come as no surprise – it’s just the price you pay when diplomatic norms are brushed off.\nIn the latest twist in the saga, Trump on Friday swung from tough to conciliatory, appearing to reverse threats made a week earlier to cancel...",
        "source": "smcp",
        "date": "2025-10-18T07:26:31+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3329484/will-trump-and-xis-shock-tactics-ruin-any-chances-ending-us-china-trade-war?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "39f0b682d75648f334bfd7762eaf3aa9568dbc0d89bf033f4c0bec4cf0cf5ccf",
        "title": "More than a tech hub, Northern Metropolis can be a cradle for culture",
        "summary": "Hong Kong’s Northern Metropolis is more than a mere zoning plan; it is a crucial part of China’s development strategy and a pivotal step towards elevating the Greater Bay Area’s (GBA) global profile. With development now under way, the conversation must shift to a new realm: soft power.\nThe Northern Metropolis should not be just another new town designed to address Hong Kong’s housing and industrial needs. Rather, it must emerge as a zone of cultural emancipation that takes the GBA’s development...",
        "source": "smcp",
        "date": "2025-10-18T06:30:09+09:00",
        "url": "https://www.scmp.com/opinion/hong-kong-opinion/article/3329196/more-tech-hub-northern-metropolis-can-be-cradle-culture?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a5497e356a90d347c58263a8445e71fcb9992fc04cb0c3a6b42d722892ee6361",
        "title": "US-China tensions ease as Bessent confirms call with counterpart He Lifeng",
        "summary": "US Treasury Secretary Scott Bessent confirmed plans to speak with Chinese Vice-Premier He Lifeng on Friday in a further sign of easing tensions ahead of a potential meeting between the two countries’ leaders.\n“The vice-premier, who is my counterpart, and I will be speaking this evening at around 8.30, 9 o’clock,” Bessent said at the White House on Friday.\nThe Treasury secretary added that He will also join him and a delegation in Malaysia “probably a week from tomorrow” to prepare for a meeting...",
        "source": "smcp",
        "date": "2025-10-18T05:52:36+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3329483/us-china-tensions-ease-bessent-confirms-call-counterpart-he-lifeng?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5798c2a7726cacd8532ccb302f812939d17a84855c2f474ee1002ff0cd8eb54f",
        "title": "US lawmakers urge Trump to attend key Indo-Pacific summits",
        "summary": "A bipartisan group of US lawmakers has urged US President Donald Trump to personally attend three major Indo-Pacific summits this fall, warning that his absence could hand China a strategic advantage as Beijing aggressively expands its influence across the region.\nIn a letter released on Friday, members of Congress stressed that the Indo-Pacific region remains “vital to America’s security and prosperity”, and is at the centre of “strategic competition” with China.\nThey called Trump’s...",
        "source": "smcp",
        "date": "2025-10-18T04:50:48+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3329481/us-lawmakers-urge-trump-attend-key-indo-pacific-summits-and-send-clear-message-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ad6d911bc2bb330fd96a4db766fd250acf31fd7ea25ae56d4571da95c7388ad8",
        "title": "Dutch seized Nexperia over fears Chinese owners planned to move chip production to China",
        "summary": "The Dutch government believed chipmaker Nexperia’s Chinese owners planned to move its manufacturing operations to China, prompting the unprecedented seizure of the company that has sent shock waves through the global tech world.\nEarlier this month, authorities seized control of Nexperia’s management and ousted its Chinese CEO, Zhang Xuezheng, citing national security concerns.\nIn response, China’s Ministry of Commerce on October 4 imposed export controls on Nexperia’s Chinese subsidiary and its...",
        "source": "smcp",
        "date": "2025-10-18T01:32:58+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329476/dutch-seized-nexperia-over-fears-chinese-owners-planned-move-chip-production-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "feba5e0ebb90cb3183b24e6ca73d0f3f1f9b959d8beb4cda96f27e89263c1a53",
        "title": "The Great Mall: how China is turning foreign tourists into shoppers",
        "summary": "Foreign tourists in China are increasingly drawn to shopping, said Steven Zhao, CEO of China Highlights, a travel agency that organises tours of the country.\n“They’ll buy drones and take them back home,” he said, noting the trend has become “more obvious” over the past two years – especially among Middle Eastern travellers – as China produces an outsized share of the global total, with some devices small enough to fit in the hand.\n“Drone prices are cheap and the choices are numerous,” he said,...",
        "source": "smcp",
        "date": "2025-10-17T23:30:08+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3329459/great-mall-how-china-turning-foreign-tourists-shoppers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "95f25eaedeb0eae5237f18b92307db403578f9d317c01a615772197c8696872e",
        "title": "China’s Z-20T assault helicopter thrills public in rare military show demo",
        "summary": "In a rare public display, China has showcased the advanced capabilities of the cutting-edge Z-20T assault helicopter at a military exhibition in Tianjin this week, demonstrating precision manoeuvres by the all-weather aircraft.\nThe helicopters performed a hover salute, a backward ascent and a vertical climb and also fired jamming flares at the 7th China Helicopter Exposition, which wraps up on Sunday.\nThe last time the Z-20T was seen in public was on September 3, when seven of the aircraft flew...",
        "source": "smcp",
        "date": "2025-10-17T23:00:13+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3329464/stronger-wings-chinas-z-20t-assault-helicopter-thrills-rare-military-show-demo?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1abc7dfde9e87e8e25521078847042e990b7ca5b1b9153ca8c80a8ca33c96ccb",
        "title": "Sinking Shanghai, iPhone Air sells out in China: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Double whammy: Shanghai is sinking while sea level rises fast\nShanghai is sinking while the sea level along China’s coastline is rising fast – its fastest in 4,000 years – possibly threatening China’s financial hub and the global supply chain, scientists warn in a new study.\n2. Ships divert, directors resign as US-China port fees rock shipping...",
        "source": "smcp",
        "date": "2025-10-17T22:15:08+09:00",
        "url": "https://www.scmp.com/news/china/article/3329447/sinking-shanghai-iphone-air-sells-china-top-scientist-quits-us-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "41c5fb338b0e0e5228a15499be7998667ad84d51e47b8ff913920df69c7410df",
        "title": "Trump confirms Xi meeting, retreats on 100% tariffs: ‘not sustainable’",
        "summary": "In a turnaround from the tough stance he took a week ago, US President Donald Trump said Friday that he planned to meet with Chinese President Xi Jinping in South Korea in two weeks and suggested that imposing an additional 100 per cent tariff on all Chinese goods appeared unworkable.\nBut he also blamed China for the latest stand-off in trade talks.\nThe mercurial president called into question his planned sit-down with Xi seven days ago and threatened the draconian tariff increase in addition to...",
        "source": "smcp",
        "date": "2025-10-17T22:15:07+09:00",
        "url": "https://www.scmp.com/news/world/united-states-canada/article/3329466/trump-confirms-xi-jinping-meeting-calls-100-china-tariffs-not-sustainable?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bba45f5f570e53c61083747c809a2f786bbddc9065e66fa2999fde6ca4f07181",
        "title": "Can US and China avoid ‘dangerous levels of tension’?",
        "summary": "The United States could help stabilise relations with Beijing by scaling back its military activities in the South China Sea and restraining Taiwan, a think tank has suggested.\nResearchers from the Rand Corporation argued that stabilising the ongoing US-China rivalry was “not only possible but can serve the interests of both sides”.\nAlthough they said that the two countries were “very far from even conceptualising how their rivalry could end or be transcended”, they emphasised the need to look...",
        "source": "smcp",
        "date": "2025-10-17T22:00:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329458/can-us-and-beijing-avoid-dangerous-levels-tension-over-taiwan-and-south-china-sea?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "405d92c056703000025a183de465490ac6a49c54e895ec7fc2ee9ebf1fa2236d",
        "title": "China hails ex-Japanese PM Murayama who stated ‘deep remorse’ over WWII",
        "summary": "China has offered its condolences on the passing of Tomiichi Murayama, a former Japanese prime minister who gave a landmark statement expressing “deep remorse” at the 50th anniversary of the end of World War II.\nMurayama, who led Japan from June 1994 to January 1996, died on Friday at the age of 101.\nChinese foreign ministry spokesman Lin Jian on Friday conveyed “deep condolences” and “sincere sympathies” to Murayama’s family.\n“Mr Murayama was China’s old friend,” Lin said. “He will always be...",
        "source": "smcp",
        "date": "2025-10-17T21:49:31+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329460/china-hails-ex-japanese-pm-tomiichi-murayama-who-stated-deep-remorse-over-wwii?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8b2dfd5a6c2e54af1a2aff7dfd8d75e97724fd8188376b1dfcbfdfc9d7bfd831",
        "title": "US threats to decouple from China only expose its own vulnerability",
        "summary": "Talk about the pot calling the kettle black. After Beijing announced sweeping export controls last week on rare earths and other critical minerals, US Treasury Secretary Scott Bessent went ballistic.\n“Maybe there is some Leninist business model where hurting your customers is a good idea, but they are the largest supplier to the world,” he said.\nSomeone from Beijing might have retorted that Washington has been running on some fascist business model whereby it is upending the entire global trade...",
        "source": "smcp",
        "date": "2025-10-17T21:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3329222/us-threats-decouple-china-only-expose-its-own-vulnerability?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0aa647b8ccf5470bba19f2aef187fbb16ec99d813d8191cbb79f759b548a1a2b",
        "title": "Alibaba confident AI tools will drive sales and empower Singles’ Day shoppers",
        "summary": "Alibaba Group Holding is making tangible progress in applying artificial intelligence models into the search and recommendation engines of its e-commerce ecosystem, according to a senior executive, as the company kicked off its annual Singles’ Day promotion this week.\nAt the campaign’s launch in Shanghai on Thursday, Alibaba vice-president Zhang Kaifu, who also serves as head of applications for the company’s e-commerce businesses, said the firm’s use of Qwen’s large language models (LLMs) had...",
        "source": "smcp",
        "date": "2025-10-17T21:00:19+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3329446/alibaba-confident-ai-tools-will-drive-sales-and-empower-singles-day-shoppers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3ca463310f638489d9bcba24adc3dc4a1a4adb805f16d6a6841ef2efb9ead3ba",
        "title": "China’s rare earth export controls have gone global. Can it enforce them?",
        "summary": "As more countries begin formulating contingency plans for their stocks of rare earth elements, analysts said China’s tightening control over its near-monopoly status in the supply and refining capacity of the minerals – an action taken as part of Beijing’s broader trade conflict with the US – could face challenges in enforcement.\nLast week, China announced a sweeping expansion of its export control regime as it relates to rare earth elements – raw materials that are crucial components in the...",
        "source": "smcp",
        "date": "2025-10-17T21:00:13+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3329439/chinas-rare-earth-export-controls-have-gone-global-can-it-enforce-them?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "524073c73b30f60453bf3a15ea476aca60092971259cac99efb8b57d4e663547",
        "title": "Chinese team aims to test powerful chip on world’s largest optical telescope",
        "summary": "Chinese researchers have developed an optical chip the size of a fingernail that can analyse light in real time with a precision once possible only with bulky laboratory instruments. They hope to test it using the largest optical telescope on Earth.\nThe breakthrough could enable an unprecedented level of visual intelligence in machines ranging from drones and robots to medical scanners and telescopes, according to Fang Lu and her team at Tsinghua University.\nIn a paper published this week by the...",
        "source": "smcp",
        "date": "2025-10-17T21:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329364/chinese-team-plans-test-powerful-chip-worlds-largest-optical-telescope-spain?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5fb4870667abc24dcd3964ff7f3d5767271cadb50ee23099dbfa3b77fbe2174a",
        "title": "Western framework ‘cannot explain’ China, academics say in call for context",
        "summary": "Western theoretical frameworks are often ill-suited for China studies, according to Chinese academics who called instead for research that was grounded in the country’s specific context.\nThe case for a tailored approach, bolstered by field research to correct biases and enable deeper understanding, was made at this week’s World Conference on China Studies in Shanghai, attended by hundreds of Chinese and foreign academics.\nAmid an intense war of narratives with the United States, China has been...",
        "source": "smcp",
        "date": "2025-10-17T20:42:35+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329347/western-framework-cannot-explain-china-academics-say-call-context?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "689d64710c5a439631f44bcb81701e206525115d470e9947d58dc2faddd30600",
        "title": "China ‘showed integrated combat capabilities in locking on US fifth-gen jets’",
        "summary": "A Chinese J-16 fighter that locked onto two foreign warplanes – believed to be American F-22s – before escorting them out of the country’s air defence identification zone highlighted the People’s Liberation Army’s “integrated combat capabilities”, military analysts have said.\nThe incident came to light in a report aired by state broadcaster CCTV earlier this month. It said that the fighter had expelled two foreign aircraft last year and they had not been seen in the area since then.\nYue Gang, a...",
        "source": "smcp",
        "date": "2025-10-17T19:00:19+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3329375/china-showed-integrated-combat-capabilities-locking-us-fifth-generation-jets?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "948145514dbbc0256ae2ab7e3ad5a5531c7285573c360ed7bd77d5aa88cb0754",
        "title": "China expels He Weidong, Miao Hua and 7 other generals from party and military",
        "summary": "China’s second-ranked military general has become the latest PLA top brass to fall from grace, with the defence ministry announcing that he was under investigation and had been dismissed from service and the party.\nHe Weidong, vice-chairman of the Central Military Commission (CMC) and a member of the 24-man Politburo, was expelled from the Communist Party and the armed forces, China’s Ministry of National Defence announced on Friday.\nThe CMC, chaired by President Xi Jinping, sits at the apex of...",
        "source": "smcp",
        "date": "2025-10-17T18:37:41+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3329429/chinas-no-2-general-he-weidong-expelled-communist-party?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3b9d7c9982a2791e9457d3d4cd7e7daedcbd851b9f4867ec0a2d0003b208744b",
        "title": "China begins drills near Scarborough Shoal as US-Philippine naval exercises end",
        "summary": "Tensions in the South China Sea remained high on Friday as China launched military exercises near the disputed Scarborough Shoal, a move coinciding with the final day of a series of joint naval drills between the United States, the Philippines and other nations.\nThe exercise – set to run from noon until 7pm – took place in a limited area in the waters southwest of the disputed shoal – known in China as Huangyan Island. The triangle-shaped formation of reefs and rocks controlled by Beijing and...",
        "source": "smcp",
        "date": "2025-10-17T17:15:28+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3329400/china-begins-drills-near-scarborough-shoal-final-day-us-philippine-naval-exercises?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "884db7719fa2889c15d2041f8bb30286c22ad6a64394ff37daed05ae79f1081b",
        "title": "Micron to cease server memory chips business in China after ban, sources say",
        "summary": "Micron Technology plans to stop supplying server memory chips to data centres in China after the business failed to recover from a 2023 government ban on its products in critical Chinese infrastructure, according to two people briefed on the decision.\nMicron was the first US chipmaker to be targeted by Beijing – a move that was seen as retaliatory for a series of curbs by Washington aimed at impeding tech progress by China’s semiconductor industry.\nSince then, both Nvidia and Intel have...",
        "source": "smcp",
        "date": "2025-10-17T16:01:21+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3329379/micron-cease-supply-server-memory-chips-data-centres-china-after-ban-sources?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5b67b7307d2658823a30089cc97b4adc037aeae0c009aba0e46216df2387a4fc",
        "title": "Indonesia’s bid to ship durians straight to China rides on refrigeration, sanitation",
        "summary": "Indonesia’s intent to export durians directly to China in search of higher profits will hinge on mastering the sanitary standards and cold-chain storage that intermediary countries have provided to date, analysts said.\nSudaryono, deputy agriculture minister of the Southeast Asian archipelago, has announced that Indonesia is “actively seeking opportunities” to export directly to China as a way of increasing profits from an average of 10 to 30 per cent, the national news agency Antara reported...",
        "source": "smcp",
        "date": "2025-10-17T16:00:11+09:00",
        "url": "https://www.scmp.com/news/china/article/3328793/indonesias-bid-ship-durians-straight-china-rides-refrigeration-sanitation?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "11f5410a43fcd509b26ac0cf78808555f29976d830ab409344e01eccf7c804a3",
        "title": "China’s double threat: Shanghai sinks as sea level rises fastest in 4,000 years",
        "summary": "Shanghai is sinking while the world’s sea levels are rising fast – the fastest in 4,000 years – possibly threatening the Chinese financial hub and the global supply chain, scientists warn in a new study.\nChina faces a double threat from rising seas, according to the multinational team, as many of its largest and most economically important cities are concentrated in delta regions – flat lands close to water that were ideal for urban development but remain extremely vulnerable to...",
        "source": "smcp",
        "date": "2025-10-17T15:49:34+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329369/double-whammy-shanghai-sinking-while-sea-level-rises-fast?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "67ead9950b9f3ba7c76adc55ccf0be24fbdfe1840af0efe0ab8907740ad41d89",
        "title": "Turbulent Japanese politics could slow progress with China, South Korea: analysts",
        "summary": "Japan’s unstable political landscape is expected to cast doubt over its diplomatic commitments and could hinder progress in its trilateral summit with China and South Korea, analysts have observed.\nUncertainties are mounting as the path to the Japanese premiership for recently elected Liberal Democratic Party leader Sanae Takaichi has been complicated by the abrupt exit of the LDP’s junior coalition partner, Komeito.\nTakaichi, aiming to be Japan’s first female prime minister, remains short of...",
        "source": "smcp",
        "date": "2025-10-17T14:00:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329281/turbulent-japanese-politics-could-stall-progress-china-and-south-korea-analysts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5a0c3225619d518720df084517611a74171950f1cd972988bb4dc4391aa4008e",
        "title": "Apple’s iPhone Air sells out in China after CEO Tim Cook’s visit",
        "summary": "Apple’s iPhone Air sold out within minutes of its launch in China on Friday, underscoring the device’s popularity among Chinese consumers despite competition from Android devices.\nThe strong sales followed CEO Tim Cook’s visit this week to promote the product in the world’s largest smartphone market amid ongoing geopolitical tensions between China and the US. As chairman of an advisory body at Tsinghua University’s management school, Cook also met Vice-Premier He Lifeng on Thursday.\nPre-sales...",
        "source": "smcp",
        "date": "2025-10-17T13:00:09+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3329336/apples-iphone-air-sells-out-minutes-china-after-ceo-tim-cooks-visit?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4d0290d7c4b3b88268dc02821b3d9c7bb6bf7916164f6f478cfe72a00086a9c8",
        "title": "Top scientist Hu Ye quits US for China after giving up millions in funding",
        "summary": "A top biomedical scientist has left the United States for China after giving up millions of dollars in research funding from the National Institutes of Health (NIH).\nAfter studying and working in the US for 22 years, Hu “Tony” Ye, who held the prestigious chair professor position at Tulane University in New Orleans, left to take on the role of founding dean at the new school of biomedical engineering at his alma mater, Tsinghua University.\nHu has long focused on the rapid detection of viruses,...",
        "source": "smcp",
        "date": "2025-10-17T10:00:13+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329273/top-biomedical-scientist-hu-ye-quits-us-china-after-cuts-us8-million-grants?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6736406f5136ca982875f6ab8b3366336385e99bdb1004e3a4d61909a189cfd1",
        "title": "China’s property market poised to decline at least through 2026: S&P analyst",
        "summary": "China’s vast property market is expected to continue to decline at least through the next year, according to S&amp;P Global Ratings.\n“We estimate nationwide primary property sales will fall 8 per cent in 2025 and between 6 to 7 per cent in 2026, as overall demand remains soft,” said Edward Chan, director at S&amp;P Global Ratings, at a webinar on Thursday.\nThis will continue to put pressure on Chinese developers, many of which are going through the challenge of delivering homes, while maintaining their...",
        "source": "smcp",
        "date": "2025-10-17T08:30:09+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3329283/chinas-property-market-poised-decline-least-through-2026-sp-analyst-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "21ea35a772d6fb1acbcf5ec1b9fddb0fca6d2edf84a961c8ba65e91d75440d73",
        "title": "Race for the stars: will China be first to deliver fusion energy by 2035?",
        "summary": "At a laboratory in northern China, less than an hour away from Beijing, a team of scientists is working on a new technology with huge potential as a clean energy source: nuclear fusion.\nThe spacious ENN Group campus in Langfang, Hebei province, is home to a cluster of experimental facilities. At its heart is a spherical device called the EXL-50U – a compact tokamak that uses a magnetic field to confine charged gas, or plasma, to fuse hydrogen nuclei.\nOn the day the South China Morning Post...",
        "source": "smcp",
        "date": "2025-10-17T07:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329303/nuclear-fusion-could-china-be-first-harness-energy-powers-sun?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "08691943d3da90f1ebf1fc3005eea50a685811963f181ada694974c8d72b482c",
        "title": "Carney walks fine line between Washington, Beijing as Ottawa weighs EV tariffs",
        "summary": "Canadian Prime Minister Mark Carney on Thursday said he expects to meet senior Chinese leaders in the “coming month or so” as part of a broad re-engagement with Beijing, but declined to say whether Ottawa will lift tariffs on Chinese electric vehicles.\n“We are in the process of having those discussions on a much broader range of issues than single sectors and single trades,” Carney said at a press conference.\n“And when we look at the auto sector, we take into account the dynamics with the United...",
        "source": "smcp",
        "date": "2025-10-17T06:04:51+09:00",
        "url": "https://www.scmp.com/news/china/article/3329307/carney-walks-fine-line-between-washington-and-beijing-ottawa-weighs-removing-ev-tariffs?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2c8d5977c10596b72aa9dc106edba39faff977a40ac6aa27acfcd3c0f93e0842",
        "title": "Brussels and Beijing lawmakers spar over Russia, Taiwan in first talks since 2018",
        "summary": "Lawmakers from Brussels and Beijing clashed on Russia and Taiwan, during their first official talks for seven years in the Belgian capital on Thursday.\nEU lawmakers and other people present said delegates from the National People’s Congress (NPC) echoed Russian narratives on the cause of the three-year war in Ukraine, as they visited the European Parliament for the first dialogue since 2018, following a normalisation of ties earlier this year.\n“The Chinese side questioned Nato’s right to exist....",
        "source": "smcp",
        "date": "2025-10-17T00:38:23+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329301/eu-and-china-lawmakers-spar-over-russia-taiwan-first-talks-2018?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a792dbb33514eb0374e24ce134f83e433155bed4609ab1b42f00552a821cc427",
        "title": "The fast and the amphibious: China electric SUV conquers Yangtze",
        "summary": "A Chinese car maker has achieved an unprecedented automotive feat by crossing the mighty Yangtze River with a turbo-powered sports utility vehicle.\nThe engineering achievement by Chery’s powerful Jetour G700 SUV was intended as more than a marketing stunt; it showcased the increasing technical ambitions of China’s auto industry and its commitment to advancing vehicle capabilities well beyond conventional limits.\nThe powerful electric Jetour G700 SUV set off on Thursday morning from the...",
        "source": "smcp",
        "date": "2025-10-17T00:05:11+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329278/fast-and-amphibious-china-electric-suv-conquers-yangtze-cutting-edge-tech?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ffae0e8d434707059d776489b15237e0ebc2cceeb88f855092abfc3006138517",
        "title": "The squeeze is on: Beijing and Washington flex muscles as narrative war heats up",
        "summary": "As China and the United States accuse each other of provoking the latest escalation in trade tensions and disrupting the world economy, analysts say both share a goal in their war of words: applying maximum pressure until a deal is struck.\nIn the past few days, Washington has framed the recent flare-up in relations as “China versus the world”, with US Treasury Secretary Scott Bessent suggesting on Wednesday that Beijing’s restrictions on the export of rare earth elements unveiled last week made...",
        "source": "smcp",
        "date": "2025-10-17T00:00:10+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3329260/squeeze-beijing-and-washington-flex-muscles-narrative-war-heats?utm_source=rss_feed",
        "reportUrl": ""
    }
]