[
    {
        "id": "412c241d37659f1d9b7d9d198d4b6771b467a0aa5c3fbcaf1f473d1fb526846f",
        "title": "Hong Kong follows US in quarter-point rate cut to lower lending cost",
        "summary": "Hong Kong’s de facto central bank cut the base interest rate for the second time in six weeks, further reducing the cost of funding to help reboot the city’s businesses and reduce the burden on mortgage borrowers.\nThe Hong Kong Monetary Authority (HKMA) cut the base rate by a quarter point to 4.25 per cent on Thursday, hours after the US Federal Reserve pared its target rate by the same margin to a range of 3.75 per cent to 4 per cent during the seventh meeting of the Federal Open Market...",
        "source": "smcp",
        "date": "2025-10-30T08:00:44+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3330832/hong-kong-follows-us-quarter-point-interest-rate-cut-reduce-loans-cost-borrowers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "58f7615004eb95f0404658f5652ae2ec9c2c46a312a65349e61a1feaf42ca46f",
        "title": "Democrats urge Trump not to ease national security restrictions for a trade deal",
        "summary": "Democrats in the US House of Representatives and Senate are urging President Donald Trump not to ease national security restrictions on China for a trade deal, hours ahead of his expected meeting with Chinese President Xi Jinping.\n“America’s export controls, investment safeguards, and our long-standing security partnerships must not be on the negotiating table,” a group of 12 senators led by Chuck Schumer, the chamber’s top Democrat, wrote in a letter to the Republican president on...",
        "source": "smcp",
        "date": "2025-10-30T07:58:46+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3330831/democrats-urge-trump-not-ease-national-security-restrictions-negotiations-xi?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3fdd64bf6981b2fb20841e50c3f43307233eb1f13b7d5c52a4c6f64dc5b813ec",
        "title": "‘Unforgivable’: Chinese county still living in shadow of wild spending binge",
        "summary": "Few areas of China reflect the country’s decades-long economic transformation more vividly than its cities. Rapid development has turned villages into dense urban landscapes and already sizeable metro areas into some of the world’s largest population centres. As the rate of urbanisation slows and the country transitions into a new economic era, we explore how select Chinese cities are navigating the change. Read the rest of our series here.\nIn a remote corner of China’s southwestern Guizhou...",
        "source": "smcp",
        "date": "2025-10-30T07:00:11+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330729/unforgivable-chinese-county-still-living-shadow-wild-spending-binge?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b3eec0da7d32d1d63b5a2037d82275e6b8c66ad433680b49a241f9a91e842816",
        "title": "China’s next power move is as much in the fields as in factories",
        "summary": "At last week’s fourth plenary session of the Central Committee of China’s Communist Party in Beijing, food emerged as a clear policy priority. The plenum’s communique highlighted the goal of accelerating China’s transformation into an agricultural power.\nA leading agricultural producer and importer and a significant exporter, China is doubling down on its next agricultural milestone ahead of the official approval of the 15th five-year plan (2026-2030) early next year.\nWhile detailed...",
        "source": "smcp",
        "date": "2025-10-30T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3330665/chinas-next-power-move-much-fields-factories?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "385e4a7a5b6471d5493f703e91db4fe04b0f3dc32beb824f35f928d683a18536",
        "title": "Why Trump must do more if Washington is to win US-China tech race",
        "summary": "US President Donald Trump’s administration needs to reverse the destructive policies undercutting America’s ability to compete with China in strategic hi-tech sectors or see Beijing race ahead, a leading member of the hardline US House Select Committee on China said on Wednesday.\nChina’s commitment to the progress of tech innovation has caused unease in the United States, with Beijing’s continued investment in the industry standing in sharp contrast to the US government’s current shutdown and...",
        "source": "smcp",
        "date": "2025-10-30T05:32:13+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3330828/trump-must-do-more-win-us-china-tech-race-says-us-house-select-committee-member?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1c7a063ca936b4dac25fb6c36ca6121f1fef85baea58d7b7274fbafd51ddae88",
        "title": "‘Positive step’: cautious relief as China resumes US soybean purchases",
        "summary": "American soybean farmers got some rare good news on Wednesday just hours before a high-stakes meeting between Chinese President Xi Jinping and US President Donald Trump when news broke that Beijing had placed its first order after months of trade tension that saw shipments blocked.\nThe Trump administration hailed the move as a “positive step forward” for farmers, touting the “America first” leader’s deal-making prowess.\n“Today’s purchase by China of multiple ships of American soybeans signals...",
        "source": "smcp",
        "date": "2025-10-30T02:15:56+09:00",
        "url": "https://www.scmp.com/news/china/article/3330823/relief-and-caution-china-resumes-us-soybean-purchases?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2d75dd8ba83119fc86ae66e61d7008b2b5d0b2c99e3a7095f5f5fa1df5bd371f",
        "title": "German vice-chancellor to lead Social Democrat-Beijing talks as ties fray",
        "summary": "German Vice-Chancellor Lars Klingbeil is set to chair talks between his Social Democrat Party (SPD) and China’s Communist Party in Beijing next month, even after Foreign Minister Johann Wadephul was forced to postpone a trip to China after being unable to arrange enough meetings.\nThe SPD and Communist Party meeting will take place in Beijing from November 17 to 19, several sources confirmed, as the two parties continue a long-standing tradition of dialogue.\nKlingbeil is the leader of the SPD,...",
        "source": "smcp",
        "date": "2025-10-30T02:12:44+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330822/germanys-vice-chancellor-lead-social-democrat-communist-party-talks-ties-fray?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "919835e96d25169c3c4b7fdc0026c0d88a865f9363bd5365e0415a01fb87764e",
        "title": "American lawmakers told US must learn from China to revive shipbuilding",
        "summary": "If the US hopes to rebuild a competitive shipbuilding industry and narrow China’s commanding lead, it should adopt some lessons from Beijing – emphasising long-term planning, steady government funding and policy consistency, witnesses told a US Senate hearing this week.\nChina’s phenomenal rise in the global shipbuilding sector has caught the attention of Washington’s policymakers who are keen to restore the nation’s commercial fleet and production capacity, leading many to blame China for...",
        "source": "smcp",
        "date": "2025-10-30T01:09:27+09:00",
        "url": "https://www.scmp.com/news/china/article/3330819/american-lawmakers-told-us-must-learn-china-revive-shipbuilding?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b875b40344c15d34a99cef01756471c1d45115ea6386113675bf548a16df0dac",
        "title": "China’s next 5-year plan aims to narrow nuclear gap with US and Russia: analysts",
        "summary": "China is expected to expand and modernise its nuclear arsenal to narrow the gap with the US and Russia following Beijing’s fresh pledge to strengthen its “strategic deterrence” to safeguard the global balance, according to analysts.\nThe pledge was part of the proposed 15th five-year plan which was endorsed last week by the Communist Party’s Central Committee and will cover the years 2026-2030.\nDetails of the proposal were released on Tuesday, including a pledge to “strengthen strategic...",
        "source": "smcp",
        "date": "2025-10-30T00:00:19+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3330774/chinas-next-5-year-plan-aims-narrow-nuclear-gap-us-and-russia-analysts-say?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d65be83aa0e035aecddb957e45eb9b13200187d901a56dc4caabaa52be819e8f",
        "title": "What pain points are likely to be on the table at Xi-Trump meeting?",
        "summary": "All eyes are now on Thursday’s meeting between President Xi Jinping and US President Donald Trump in South Korea.\nTheir first in-person encounter since Trump’s return to office in January will build on several rounds of trade talks between the two sides that have touched on issues ranging from tariffs to export controls.\nIn this explainer, the Post outlines the key pain points between the world’s two largest economies – and whether they are likely to be addressed.\nWhat issues may be agreed on by...",
        "source": "smcp",
        "date": "2025-10-29T22:30:15+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330739/what-pain-points-are-likely-be-table-xi-trump-meeting-south-korea?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "50db192a8a44c57eb2dbe6f502a19a42f2d0fb676e6929139bed91996b262e17",
        "title": "Xi-Trump’s upcoming meeting, China’s hi-tech talent plan: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Why Trump’s unpredictability and inconsistency could hamper meeting with Xi\nAs US President Donald Trump and Chinese President Xi Jinping attempt to stabilise US-China trade relations on Thursday, a major problem unlikely to go away, no matter what the outcome, is the disjointed signalling and mixed messaging coming out of Washington, undercutting trust and...",
        "source": "smcp",
        "date": "2025-10-29T22:15:11+09:00",
        "url": "https://www.scmp.com/news/china/article/3330796/xi-trump-upcoming-meeting-chinas-plan-lure-hi-tech-talent-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "29bd8d5e9dcb86d3f3786a5d45bce3dc87ad2eb6a740d391aa52f16c0ef1b16f",
        "title": "China’s 5-year plan charts rise to global sea power while countering US",
        "summary": "China’s ambitious five-year strategic blueprint has revealed the country’s plan to become a global sea power, with pledges to secure its maritime periphery while countering American sanctions and other perceived external security threats.\nThe aspirations were outlined in a broad policy document for the country’s 15th five-year plan adopted at the Communist Party’s fourth plenum in Beijing last week and released by state news agency Xinhua on Tuesday.\nWhile stressing “Chinese-style modernisation”...",
        "source": "smcp",
        "date": "2025-10-29T22:00:29+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330802/china-eyes-rise-global-sea-power-while-countering-us-five-year-plan-shows?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9e6ee229b068026e60b9c2324a3b757176ea10899dccd9e73d3c8b857899e8cb",
        "title": "Solana event cut short as China’s stablecoin warning sparks unease",
        "summary": "A Solana-themed event in southern China that was cut short after a local policy inquiry has raised concerns in the country’s cryptocurrency community amid new warnings from Beijing about stablecoin risks, despite organisers attributing the disruption to overcapacity.\nThe Solana blockchain’s Chinese community said on its official social media account that the Solana Accelerate APAC event in Shenzhen, held on Tuesday afternoon, was “exceptionally popular” and attendance far exceeded...",
        "source": "smcp",
        "date": "2025-10-29T22:00:16+09:00",
        "url": "https://www.scmp.com/tech/blockchain/article/3330759/solana-event-china-cut-short-beijings-stablecoin-warning-sparks-unease?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4a2eb14beaf5de2c891e175aa6409140ac5ccd49c52858d96627f39f9b8881fb",
        "title": "Only a multipolar coalition can secure Ukraine peace",
        "summary": "The now-delayed meeting between US President Donald Trump and his Russian counterpart Vladimir Putin in Budapest, Hungary, could have been a turning point towards peace in Ukraine. Instead, it has revealed a deeper fault line.\nHowever, it is one that can be overcome. Even the Kremlin’s special envoy for investment and economic cooperation, Kirill Dmitriev, believes that the parties are close to an end to the war.\nThe global community should offer an off-ramp and seek a middle ground amenable to...",
        "source": "smcp",
        "date": "2025-10-29T21:30:13+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3330630/only-multipolar-coalition-can-secure-ukraine-peace?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cebe0039757acbb011f0b5e632baaf6b20c84ee208aded6a06c4e75f630a807a",
        "title": "China pledges ‘immigration system for hi-tech talent’ under new 5-year plan",
        "summary": "China’s top leadership has pledged to build an immigration system to lure foreign talent in a move that may help increase its competitiveness amid the ongoing technological competition with the United States.\nIn the blueprint for the five-year plan that starts next year, Beijing said it would “establish an immigration system for hi-tech talent”, and “attract and cultivate outstanding talent from around the world”.\nThe plans, released on Tuesday following a major policy meeting of the Communist...",
        "source": "smcp",
        "date": "2025-10-29T20:00:32+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330788/china-pledges-immigration-system-hi-tech-talent-part-new-5-year-plan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9a069b3f1ff4519f3cec9d0bbf96b4f10dbcc9db847f13ec86ff2e7c80ea928f",
        "title": "Rare earth diplomacy: how Trump’s Asia tour aims to lock in mineral supplies",
        "summary": "US President Donald Trump has signed a series of critical mineral agreements during his visit to Asia, in a bid to secure rare earth supplies and reduce dependence on China.\nHere, the Post examines how these deals differ in scale, scope and potential impact.\nWhat does the US-Japan framework cover?\nOn Tuesday, the two countries signed an agreement to “support the supply of raw and processed critical minerals and rare earths crucial to the domestic industries of the United States and Japan”.\nWhile...",
        "source": "smcp",
        "date": "2025-10-29T20:00:24+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3330773/rare-earth-diplomacy-how-trump-using-his-asia-tour-secure-critical-mineral-supplies?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "baf952146099966f3c3e0c4f74c826f0ec97ed3e40796ea7cc16e0b866fcdc35",
        "title": "Nvidia China hopes rekindled as Trump flags Blackwell chip talks with Xi",
        "summary": "Nvidia founder and CEO Jensen Huang said he remained hopeful of returning to the China market, as US President Donald Trump signalled that the company’s state-of-the-art Blackwell artificial intelligence chips could feature in his coming talks with Chinese President Xi Jinping.\nSpeaking on the sidelines of Nvidia’s flagship GTC (GPU Technology Conference) in Washington on Tuesday, Huang said he had “100 per cent confidence in President Trump’s ability to cut a great deal for America”.\nHe noted...",
        "source": "smcp",
        "date": "2025-10-29T19:56:07+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3330792/nvidia-ceo-pins-hopes-china-comeback-trump-raises-blackwell-chip-talks-xi?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bf1a863d5ee2da372a12512755e212c7420b2804c4acc36ced6346c9b75cee83",
        "title": "Beijing played up its H-6K bombers in a drill near Taiwan. Who was it for?",
        "summary": "Beijing has staged a rare high-profile display of its bombers during drills near Taiwan – a clear signal to potential external parties – ahead of an expected summit between President Xi Jinping and US President Donald Trump in South Korea this week.\nSeveral H-6K bombers – one of the most advanced variants of the People’s Liberation Army’s H-6 family – recently carried out simulated confrontation drills over air and sea areas surrounding Taiwan, according to a programme broadcast by state-run...",
        "source": "smcp",
        "date": "2025-10-29T19:00:14+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3330748/beijing-played-its-h-6k-bombers-drill-near-taiwan-who-was-it?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b7f5b7e246ced9a9a8adea645bb9362d1b9ee44817f79803d819f0538258c02c",
        "title": "As US oil sanctions bite, can Russia still rely on China?",
        "summary": "Using Richard Nixon’s “madman theory” of international relations, it appears that US President Donald Trump aims to pressure Russia and China into making significant concessions. His decision to impose sanctions on Russia’s oil giants, Rosneft and Lukoil, could not only impact the Russian economy but also the Kremlin’s energy cooperation with Beijing.\nBefore Russia’s invasion of Ukraine in 2022, Europe imported substantial amounts of Russian crude. While China has been the top individual...",
        "source": "smcp",
        "date": "2025-10-29T17:30:08+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3330705/how-china-could-make-or-break-us-sanctions-russian-oil?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d410e1e43759f170907af81a21a1de15abaaeb544070176b9709ded7901bbf96",
        "title": "Why Xi and Trump are set to talk in Busan, away from South Korea’s Apec events",
        "summary": "Highly anticipated talks between Xi Jinping and Donald Trump on the sidelines of the Apec summit are set for Thursday in Busan, South Korea – some 85km (53 miles) from the forum’s main events in Gyeongju – and security considerations could explain why as the two seek to make headway on issues that have strained ties.\nOn Wednesday, the Chinese foreign ministry announced that Xi and Trump would meet in Busan to “exchange views on bilateral relations and issues of mutual interest”.\nForeign ministry...",
        "source": "smcp",
        "date": "2025-10-29T17:26:13+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330734/why-xi-and-trump-are-set-talk-busan-away-south-koreas-apec-events?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "73459ec906e6e03509448bb4f009c81b81bb3848d292efe5c77192feb0a03ee5",
        "title": "China’s robot-powered factories turn hi-tech production lines into tourist spots",
        "summary": "Cheers erupted inside Xiaomi’s gleaming electric vehicle factory on the outskirts of Beijing when it recently welcomed its 100,000th visitor of the year – a tourist from Nanjing.\nThe milestone, announced on the company’s Weibo account, came after it opened part of its car production facilities to the public in April 2024 – turning a once-secretive factory floor into one of Beijing’s hottest new attractions. Xiaomi now plans to increase public tours to 111 sessions a month in November, the...",
        "source": "smcp",
        "date": "2025-10-29T17:00:10+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330718/chinas-robot-powered-factories-turn-hi-tech-production-lines-tourist-hotspots?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0b63d2de4d8c130a8897de337d7ab04d970a05e21cc1d60bd10aa3115f34be45",
        "title": "China expels former aerospace boss and military auditor from top legislature",
        "summary": "Beijing expelled a former senior official with an aerospace background and a military auditor from the top national legislature on Tuesday amid its deepening anti-corruption drive.\nThe Standing Committee of the National People’s Congress said on Tuesday that five officials had been removed from their NPC duties.\nThe most senior of them is Xu Dazhe, former Communist Party secretary of Hunan province. The NPC did not say if he was under investigation for corruption but Xu, who left the party...",
        "source": "smcp",
        "date": "2025-10-29T16:06:15+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3330743/china-expels-former-aerospace-boss-and-military-auditor-top-legislature-and-others?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c57a3467db1f5ab0d3f2aa0136ae8df34f402dd5f7af7b7ffc69c3e6a5d30914",
        "title": "‘Progress cannot be stopped’: China’s chief Paris envoy talks trade, EV tariffs",
        "summary": "This month, the Post’s Xiaofei Xu sat down with Deng Li, China’s ambassador to France and Monaco, for an in-depth and wide-ranging interview. In part two, Deng discusses Beijing’s economic relationship with France and the EU. Part one can be found here.\nAs Europe adapts to the changing nature of the global economy and the fast pace of technological innovation, China is ready to help the continent as it determines its role in emerging industries, Beijing’s top diplomat in Paris told the...",
        "source": "smcp",
        "date": "2025-10-29T15:00:09+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3330699/progress-cannot-be-stopped-chinas-ambassador-france-talks-trade-ev-tariffs?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1dd2026535653469708b0774ab00ed8a017a90e3d94f04592c8cc87d36910be7",
        "title": "China dams huge river twice in 1 day to build a pair of mega hydropower stations",
        "summary": "In just one day, China dammed a huge river in two spots to build a mega hydropower project in the southwestern province of Sichuan, according to China Electric Power News under the National Energy Administration.\nThe flow of the Yalong River, a secondary tributary of the Yangtze River, was intercepted as the first step in the construction of two large hydropower projects on Tuesday. They have a combined installed capacity of 2.7 million kilowatts (kW).\nUpon completion, these two hydropower...",
        "source": "smcp",
        "date": "2025-10-29T14:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330670/china-dams-huge-river-twice-1-day-build-pair-mega-hydropower-stations?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "88a2d5bc59fcbd1ef96bcd3bc1f52cce4cc9501e82941ecb9115098e43f9f6c4",
        "title": "‘Back to steam’: Trump wants US to quit electromagnetic catapult race with China",
        "summary": "Soon after China put the electromagnetic catapults on its newest aircraft carrier to the test, US President Donald Trump has taken a swipe at the “stupid electric” technology – and called for a return to steam power.\nThe advanced catapult launch system was originally developed by the United States to boost the performance of its aircraft carriers.\nBut when he addressed US Navy sailors aboard the USS George Washington in Japan on Tuesday, Trump said he was serious about signing an executive order...",
        "source": "smcp",
        "date": "2025-10-29T13:00:13+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330719/back-steam-trump-wants-us-quit-electromagnetic-catapult-race-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8318fd076a18013d6801e1eb4f922e926a333cf986b49ea1ee2b526d38713834",
        "title": "Chinese vice-premier vows further opening up of financial sector",
        "summary": "Vice-Premier He Lifeng has vowed that China will continue to expand the “high-level opening up” of its financial sector and welcome more investment by foreign financial institutions and long-term capital.\n“China will unswervingly expand high-level opening up in the financial sector and accelerate the building of a modern financial powerhouse,” he said in a statement published on Tuesday.\nThe Chinese vice-premier made the comments during a meeting with the National Financial Regulatory...",
        "source": "smcp",
        "date": "2025-10-29T12:04:19+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330712/chinese-vice-premier-vows-further-opening-financial-sector?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "09539c61efab675bdd8e93e9f496240d7b03dd458078a2bdddd007d81cdd46bb",
        "title": "China, South Korean ships in 15-hour Yellow Sea stand-off last month: report",
        "summary": "A report by a Washington-based think tank has revealed a tense 15-hour stand-off last month between China’s coastguard and South Korean vessels in a contested area of the Yellow Sea.\nThe confrontation took place in the disputed Provisional Measures Zone (PMZ) after a South Korean research vessel, the Onnuri, approached facilities that Beijing has claimed are used for aquaculture, according to a report posted on Monday to the website Beyond Parallel, operated under the Centre for Strategic and...",
        "source": "smcp",
        "date": "2025-10-29T11:00:10+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3330644/china-south-korean-vessels-15-hour-yellow-sea-stand-last-month-report-reveals?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b6ecc1c553ab0cb694a9d2328daa2b3609c0949a24d9dbf4c77ee70e11690979",
        "title": "Survey reveals more than half of Americans want to cooperate with China",
        "summary": "More than half of Americans say the United States should cooperate and engage with China, according to a survey released on Tuesday, a sharp increase from the 40 per cent recorded in 2024.\nThe results released by the Chicago Council on Global Affairs also found that a majority of Americans are against higher tariffs on Chinese imports.\n“Americans’ views of China are beginning to improve after several years of sharp declines,” said Craig Kafura, the council’s director of public opinion and US...",
        "source": "smcp",
        "date": "2025-10-29T08:03:36+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3330695/survey-reveals-more-half-americans-want-more-friendly-engagement-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ab1688a17476dfe601bba64f194c29d23e93ffaad88e91fd098de5cda32122ce",
        "title": "Beyond soybeans: another group of Americans pins hopes on Xi-Trump talks",
        "summary": "Hundreds of American families who’ve waited over five years to embrace their adoptive children from China are clinging to hope that a meeting between US President Donald Trump and Chinese President Xi Jinping will finally bring their families together.\nTheir optimism grew after the White House, for the first time, told the Post on Monday that the “America first” president is aware of their plight. This came weeks after US State Department officials suggested they look elsewhere after Beijing...",
        "source": "smcp",
        "date": "2025-10-29T07:07:52+09:00",
        "url": "https://www.scmp.com/news/us/article/3330693/beyond-soybeans-another-group-americans-watching-xi-trump-meeting-hope?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "868a50998fdcf82427b3ab6e0d8f8401df2c45a00df997fe14bca25ea1fc4efe",
        "title": "Why some Chinese cities are rethinking their sweeping development strategies",
        "summary": "Few areas of China reflect the country’s decades-long economic transformation more vividly than its cities. Rapid development has turned villages into dense urban landscapes and already sizeable metro areas into some of the world’s largest population centres. As the rate of urbanisation slows and the country transitions into a new economic era, we explore how select Chinese cities are navigating the change. Read the rest of our series here.\nThere is hardly a city in China like Datong, where...",
        "source": "smcp",
        "date": "2025-10-29T07:00:16+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330638/chinas-urban-revival-and-datong-contradiction-when-planning-double-edged-sword?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fb07b95f6bb2d9fc6df0f33774b0442b8adcfc96aadfcb05335d577e783f1844",
        "title": "US bans new Chinese telecoms gear, citing national security risks",
        "summary": "The administration of US President Donald Trump on Tuesday tightened the rules on the importation, marketing and sales of new Chinese telecoms gear in the United States, a move set to haunt bilateral relations ahead of the summit of the top leaders later this week.\nThe US Federal Communications Commission (FCC) voted to block new approvals for devices with parts from companies on its “Covered List“ and also to allow it to bar previously approved equipment in certain cases.\nIt means that devices...",
        "source": "smcp",
        "date": "2025-10-29T06:47:44+09:00",
        "url": "https://www.scmp.com/news/china/article/3330692/us-bans-new-chinese-telecoms-gear-citing-national-security-risks?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "75ebf3338294e872e1b1fa705b2b26a18b4c880621c44fe3f03d9b27caa98ee7",
        "title": "Why Trump’s unpredictability and inconsistency could hamper meeting with Xi",
        "summary": "As US President Donald Trump and Chinese President Xi Jinping attempt to stabilise US-China trade relations on Thursday, a major problem unlikely to go away, no matter what the outcome, is the disjointed signalling and mixed messaging coming out of Washington, undercutting trust and confidence that any deal will even be implemented, say analysts and former officials.\nWhile governments worldwide face coordination problems, experts say the Trump administration is particularly prone to this. Also...",
        "source": "smcp",
        "date": "2025-10-29T06:43:29+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3330690/will-trumps-love-unpredictability-and-contradictions-hinder-negotiations-xi?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0553acd7b4f928c672d93eae803a7dfed79e21027ef9495e68fec906e04005f9",
        "title": "Could China’s Linglong One reactor be a game-changer for Asia?",
        "summary": "Earlier this month, China National Nuclear Corporation quietly marked a groundbreaking achievement. It announced that Linglong One – which it has billed as the world’s first commercial land-based small modular reactor – had successfully completed its “cold functional test”. This is the first comprehensive assessment of a reactor, done before fuel loading, checking how the system functions under high pressure.\nLinglong One, which has been much cheaper to construct than the larger Hualong One...",
        "source": "smcp",
        "date": "2025-10-29T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/asia-opinion/article/3330563/can-energy-hungry-asia-embrace-nuclear-power?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b6ab658804b6457ee4b2e0132f8710431882fe249494e64e9756348944abecbc",
        "title": "Chinese watching US moved more by policy, events than entrenched ideology: paper",
        "summary": "A new academic study tracking Chinese public opinion before and after the 2020 and 2024 US presidential elections suggests that the perception of the United States is related more to political changes and policy signals than to entrenched anti-American ideology.\nAnd the survey – conducted after Donald Trump won the election in November 2024, but before he returned to the White House for his second presidential term and the subsequent trade war – reveals a pivotal shift in Chinese public...",
        "source": "smcp",
        "date": "2025-10-29T00:00:11+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330617/chinese-watching-washington-moved-more-policy-events-entrenched-ideology-paper?utm_source=rss_feed",
        "reportUrl": ""
    }
]