[
    {
        "id": "49bdb2708c72574f7b3ba2d976617f9d5b7ab2b717b3c76ddd37631fef884c3e",
        "title": "Panchen Lama says reincarnation must follow Chinese laws, be endorsed by Beijing",
        "summary": "Reincarnation must follow Chinese laws and be endorsed by Beijing, Tibetan Buddhist leader Panchen Lama has said in an apparent reference to the succession of the Dalai Lama.\nSpeaking at an official symposium in Shigatse on Monday, the Panchen Lama – the second-highest figure in Tibetan Buddhism after only the Dalai Lama – stated that reincarnated “living Buddhas” must be identified within China and approved by the central government.\nThis must be done “without any interference or control from...",
        "source": "smcp",
        "date": "2025-12-11T10:00:13+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335933/panchen-lama-says-reincarnation-must-follow-chinese-laws-be-endorsed-beijing?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e3f925f68b7efdf1e545e2d20a33a6df884a1cb1ee2c61a16ad769bfcac6d2de",
        "title": "Less hype and more hardware: SenseTime banks on multimodal AI to regain its edge",
        "summary": "Chinese artificial intelligence pioneer SenseTime is betting that its roots in computer vision will help it lead the next phase of AI, as the industry shifts towards multimodal systems and embodied intelligence in the physical world, according to co-founder and chief scientist Lin Dahua.\nIn an interview with the Post on Wednesday, Lin said the company’s long-standing expertise in vision-based AI put it in a strong position to become a leader in embodied intelligence, robotics and AI agents...",
        "source": "smcp",
        "date": "2025-12-11T09:00:17+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3335922/less-hype-and-more-hardware-sensetime-banks-multimodal-ai-regain-its-edge?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e6e3927fba5ba824bee9e18d54ff01002b21ce3f81bddb0707fc9a72d24d51de",
        "title": "US commission wants more Mandarin language courses as Congress looks to curb Beijing sway",
        "summary": "A bipartisan commission focused on the rule of law and human rights in China is recommending that the US Congress scale up immersion programmes for Mandarin and other languages spoken on the mainland in American high schools and universities.\nThe recommendation, made as part of the Congressional-Executive Commission on China’s (CECC) annual report, comes as Washington has scaled back funding for cultural exchange programmes since the start of US President Donald Trump’s second administration.\nIt...",
        "source": "smcp",
        "date": "2025-12-11T07:46:52+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3335974/us-commission-wants-more-mandarin-language-courses-congress-looks-curb-beijing-sway?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0fc428a50e13900b5a37246540632065f831b1e11633d594c0375eb8947bc2c4",
        "title": "First China ore shipment rewards Guinea coup leader’s push for Simandou alliance",
        "summary": "The Simandou mountain range in southeastern Guinea, once a dense forest where exploration teams relied on GPS and helicopters to navigate, has yielded vast reserves of its sought-after high-grade iron ore after decades of delay.\nWorkers struggled to define the layout of the thick forest before clearing the trees and brush at the site set for the Simandou Iron Ore project, “as it was nothing but darkness”, according to Chris Aitchison, the managing director for Rio Tinto’s Simfer joint...",
        "source": "smcp",
        "date": "2025-12-11T07:00:16+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335862/first-china-ore-shipment-rewards-guinea-coup-leaders-push-simandou-alliance?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3cab20eea1ec0098b2a70f6543f520eeef0afa639843516dae0d30855c66c728",
        "title": "US seeks ‘constructive’ reset with China as trade tensions ease: Greer",
        "summary": "The United States is striving for a more “constructive” relationship with China after this year’s trade war and will continue to pursue a “managed” bilateral trade relationship, its chief trade envoy said, despite concerns lingering over China’s grip on critical minerals and pushback over the White House’s recent approval of H200 AI chip sales.\nThe comments by US Trade Representative Jamieson Greer came after Beijing and Washington fought fiercely throughout the year over tariffs.\nThe Chinese...",
        "source": "smcp",
        "date": "2025-12-11T04:51:45+09:00",
        "url": "https://www.scmp.com/news/china/article/3335970/us-seeks-constructive-reset-china-trade-tensions-ease-greer?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "67a0623fef211111bcb9ec5bcd9f9d2203b4e08c0e184e1ea55d66b557b72762",
        "title": "US Fed delivers quarter-point rate cut as policymakers weigh inflation outlook",
        "summary": "The US central bank announced on Wednesday it would slash the benchmark interest rate by a quarter of a percentage point, though this year’s third cut has long been criticised by President Donald Trump as too late and too little.\nThe cut decision made by the Federal Open Market Committee (FOMC), the monetary-policy organ affiliated to the Federal Reserve, was broadly in line with market expectations, but fell short of Trump’s demand of a larger cut. The benchmark interest rate after the...",
        "source": "smcp",
        "date": "2025-12-11T04:09:51+09:00",
        "url": "https://www.scmp.com/news/us/economy-trade-business/article/3335968/us-fed-delivers-quarter-point-rate-cut-trump-renews-pressure-central-bank?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "21698b841d3d0c37715e35c5dfd577afa059e2601c15f842d7289a4fb60bc68c",
        "title": "China faces 2026 marked by economic strains and uneasy rivalry with US: Asia Society",
        "summary": "Beijing and Washington will continue to circle each other warily in 2026 even as China’s leadership struggles to balance economic growth against its control fixation, according to a report on next year’s outlook for China released on Wednesday by the Asia Society.\n“As we look towards 2026, the story is not one of rises or triumph. It’s not black or white,” said Lizzi Lee, a fellow at the Society’s Centre for China Analysis and one of the report’s co-authors. “It is a story of transitions,...",
        "source": "smcp",
        "date": "2025-12-11T01:36:29+09:00",
        "url": "https://www.scmp.com/news/china/money-wealth/article/3335961/china-faces-2026-marked-economic-strains-and-uneasy-rivalry-us-asia-society?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9f2d7e51c5620963d35c80aa459f7e80f47827d99af7832d9802421a4fc63743",
        "title": "China pledges aid to Latin America, Caribbean with no ‘political conditions’",
        "summary": "China has promised no-strings-attached aid to Latin American and Caribbean countries as it positions itself as a key voice of the Global South and seeks to expand its influence in a region also actively courted by the United States.\nIn an updated policy framework for deeper economic cooperation with the region, Beijing highlighted what it described as a “significant shift in the international balance of power”, with the Global South gaining greater influence.\nThe strategy paper, the third of its...",
        "source": "smcp",
        "date": "2025-12-11T00:00:14+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335901/china-pledges-aid-latin-america-caribbean-no-political-conditions?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2f2c104dd07ee73ab4f8a242f4c7d5dd769ccc400bf77fe115eee984a1d4633c",
        "title": "China’s sovereign wealth fund reveals it opened London office after Trump win",
        "summary": "China’s flagship sovereign wealth fund has revealed that it opened a representative office in London shortly after Donald Trump’s victory in last year’s US presidential election, a move made amid increased scrutiny of Chinese investments in the United States.\nThe London office was officially registered in December 2024, with the mission of “advancing the company’s overseas investment business” and “promoting cross-border investment cooperation”, China Investment Corporation (CIC) said in its...",
        "source": "smcp",
        "date": "2025-12-10T23:00:09+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335938/chinas-sovereign-wealth-fund-reveals-it-opened-london-office-after-trump-win?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "625287ce4a73ffb1a596e65d7f90b25b6dccd72aae2c976850a8477bab3a5a84",
        "title": "China reveals more about mid-air stand-off, consumer prices edge up: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. China reveals radio clip heard before mid-air stand-off with Japan fighter jets\nChina on Tuesday released more details about Saturday’s mid-air stand-off between Chinese and Japanese fighter jets, as the two sides traded barbs over the radar lock-on incident amid rising tensions.\n2. How China pulled off a critical mineral tech revolution in just 10...",
        "source": "smcp",
        "date": "2025-12-10T22:15:08+09:00",
        "url": "https://www.scmp.com/news/china/article/3335752/china-reveals-more-about-mid-air-stand-consumer-prices-edge-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2d7b9b5701c5339f996420cf463a47da990d3f45094408d10b12eb18a049c8a0",
        "title": "Chinese supercomputer maker Sugon and chip developer Hygon call off merger plans",
        "summary": "Chinese supercomputer maker Sugon and chip designer Hygon Information Technology have called off a planned mega-merger that had been under discussion for months, in a surprise move that could complicate the country’s tech self-sufficiency efforts in the semiconductor and high-performance computing sectors.\nThe two Shanghai-listed companies late on Tuesday said they cancelled merger talks because “the market environment has changed significantly since the initial planning stages of this...",
        "source": "smcp",
        "date": "2025-12-10T22:00:16+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3335930/chinese-supercomputer-maker-sugon-and-chip-developer-hygon-call-merger-plans?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9ca7499a260d59e72fdcd2c9ac3c80df940bc3d94c1bc757353dac28a520f7f5",
        "title": "Former Nasa chief calls for new US approach to moon landing – much like China’s",
        "summary": "A former Nasa administrator has warned that America’s plan to return astronauts to the moon is technically unworkable, urging a much simpler approach – similar to China’s – as the only realistic way to stay ahead.\nMike Griffin, a 76-year-old aerospace engineer who led Nasa during the George W. Bush administration, told Congress that the Artemis programme “cannot work” because it relies on an overly complex design and many unproven technologies.\nUnder the current plan, the Artemis III mission...",
        "source": "smcp",
        "date": "2025-12-10T22:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3335865/former-nasa-chief-calls-new-us-approach-moon-landing-much-chinas?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f9cc201778cceb792ab9afaf1b24ae9b1b6cfd50ec362ff8200153efce784d5b",
        "title": "‘Peer powers’: China closes capacity and influence gap with US in Asia, annual index finds",
        "summary": "China and the US are “peer powers” in Asia, as Beijing closes the gap in the region with Washington and records the highest diplomatic influence score among countries measured, an Australian think tank’s latest annual gauge indicates.\nAccording to the 2025 edition of the Sydney-based Lowy Institute’s Asia Power Index, the United States remains the most powerful nation in the region. However, its comprehensive power score fell to 80.5 out of 100 – the lowest since the rankings began in...",
        "source": "smcp",
        "date": "2025-12-10T21:41:48+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335937/peer-powers-china-closes-capacity-and-influence-gap-us-asia-annual-index-finds?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "be5e2ca81f7a9382b01f81b295fc41f9b37a7e132cdc93dcce1c67b38c9d92e5",
        "title": "Alibaba names AI-lab leader Zhou Jingren as new group partner",
        "summary": "Alibaba Group Holding named its cloud unit’s technology officer Zhou Jingren, who also leads its artificial intelligence lab Tongyi and the development of its Qwen AI models, as a new member of the group in charge of steering the business empire, according to people briefed about the decision.\nAlibaba has not updated the information on its official website. The Alibaba Partnership had 17 members before the addition, including co-founders Jack Ma and Joe Tsai as permanent ones.\nAlibaba did not...",
        "source": "smcp",
        "date": "2025-12-10T21:00:42+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3335932/alibaba-names-ai-lab-leader-zhou-jingren-new-group-partner?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "db4fab4717c389a151942afedfe8ad9d88efa52bd31bd6a08d61d17415f6dab9",
        "title": "France and China are testing an alternative to zero-sum diplomacy",
        "summary": "French President Emmanuel Macron’s three-day visit to China last week signals a recalibration in how China and Europe engage at a moment when technological competition, trade disputes, climate imperatives and geopolitical fragmentation threaten global stability.\nMacron met enthusiastic students at Sichuan University; French first lady Brigitte Macron visited the Chengdu Research Base of Giant Panda Breeding.\nThe trip fostered economic collaboration between the two countries and deliberately...",
        "source": "smcp",
        "date": "2025-12-10T19:30:09+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3335838/france-and-china-are-testing-alternative-zero-sum-diplomacy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "687d96bdea49936f933246e173b37cae7e9dde910d8ca133a28fb03b9c42470e",
        "title": "South China Sea: Beijing seeks ‘fair and just maritime order’",
        "summary": "China is willing to work with Southeast Asian countries to manage maritime disputes in the South China Sea and build a fair and just maritime order, a senior Chinese diplomat has said.\nSpeaking in Sanya on the southern island province of Hainan, Sun Weidong, the vice-minister of foreign affairs, also hit out at the recent remarks by Japanese Prime Minister Sanae Takaichi, who suggested last month that an attack on Taiwan by the People’s Liberation Army (PLA) might qualify as a...",
        "source": "smcp",
        "date": "2025-12-10T19:03:12+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335903/south-china-sea-beijing-says-it-seeks-ease-disputes-asean-over-waterway?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3ce0149ea17cc919dda164c0ba98dbaed83aa6741400504a867f305b154efc08",
        "title": "China-Russia bomber patrol ‘a serious national security’ concern, Japanese minister says",
        "summary": "A joint patrol by Chinese and Russian nuclear-capable bombers near Japanese airspace is a serious national security concern, the country’s Defence Minister Shinjiro Koizumi has said.\nIn a social media post on Tuesday, Koizumi wrote that two Russian Tu-95 bombers had rendezvoused with two Chinese H-6 bombers over the East China Sea.\nThese aircraft then conducted a joint flight around Japan from the airspace between Okinawa’s main island and Miyako Island in the Ryukyu chain to the waters off...",
        "source": "smcp",
        "date": "2025-12-10T18:36:52+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3335910/china-russia-bomber-patrol-serious-national-security-concern-says-japanese-minister?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a7e52eee27523963fbe2dc92555a154c29f642a7601164caab5ba8bc1507125e",
        "title": "China’s Moore Threads to unveil AI chip road map to rival Nvidia’s CUDA system",
        "summary": "Moore Threads Technology is set to launch its latest graphics processing unit (GPU) architecture next week, fresh from the Chinese artificial intelligence chip designer’s stellar trading debut last Friday in Shanghai.\nFounder, chairman and CEO Zhang Jianzhong will unveil the Beijing-based firm’s fifth-generation GPU architecture during its inaugural MUSA Developer Conference on December 19 and 20 in the nation’s capital, according to the company’s latest post on WeChat.\nMUSA refers to the firm’s...",
        "source": "smcp",
        "date": "2025-12-10T18:01:01+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3335900/chinas-moore-threads-unveil-ai-chip-road-map-rival-nvidias-cuda-system?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "131fe7e5e2457be93aff7387d2c5c5e9d64a1b6ec15da1bb6ef8c8dec6545f2c",
        "title": "Hong Kong is a natural bridge for UK’s improving ties with China",
        "summary": "There are few truly global hubs in the world. London is one. New York is another. But neither of them connect East and West quite like Hong Kong. I visited the city last week as part of the inaugural UK Investment Conference and saw first-hand the energy and resilience that define this city. That makes the recent tragedy in Tai Po all the more heartbreaking.\nMy message to the people of Hong Kong after this deadly fire is this: we offer our profound sympathy to all those whose lives and...",
        "source": "smcp",
        "date": "2025-12-10T17:30:07+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3335801/hong-kong-natural-bridge-uks-improving-ties-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "67227638bb7390447bcbf0699173b7f58772c00116761a6c7853c4ca76eb33a3",
        "title": "IMF raises China growth forecast to 5% for 2025, citing resilience",
        "summary": "China’s economy is projected to grow by 5 per cent in 2025 before slowing to 4.5 per cent in 2026, the International Monetary Fund said on Wednesday, offering a slightly more upbeat outlook underscoring its view of the country’s resilience despite persistent trade frictions.\nThe annual assessment released on Wednesday showed an upwards revision of 0.2 and 0.3 percentage points from the IMF’s October forecast, as the world’s second-largest economy rolled out stimulus measures and faced...",
        "source": "smcp",
        "date": "2025-12-10T16:32:46+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335880/chinas-2025-growth-forecast-raised-5-imf-citing-resilience?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4cad8c3d784ec1d2c5f33704175b6e3c8ee31a97c5f99f3f81a197c989f926b8",
        "title": "12 killed after fire hits residential building in southern China’s Shantou city",
        "summary": "At least 12 people have died in a fire at a residential building in southern China, the first major incident of its kind in the mainland since last month’s Hong Kong blaze.\nThe fire broke out at around 9.20pm on Tuesday in Shantou in Guangdong province and was put out about 40 minutes later, according to state news agency Xinhua.\nThe building was a four-storey reinforced concrete structure and about 150 square metres (1,600 sq ft) were affected by the fire, local authorities said.\nOn Wednesday,...",
        "source": "smcp",
        "date": "2025-12-10T16:00:09+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335868/12-killed-after-fire-hits-residential-building-southern-chinas-shantou-city?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2bda374839359d6ba055035897234e07073de036dd9625191c37f4b46bf7e60d",
        "title": "China’s post-90s generation says no to liberal democracy, confounds West",
        "summary": "Chinese who came of age during the country’s economic boom are less supportive of liberal democratic values than older generations, a study has revealed, contradicting the predictions of Western policymakers and academics.\nThe study by researchers based in China and Britain found that Chinese people born after 1990 were “less likely to support democratic values than the older generation”, despite greater economic security and “a higher level of post-materialist values”.\nTheir findings were...",
        "source": "smcp",
        "date": "2025-12-10T15:01:18+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335861/chinas-post-materialist-generation-says-no-liberal-democracy-confounds-west?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5e635350bea3e88e245305c47f79bcac25143a680f2fdbd3f59e2401a63a6e47",
        "title": "China’s Fosun Pharma unit strikes US$2.1 billion obesity drug deal with Pfizer",
        "summary": "US pharmaceutical behemoth Pfizer has agreed to pay up to US$2.1 billion to Shanghai-based Fosun Pharma’s unit Yao Pharma for an experimental oral obesity drug, underscoring the growing trend of Chinese drug makers selling early-stage assets to global multinationals.\nUnder the licensing agreement, Yao Pharma would grant Pfizer an exclusive worldwide licence for the development, use, manufacturing and commercialisation of oral small-molecule drugs known as GLP-1 receptor agonists, including...",
        "source": "smcp",
        "date": "2025-12-10T13:15:14+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3335836/chinas-fosun-pharma-unit-strikes-us21-billion-obesity-drug-deal-pfizer?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b1cd72b41907a6b6ca861b2e57b689371cc387f13cb4ba3f066897dd7e98a183",
        "title": "Over 10 years in the making: China launches 2,000km-wide AI computing hub",
        "summary": "China has activated what may be the world’s largest distributed AI computing pool, alongside a high-speed data network developed over more than a decade, according to a state newspaper.\nThe official Science and Technology Daily said the optical network connected distant computing centres, so they could work together almost as efficiently as a single giant computer.\nThe 2,000km-wide (1,243-mile) computing power pool formed via this network could achieve 98 per cent of the efficiency of a single...",
        "source": "smcp",
        "date": "2025-12-10T13:00:15+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3335773/over-10-years-making-china-launches-2000km-wide-ai-computing-hub?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "dbdefbe037e6d0a2ea92d98c65fecd59d230c8d8f6669b06e5a53f16526bb653",
        "title": "China’s consumer prices rise at fastest pace in nearly 2 years in November",
        "summary": "China’s consumer prices rose for a second straight month in November, with inflation hitting its highest level in nearly two years, in a tentative sign that the country’s persistent deflationary pressure may be starting to ease.\nThe national consumer price index (CPI), a major gauge of inflation, rose 0.7 per cent year on year last month, the largest increase recorded since early 2024, according to data released by the National Bureau of Statistics on Wednesday.\nThe reading was slightly above...",
        "source": "smcp",
        "date": "2025-12-10T12:25:49+09:00",
        "url": "https://www.scmp.com/economy/economic-indicators/article/3335839/chinas-consumer-prices-rise-fastest-pace-nearly-2-years-november?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "91587c56b59e72bc390effa5f5552d4ca88935b718f524f5622cfbd90fd34107",
        "title": "European firms need to abandon overreliance on China and US, chamber report warns",
        "summary": "A new report recommends European companies avoid an overreliance on China or the US in their supply chains, as companies find themselves squeezed between Beijing’s preferential policies for local companies and Washington’s trade volatility.\nThe European Union Chamber of Commerce in China advised companies to “eliminate single-source dependencies on both China and the United States where possible” in its “Dealing with Supply Chain Dependencies” report released on Wednesday.\n“We are probably only...",
        "source": "smcp",
        "date": "2025-12-10T11:39:11+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335829/european-firms-need-abandon-overreliance-china-us-chamber-report-warns?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d5a863b942bd0ef61701cd7f9381b36f593d3d24ac986ae7cdde722a3610c7dc",
        "title": "Alibaba creates new unit to push consumer use of its Qwen AI models",
        "summary": "Alibaba Group Holding said on Tuesday that it will set up a new division to push the consumer use of artificial intelligence applications based on its Qwen family of large language models.\nThe new business unit, Qwen Consumer Business Group, led by Alibaba vice-president Wu Jia, will oversee the Qwen chatbot app, the Quark AI assistant and cloud drive, AI hardware products, the UC Browser and the online reading platform Shuqi.\nThe move marked a significant organisational change at Alibaba to...",
        "source": "smcp",
        "date": "2025-12-10T11:00:11+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3335793/alibaba-creates-new-unit-push-consumer-use-its-qwen-ai-models?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2ad6e4e598b538914db7063920c952a04b10314d25a4822a97a53dcc034575b5",
        "title": "For the Global South, Chinese AI principles resonate deeply",
        "summary": "The global artificial intelligence community’s attention was recently focused on DeepSeek’s latest open-source model, Math-V2, the first open-source AI model to score a gold medal-level performance at the International Mathematical Olympiad. But while California might hone in on the test scores, Jakarta and Nairobi are looking at something else entirely.\nFor the Global South, the critical question is more likely to be whether that reasoning capability can optimise fertiliser distribution in a...",
        "source": "smcp",
        "date": "2025-12-10T10:30:19+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3335420/global-south-chinese-ai-principles-resonate-deeply?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5b5faab6f48c5b5311ac92cad91b8f44b7eff89c050efd98aadf4f35c060696b",
        "title": "China’s Deep Robotics raises US$70 million in fresh funds as sector draws more investors",
        "summary": "Deep Robotics – one of the “Six Little Dragons” from Hangzhou, the capital of eastern Zhejiang province – on Tuesday said it had raised 500 million yuan (US$70 million) in fresh funding from a group of Chinese investors.\nAccording to the company’s statement, its latest round of financing was led by CMB International, China Asset Management and funds under state-owned telecommunications network operators China Telecom and China Unicom.\nDeep Robotics founder and CEO Zhu Qiuguo, who also serves as...",
        "source": "smcp",
        "date": "2025-12-10T10:00:21+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3335806/chinas-deep-robotics-raises-us70-million-fresh-funds-sector-draws-more-investors?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5e76f48669e88e7e3c0f98ed4f400304f9f324c3e450bb558b11bcceca80d60d",
        "title": "China and Russia must be on guard to stop Japan causing trouble, Chinese ex-diplomat warns",
        "summary": "Japan is likely to become the “most serious and direct” threat to both China and Russia in the Asia-Pacific, a former Chinese diplomat and foreign ministry official has warned.\nWu Hailong, assistant minister of foreign affairs from 2009 to 2011, now heads the semi-official China Public Diplomacy Association.\nRussia should factor in the challenge from Japan, he told a forum in Beijing last week.\n“When discussing China-Russia relations, I cannot avoid mentioning the Japan factor,” Wu said,...",
        "source": "smcp",
        "date": "2025-12-10T10:00:14+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335782/china-and-russia-must-be-guard-stop-japan-causing-trouble-chinese-ex-diplomat-warns?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6e6f70e8d1dc7f49cc092b80c182997782c90734f9c3440ace47d887e15df603",
        "title": "China’s Guangdong targets doubling GDP by 2035 despite slowing growth",
        "summary": "Guangdong, China’s largest provincial economy, has vowed to double its economy by 2035 from 2022 levels, in line with the central government’s target of becoming a medium-level developed country by that year.\n“Looking ahead, from the 20th National Congress of the Communist Party (in 2022) to 2035, Guangdong aims to achieve socialist modernisation and build a modern, new Guangdong within 13 years,” provincial authorities said in their five-year plan proposals released on Monday.\n“By that time,...",
        "source": "smcp",
        "date": "2025-12-10T09:30:10+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335798/chinas-guangdong-targets-doubling-gdp-2035-despite-slowing-growth?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b3b00e668b469bf12e7391960497208fa441a03335007f399d0b5ab909de8673",
        "title": "China, Hong Kong stocks set to gain nearly 20% in 2026, JPMorgan says",
        "summary": "China and Hong Kong stocks could deliver nearly 20 per cent gains in 2026, supported by resilient global growth, improving earnings and easing competition among e-commerce giants, according to JPMorgan.\nThe bank expected the MSCI China Index to rebound further as valuations normalised and Beijing’s push to curb excess capacity boosted profitability across key sectors, said Wendy Liu, chief China equity strategist at JPMorgan.\n“Earnings are giving us confidence,” Liu said during a media briefing...",
        "source": "smcp",
        "date": "2025-12-10T08:30:08+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3335804/china-hong-kong-stocks-set-gain-nearly-20-2026-jpmorgan-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4285101305bc3294433c44e8f2631c453d5dba614462ce6c2dc03f796ae260bb",
        "title": "US senators warn of China-cartel links forming a global ‘Silk Road of crime’",
        "summary": "Lawmakers from both parties are warning that Chinese criminal groups have helped build what officials call a “Silk Road of crime”, a global network that launders Latin American cartel profits and supplies the chemicals used to make fentanyl bound for the United States.\nAt a Senate hearing on Tuesday, members of the Caucus on International Narcotics Control said Chinese money brokers and Latin American cartels have merged their operations into a system that blurs the line between trade and...",
        "source": "smcp",
        "date": "2025-12-10T08:21:36+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3335821/us-senators-warn-china-cartel-links-forming-global-silk-road-crime?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a4ce0c94e998a39f985ee1f224bd56d93b85bdb2c83a04d79728ec167a317f17",
        "title": "How China pulled off a critical mineral production tech revolution in just 10 months",
        "summary": "When a European start-up developed a breakthrough technology capable of transforming low-grade bauxite – once considered waste – into high-quality feedstock for aluminium production, they announced it at an industry conference in Miami, United States.\nThe innovation not only promises to revive exhausted mines, but also opens a new door to extracting critical minerals and rare earth elements essential for semiconductors, electric vehicles and national defence.\nWith Western governments from...",
        "source": "smcp",
        "date": "2025-12-10T07:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3334322/how-china-pulled-critical-mineral-production-tech-revolution-just-10-months?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c874815c1a7da1af3be356a8cdf0e3f9ad7404f0500516312503c51301b69355",
        "title": "How Nexperia became a casualty of the US-China trade war",
        "summary": "Don’t bring a knife to a gunfight, they say. Alas, the Dutch government has been a slow learner.\nNo matter, the Nexperia debacle has shown how some European states have been too compliant with the United States and defiant with China. They don’t seem to realise they are little better than pawns in US President Donald Trump’s America.\n“Model allies that step up … will receive our special favour,” US Defence Secretary Pete Hegseth declared at the 2025 Reagan National Defence Forum in California...",
        "source": "smcp",
        "date": "2025-12-10T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3335596/how-nexperia-became-casualty-us-china-trade-war?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bd6c9c8b7bc1021416d1b232897761c4b6f8a80a8613e725cdb74a6b0833434a",
        "title": "China told Japan about air drills but not in enough detail to avoid danger, minister says",
        "summary": "Japanese Defence Minister Shinjiro Koizumi acknowledged that China had notified Japan in advance about drills involving the aircraft carrier Liaoning that led to a stand-off between warplanes from the two countries over the weekend.\nHowever, Koizumi told a press conference on Wednesday that the notification lacked detail about the scale and location of the exercise in the Pacific southeast of Okinawa’s main island and Beijing had not provided “notices to air missions”, a warning to ships and...",
        "source": "smcp",
        "date": "2025-12-10T05:06:34+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3335816/china-reveals-radio-communication-heard-mid-air-standoff-japanese-fighter-jets?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5504765311f3954b74d437dcb1f3bb2c163d459c3e8f7b75fc02cfd143dbce4c",
        "title": "Chinese boy Yuanxin, 6, speaks with father for first time since ICE detention",
        "summary": "Yuanxin, a 6-year-old immigrant from China who was detained and separated from his father, Fei Zheng, over the Thanksgiving holiday in New York City, was finally allowed to speak with his parent by phone this past weekend.\nJennie Spector, who has been supporting the family since July, described the call as a “very good development”. She said a US Immigration and Customs Enforcement (ICE) officer at the Orange County Correctional Facility in upstate New York, where Zheng is being held, made it...",
        "source": "smcp",
        "date": "2025-12-10T04:25:54+09:00",
        "url": "https://www.scmp.com/news/china/article/3335815/chinese-boy-yuanxin-6-speaks-father-first-time-ice-detention?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "43ab0a0b6aa5bccb56f1a99c4462f4c221126d6d619a590ecf32c63ca76cc734",
        "title": "Code talker 2025? PLA frontline troops are testing portable quantum radio devices",
        "summary": "The People’s Liberation Army is testing what could be the world’s first portable quantum radio device in its border patrol troops, according to the official Science and Technology Daily.\nThe PLA’s Information Support Force said its miniaturised prototype of quantum communication, weighing 3kg (6.6lbs), had successfully received radio signals from tens of kilometres away. The team was able to read lines of decoded information, the newspaper reported last Thursday.\n“This successful experiment will...",
        "source": "smcp",
        "date": "2025-12-10T00:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3335791/code-talker-2025-pla-frontline-troops-are-testing-portable-quantum-radio-devices?utm_source=rss_feed",
        "reportUrl": ""
    }
]