[
    {
        "id": "f724aaa12d87cf59e15ab99bcb0dcd25860af148107e12123343e392a094b1d7",
        "title": "China investigates former stocks regulator Yi Huiman for disciplinary breaches",
        "summary": "Yi Huiman, the former regulator of China’s equities market, is being investigated for disciplinary breaches, as the country’s long-standing anti-graft campaign extends into all corners of the financial industry, from banking to the stock market.\nYi, the chairman of the China Securities Regulatory Commission (CSRC) from January 2019 to February 2024, is being investigated by the Communist Party’s disciplinary unit for severe breaches of discipline, according to the Central Commission for...",
        "source": "smcp",
        "date": "2025-09-06T12:23:00+09:00",
        "url": "https://www.scmp.com/business/article/3324584/china-places-former-stocks-regulator-yi-huiman-under-probes-disciplinary-breaches?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8ee6966ef78c2bb99df1d3a44c2b20b2b319ca58cbed566d062abb1826441087",
        "title": "China’s party diplomacy in play as communist leaders gather for parade",
        "summary": "The past week has been a flurry of not only state-level diplomacy but also party-to-party outreach, with President Xi Jinping receiving a series of leaders from the four remaining communist countries on a single day.\nXi held meetings with leaders from Cuba, North Korea, Laos and Vietnam, all of whom attended Wednesday’s military parade in Beijing marking the 80th anniversary of the victory in the war against Japanese aggression.\nWhile Beijing has no interest in promoting a communist...",
        "source": "smcp",
        "date": "2025-09-06T12:00:19+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3324543/chinas-party-diplomacy-play-communist-leaders-gather-military-parade?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8ffb3cbf44e4984a164d8568429c4169f180856a7f3686e19fb406117cf3f2b3",
        "title": "China’s yuan rallies with central bank backing as worries mount over US dollar",
        "summary": "A recent rally in China’s yuan has been primarily fuelled by stronger guidance from its central bank rather than by market forces, analysts said, pointing to a mostly steady US dollar index.\nHowever, they noted, this period of strengthening is likely to remain measured, as Beijing prefers to avoid harming the competitiveness of its exporters amid trade tensions with the United States.\nOver just five trading days last week, the People’s Bank of China pushed the yuan’s reference rate against the...",
        "source": "smcp",
        "date": "2025-09-06T11:00:14+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3324501/chinas-yuan-rallies-central-bank-backing-worries-mount-over-us-dollar?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3eb33820f1593e9923a5c123907dec7df2c05d0f40223728636783be0050394e",
        "title": "Young Chinese are trying out the simple life. Am I missing out?",
        "summary": "When my friend Lee first lost his job in 2023, he was terrified. From the moment he graduated in 2016, he had been working nonstop. He had changed jobs a couple of times, but always had a choice – he had never been kicked out of the job market like this.\nLee worked in the traditional publishing business, editing children’s books. The industry has been tanking, with the rise of digital books, and the post-pandemic slump doesn’t help. He was laid off with half of his colleagues, with a small...",
        "source": "smcp",
        "date": "2025-09-06T10:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3324178/young-chinese-are-trying-out-simple-life-am-i-missing-out?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "80ccbf1478a741847ad8d200ff1039ebdd0f2f3060645ea910ece6933bf10e9f",
        "title": "China’s multipolar ambition is making the US sit up and fire back",
        "summary": "At the Shanghai Cooperation Organisation (SCO) summit in Tianjin this week, the choreography was striking. Chinese President Xi Jinping, flanked by Russian President Vladimir Putin and Indian Prime Minister Narendra Modi, unveiled proposals for a development bank, expanded BeiDou satellite services, and cooperation in green technology, artificial intelligence and infrastructure.\nThe message was unmistakable: the SCO is no longer just a security forum. It is evolving into a platform offering...",
        "source": "smcp",
        "date": "2025-09-06T07:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3324312/chinas-multipolar-ambition-making-us-sit-and-fire-back?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "28da7ef40dee8a3f147483d1bbcb3a25a226cc94fc4ffd5a8114691959cbf2a4",
        "title": "China’s biotech industry is gaining on the US. Can tariffs hold them back?",
        "summary": "In the summer of 2015, a time when China’s pharmaceutical market was in a phase of rapid expansion, a sudden regulatory change sent tremors through the industry: drug companies would need to audit the clinical trial data for all pending applications.\nIf withdrawn within a month of the announcement, firms could avoid penalties for submitting flawed applications, but hiding or falsifying data would court severe punishments, including multi-year filing bans.\nThe response from the industry indicated...",
        "source": "smcp",
        "date": "2025-09-06T07:00:13+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3324487/chinas-biotech-industry-gaining-us-can-tariffs-hold-them-back?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "562f11570dff3933c936e7c9c8f85f36aa7bf9b1902c43a499644363e98f203b",
        "title": "Trump suggests India is moving towards ‘deepest, darkest’ China orbit",
        "summary": "US President Donald Trump suggested on Friday that India is drifting towards China’s orbit, even as his assertive tariffs and public rebukes have tested ties with New Delhi.\nAides are warning that India could soon regret its stance and even face new curbs.\n“Looks like we’ve lost India and Russia to deepest, darkest, China. May they have a long and prosperous future together,” the “America first” president wrote on social media.\nHis remarks were posted alongside a photo of Indian Prime Minister...",
        "source": "smcp",
        "date": "2025-09-06T06:26:58+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3324576/trump-suggests-india-moving-towards-deepest-darkest-china-orbit?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "16f8d3868120e54ef0be0ade56f2f1adcb21fcb5afbdd392cdd8763b37000fb9",
        "title": "Texas law curbing Chinese property rights takes effect, no relief in sight for months",
        "summary": "A Texas law restricting property ownership and leasing by Chinese citizens came into effect this week, thrusting affected residents into legal limbo with no path to relief before November.\nThe law, which restricts real estate purchases by companies, individuals and government entities linked to countries that the federal government deems a threat to the US, took effect on September 1 after a legal challenge failed to block it in time. The legislation identifies China, Iran, North Korea and...",
        "source": "smcp",
        "date": "2025-09-06T02:16:03+09:00",
        "url": "https://www.scmp.com/news/us/politics/article/3324572/texas-law-curbing-chinese-property-rights-takes-effect-no-relief-sight-months?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7ddf6949de10557cb21777906341563502732264ff7396b4510910f87389749b",
        "title": "Chinese military aided by Pentagon-funded research: House Republican report",
        "summary": "A US House of Representatives committee is taking aim at the Department of Defence for funding hundreds of projects with Chinese universities and institutes linked to the country’s defence industry, in the latest sign of Washington’s unease over research ties that could benefit Beijing’s military modernisation.\nThe 79-page report, released by Republicans on the House Select Committee on the Chinese Communist Party on Friday, argues that the projects have allowed China to “exploit” US...",
        "source": "smcp",
        "date": "2025-09-06T01:59:04+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3324571/pentagon-funded-research-has-aided-chinese-military-house-republican-report?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7be7298477a1f0c72f220f961739145d5df4a3863f96a2bd275ab4178fa83c12",
        "title": "China pulled off high-orbit refuelling and may beat US to moon, ex-officials say",
        "summary": "China appears to have pulled off not only the first satellite-to-satellite refuelling in geosynchronous orbit, but also the “largest single manoeuvre” ever seen in that orbit, according to a former US Space Command official.\nThe two spacecraft – the Shijian-21 and Shijian-25 – have been docked some 36,000km (22,370 miles) above Earth since early July. Their mysterious mission was widely believed to involve the Shijian-25 supplying the Shijian-21 with propellant.\nLast month, they executed what...",
        "source": "smcp",
        "date": "2025-09-05T23:00:07+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3324468/china-pulled-high-orbit-refuelling-and-may-beat-us-moon-ex-space-officials-say?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7329032ceb853e897bf5e26b0cea5ff623bb39339978153928a045c5ddc78bf5",
        "title": "China moves to boost electronics self-sufficiency as US tightens chip curbs",
        "summary": "China has released a new action plan to bolster its electronics manufacturing sector that stresses the need for resilient, self-sufficient supply chains, as the country confronts rising US export curbs on advanced chip technology.\n“The electronics manufacturing industry is a strategic, foundational and leading sector of the national economy, crucial to stabilising industrial growth and safeguarding national economic and political security,” stated the 13-page document issued by the Ministry of...",
        "source": "smcp",
        "date": "2025-09-05T22:30:08+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3324516/china-moves-boost-electronics-self-sufficiency-us-tightens-chip-curbs?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b8132877d2b544b970dfa5d97965eb38c8de752c0c4326da9dcfa77724d1ded7",
        "title": "Europe’s summer from hell, the future of air combat: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Europe’s summer from hell bleeds into autumn as Trump and Xi turn the screws\nIf Brussels’ bureaucrats returning from their long summer breaks this week were wondering what they missed, the local press had them covered. Unbecoming scenes at June’s Nato summit, the “hopelessly one-sided” trade deal with the United States in July, as well as Chinese President...",
        "source": "smcp",
        "date": "2025-09-05T22:09:06+09:00",
        "url": "https://www.scmp.com/news/china/article/3324515/eu-flounders-trump-xi-turn-screws-chinas-stablecoin-dilemma-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "efeb07da80606e72ebe51ecfd1e087d375ffc95569362157a6e64e7d3301fdce",
        "title": "China, Pakistan pledge stronger tech and trade cooperation amid US charm offensive",
        "summary": "China and Pakistan have pledged to expand trade and deepen technological cooperation in areas ranging from agriculture to space exploration, at a time when Islamabad is warming to the United States.\nDuring a meeting on Thursday with Pakistani Prime Minister Shehbaz Sharif, Premier Li Qiang said Beijing would advance the second phase of the China-Pakistan Economic Corridor (CPEC), a flagship infrastructure project under the Belt and Road Initiative.\n“Global instability and uncertainty have grown...",
        "source": "smcp",
        "date": "2025-09-05T21:30:11+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3324517/china-pakistan-pledge-stronger-tech-and-trade-cooperation-amid-us-charm-offensive?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "90a1fd31ecd4957b10d0b41c274ef2426571bf5391dde4495155b05c59d1200a",
        "title": "Solution to Ukraine war must be found in the UN, not the killing fields",
        "summary": "This year marks the 80th anniversary of Japan’s surrender in World War II and the founding of the United Nations. Humanity learned with great pain that peace and security must coexist for all nations, and the vicious circle of war must not be repeated.\nIn 1941, the United States imposed an oil embargo on Japan in response to its expansion in Asia and invasion of French Indochina. For the US and its allies, Japan’s militant aggression was a blatant violation of peace; for Japan, the embargo was...",
        "source": "smcp",
        "date": "2025-09-05T21:30:07+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3324197/ukraine-war-must-be-resolved-within-un-halls-not-battlefield?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4254ead34a45551fd3976caf213f6aeebdce415c632181209e0ed1906fb1f9cc",
        "title": "World weather agency warns of vicious cycle in air and climate",
        "summary": "World weather agency warns of vicious cycle in air and climate",
        "source": "cgtn",
        "date": "2025-09-05T21:13:34+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/World-weather-agency-warns-of-vicious-cycle-in-air-and-climate-1GqlCQfmHV6/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ccc9c1fbec8758b188115111b4f3ff718fe370c1eaf205d0c23ea4a2889855d4",
        "title": "Taiwan holds back on penalties for Victory Day parade supporters",
        "summary": "Taipei authorities have taken a softer line on Taiwanese individuals attending Beijing’s Victory Day military parade this week, despite repeated warnings in the weeks leading up to the event.\nFormer Kuomintang (KMT) chairwoman Hung Hsiu-chu defied the warnings and appeared on the rostrum overlooking Tiananmen Square on Wednesday, watching the parade marking the 80th anniversary of the end of World War II.\nThe next day, Liang Wen-chieh, deputy minister of Taiwan’s Mainland Affairs Council, said...",
        "source": "smcp",
        "date": "2025-09-05T21:00:07+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3324510/taiwan-holds-back-penalties-victory-day-parade-supporters?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "435fd37060afa555cc345a7ed6bc8ecb24ea15c876714998e62b380037ea823a",
        "title": "China’s cities feed the AI monster with dedicated services for economic roar",
        "summary": "China’s city governments are racing to stake out a role in artificial intelligence, with Wenzhou this week becoming the nation’s first to set up a dedicated bureau for AI-related matters – underscoring how local officials are ramping up efforts amid Beijing’s push to gain an edge in the AI race with the United States.\nAuthorities in Wenzhou, located in the provincial economic powerhouse of Zhejiang, announced the bureau’s formation at a high-profile AI Innovation and Development Conference on...",
        "source": "smcp",
        "date": "2025-09-05T20:30:07+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3324521/china-cities-feed-ai-economies-dedicated-services-race-us-picks-pace?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a9f2a05c92145c1b34130e34154387a778539d76a8dab016bc15f1d0334cd279",
        "title": "China’s ‘silent sanction’ on US semiconductors creates a weapons generation gap",
        "summary": "In addition to the spectacle of Wednesday’s military parade in Tiananmen Square, with its rows of never-before-seen weapons and equipment, was a less visible but highly consequential shift.\nAt its heart lies China’s growing dominance in gallium nitride (GaN) semiconductor technology, giving it a strategic advantage that is reshaping the global arms race, according to a report by the Chinese Academy of Sciences’ Institute of Physics.\n“Behind this technological advancement lies a ‘hidden thread’...",
        "source": "smcp",
        "date": "2025-09-05T20:00:08+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3324489/chinas-silent-sanction-us-semiconductors-creates-weapons-generation-gap?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e7f0679bb9da79ab19165023a4cf3d42e2079f23cb6705a8afcacfc2c6e4f881",
        "title": "China’s vision of multipolar order depends on yuan-based system:  Oleg Deripaska",
        "summary": "A yuan-based payment system would be crucial to building the multipolar world China has been calling for, according to a Russian billionaire and close associate of President Vladimir Putin.\n“A multipolar world will depend on how quickly China could develop a payment system, and it depends upon Chinese banks,” Oleg Deripaska, the founder of Russian aluminium giant Rusal, said in Beijing on Wednesday.\n“Chinese banks are too dependent upon dollar assets, and they are scared to death to take any...",
        "source": "smcp",
        "date": "2025-09-05T19:00:12+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3324469/chinas-vision-new-multipolar-order-depends-yuan-based-system-oleg-deripaska-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e0935c85da620a6b18ceba7a49b346cad575e5640d4f83256900997d69437efe",
        "title": "Tongli after dusk: The philosophy of stillness",
        "summary": "More than a travelogue, this piece lingers on small, heartfelt moments – an elderly couple waving from their veranda, lantern lights bending across the canals, the hush of boats gliding under arched bridges. It's a portrait of intimacy and atmosphere, where language falters but gestures and glances carry the story forward.",
        "source": "cgtn",
        "date": "2025-09-05T18:32:38+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/Tongli-after-dusk-The-philosophy-of-stillness-1Gq7ZhNxtxC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a89ac032a2d4050d335ee7fcd679f34eb9c17d7d809303c53e8185b4d9242025",
        "title": "Chinese man detained for ‘inappropriate comments’ about Victory Day parade",
        "summary": "A man in the central province of Hubei was detained for allegedly making “inappropriate comments” about China’s Victory Day military parade and spreading rumours.\nAccording to cyber police in the city of Xiangyang, the 47-year-old man, surnamed Meng, made slanderous and derogatory remarks on Wednesday while commenting on a social media post about the parade held in Beijing to mark the 80th anniversary of the end of World War II.\nWhen others expressed patriotic sentiment, Meng “insulted them and...",
        "source": "smcp",
        "date": "2025-09-05T18:02:47+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3324497/chinese-man-detained-inappropriate-comments-about-victory-day-parade?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0ffb271a3c92df9ae9cd50013d7ccc701b18d3b03a10bb5717fcb80c433da223",
        "title": "China sets off in pursuit of US$980 billion sports economy",
        "summary": "China is aiming to build a 7 trillion yuan (US$980 billion) sports sector by 2030 – complete with a series of “internationally influential” sports companies and events – as the world’s second-largest economy shifts to a consumption-driven mode, according to a new central government directive.\nSeeking to spur economic growth through sports consumption, the 20-measure directive issued on Thursday by the State Council, China’s cabinet, vowed to promote low-altitude sports events, foster the “ice...",
        "source": "smcp",
        "date": "2025-09-05T18:00:11+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3324467/global-games-outdoor-activities-china-aims-us980-billion-sports-economy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1bf3287b279c0cc7dd4551b0584d5d0dd53763673cdd67eeb915a734e21f5fe3",
        "title": "New aircraft models debut at low-altitude economy event",
        "summary": "New aircraft models debut at low-altitude economy event",
        "source": "cgtn",
        "date": "2025-09-05T17:56:36+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/New-aircraft-models-debut-at-low-altitude-economy-event-1Gq3u0Z6YXC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f64ba7a280dfaae7b01fb5feecf7f1501fb6eb3789ffc15ef23139dc1aca33e0",
        "title": "Wang Huning meets Taiwan representatives joining V-Day commemorations",
        "summary": "Top political advisor Wang Huning on Thursday met with representatives of various sectors from the Taiwan region, including former chairperson of the Chinese Kuomintang party Hung Hsiu-chu, who are in Beijing for commemorations marking the 80th anniversary of the victory of the Chinese People's War of Resistance Against Japanese Aggression and the World Anti-Fascist War.",
        "source": "cgtn",
        "date": "2025-09-05T17:26:30+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/Wang-Huning-meets-Taiwan-representatives-joining-V-Day-commemorations-1GpJaiehBra/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "053afb512e66713529fe487fb0e02788a3c3d3fdc188e55d5584be283636559e",
        "title": "China issues anti-dumping ruling on European pork, charges deposits",
        "summary": "China has made a preliminary determination that Europe is dumping pork and pork by-products into its market, causing “material injury” to the domestic industry, Beijing’s Ministry of Commerce said on Friday.\nThe announcement, which carries a “provisional anti-dumping measure” in the form of cash deposits, marks an escalation in China-EU trade tensions after major French cognac producers were exempted from punitive levies stemming from a separate investigation.\n“Starting September 10, importers...",
        "source": "smcp",
        "date": "2025-09-05T17:20:02+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3324485/china-issues-preliminary-anti-dumping-ruling-european-pork-charges-deposits?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3c81634ae261a0697d150460d12ebf6868a20bf5734b122524dba6db6dac4191",
        "title": "Kenya’s plan to switch debt payments from US dollars to yuan is a ‘win-win’",
        "summary": "Kenya’s plan to convert its US dollar-denominated Chinese debt to yuan is a “win-win”, as it is expected to reduce interest payments for the African nation while advancing China’s goal of increasing the global use of its currency, according to analysts.\nThe deal would be precedent-setting and could establish a new rule book for future debt restructuring and possibly cut reliance on the US dollar.\nIn late August, Kenya’s Treasury announced that talks with the Export-Import Bank of China were at...",
        "source": "smcp",
        "date": "2025-09-05T17:00:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3324321/kenyas-plan-switch-debt-payments-china-us-dollars-yuan-win-win?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "150d2954ed826b36f2d29838e73440ba7d91d2798ab2811f80963d380057221a",
        "title": "China's services trade sees notable growth in first 7 months",
        "summary": "China's services trade sees notable growth in first 7 months",
        "source": "cgtn",
        "date": "2025-09-05T16:54:32+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/China-s-services-trade-sees-notable-growth-in-first-7-months-1Gq4yBTse1q/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "944ee1e2b4b7ef12f0ef5a9a274250cba06b67d472aa25cc116f2e44761fd55f",
        "title": "Portuguese Prime Minister Luis Montenegro to visit China",
        "summary": "Portuguese Prime Minister Luis Montenegro to visit China",
        "source": "cgtn",
        "date": "2025-09-05T16:45:32+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/Portuguese-Prime-Minister-Luis-Montenegro-to-visit-China-1Gq4zfD0PVm/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a8e07a83cc2fedf6d40e3458f2f736a1ef56c9cada80a009b18d1fe8002e5fce",
        "title": "Smart industry expo in China offers glimpse into intelligent society",
        "summary": "The future of artificial intelligence (AI) including intelligent connected new energy vehicles (NEVs), essentially AI-powered computers on wheels, is on display at the World Smart Industry Expo 2025, offering a glimpse into life in the next decade.",
        "source": "cgtn",
        "date": "2025-09-05T16:33:59+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/Smart-industry-expo-in-China-offers-glimpse-into-intelligent-society-1GpXohp9cic/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "14db6bc73b45a73bb025ac862e03fdbe45d3563e66c648a13775f755bf5bfb8a",
        "title": "China closes biotech gap with US as new drugs, pipelines top 30% of global total",
        "summary": "China’s push to become a biotech powerhouse is paying off, with innovative R&amp;D pipelines and newly approved drugs accounting for over 30 per cent of the global total, according to the country’s top economic planner.\nThe sector was showing strong momentum, said Xiang Libin, deputy chairman of the National Development and Reform Commission (NDRC), who cited the figures at the 17th China Bioindustry Convention in Wuhan, Hubei province, on Thursday.\nChina’s bioeconomy, encompassing the research,...",
        "source": "smcp",
        "date": "2025-09-05T16:30:16+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3324465/china-closes-biotech-gap-us-new-drugs-rd-pipelines-top-30-global-total?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a480c421e2462abe186f2fb8bbd88e374492090366d82184ef464b6a545af4c0",
        "title": "Integrating China and Africa into the global memory of WWII",
        "summary": "Integrating China and Africa into the global memory of WWII",
        "source": "cgtn",
        "date": "2025-09-05T16:04:46+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/Integrating-China-and-Africa-into-the-global-memory-of-WWII-1Gq0ZHccpj2/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "81606e47377c2bd70cb0b7bf3e34490bb09dee36469deac14592c83ebedebab2",
        "title": "China's New Sword: The ultimate hypersonic and nuclear deterrent",
        "summary": "China's New Sword: The ultimate hypersonic and nuclear deterrent",
        "source": "cgtn",
        "date": "2025-09-05T15:09:17+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/China-s-New-Sword-The-ultimate-hypersonic-and-nuclear-deterrent-1GpMEIqcPvO/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "acf5d853f3d6e578698bdad9e28458de4f270e1eecafe997d1d89babc905a9c8",
        "title": "Europe’s summer from hell bleeds into autumn as Trump and Xi turn the screws",
        "summary": "If Brussels bureaucrats returning from their long summer breaks this week were wondering what they missed, the local press had them covered.\nUnbecoming scenes at June’s Nato summit, the “hopelessly one-sided” trade deal with the United States in July, as well as Chinese President Xi Jinping’s refusal to travel to Belgium for that month’s summit with EU leaders, were all cited by the Brussels media outlet Euractiv.\n“Now talk of a European moment has given way to fears of a European ‘century of...",
        "source": "smcp",
        "date": "2025-09-05T15:00:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3324446/europes-summer-hell-bleeds-autumn-trump-and-xi-turn-screws?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0d58bcecd47640c7aded4eba6c4e0031f4ab8ffe3303342feaaa1cff6f5bc2b0",
        "title": "Starbucks China valued at about US$5 billion by bidders, sources say",
        "summary": "Most of the bidders seeking to buy a portion of Starbucks’ China operations have submitted offers valuing the business at as much as US$5 billion, said two people with knowledge of the discussions.\nThat would make a potential deal one of the most valuable China unit divestments by a global consumer company in recent years.\nThe offers, which have not been reported previously, would let Starbucks push ahead with the sale in a market where it faces sluggish growth and stiff competition from local...",
        "source": "smcp",
        "date": "2025-09-05T13:33:11+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3324432/starbucks-china-valued-about-us5-billion-bidders-sources-say?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8464d8bc6e58b49d62baa1b19017441f3452b54b30aea072e4b4aa2fce432863",
        "title": "Blind at 9, sex slave at 14: She carried a dead fetus for years",
        "summary": "Blind at 9, sex slave at 14: She carried a dead fetus for years",
        "source": "cgtn",
        "date": "2025-09-05T13:25:47+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/Blind-at-9-sex-slave-at-14-She-carried-a-dead-fetus-for-years-1GoMMuq9pRK/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "51429b7bb4337ec5c9b5d2cb408a977b81335ae37e03b5b811277306fc75c6d2",
        "title": "US TV drama draws flak in Singapore, Pentagon’s pizza orders: 7 highlights",
        "summary": "We have selected seven stories from this week’s news across Hong Kong, mainland China, the wider Asia region and beyond that resonated with our readers and shed light on topical issues. If you would like to see more of our reporting, please consider subscribing.\n1. Nuclear missiles and ‘loyal wingmen’: 8 surprises from China’s military parade\nChina’s military parade on Wednesday celebrating the 80th anniversary of Japan’s defeat in World War II showcased various new weapons systems, including...",
        "source": "smcp",
        "date": "2025-09-05T13:22:07+09:00",
        "url": "https://www.scmp.com/news/world/article/3324289/chinas-victory-day-parade-us-tv-series-draws-flak-singapore-scmps-7-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3cebd1a923877a9eac6ab35ef1d76934621157000ac9f94b9c2a71f63c966ab4",
        "title": "PAGE X: Witnessing the ebb and tide of history",
        "summary": "PAGE X: Witnessing the ebb and tide of history",
        "source": "cgtn",
        "date": "2025-09-05T13:20:39+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/PAGE-X-Witnessing-the-ebb-and-tide-of-history-1GkzGG6e5Lq/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b83fcfc1b5fbead21c95df657f958932094942c6275c6d7ef01e635af71b9ae0",
        "title": "Space conference in China unveils future trends of deep space economy",
        "summary": "The future development of deep space economy is expected to focus on sectors such as energy, internet services, tourism and cultural creativity, with the global market scale reaching trillion-dollar levels by 2040, according to a space conference held on Thursday in east China's Anhui Province.",
        "source": "cgtn",
        "date": "2025-09-05T13:17:20+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/Space-conference-in-China-unveils-future-trends-of-deep-space-economy-1GpEvhaoLx6/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "c2aeb346ec7772d0d232be3c054b544cf41c9d862587225ab0a7517ee1b66b56",
        "title": "Overseas Chinese commemorate victory against Japanese aggression",
        "summary": "A symposium commemorating the 80th anniversary of the victory in the Chinese People's War of Resistance Against Japanese Aggression and the World Anti-Fascist War was held in Beijing on Tuesday, drawing 340 participants, including representatives of patriotic figures from all sectors of society from Hong Kong, Macao, Taiwan and foreign countries.",
        "source": "cgtn",
        "date": "2025-09-05T13:16:34+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/Overseas-Chinese-commemorate-victory-against-Japanese-aggression-1GpI3OcZda8/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "5f0b33ffc1336831d55e1a3c84753a64ce1471cda0942ddf5d45f10f61836707",
        "title": "Xi sends congratulatory letter to World Smart Industry Expo 2025",
        "summary": "Chinese President Xi Jinping on Friday sent a congratulatory letter to the World Smart Industry Expo 2025, which opened in southwest China's Chongqing Municipality.",
        "source": "cgtn",
        "date": "2025-09-05T13:08:34+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/Xi-sends-congratulatory-letter-to-World-Smart-Industry-Expo-2025-1GpF59Q8IzS/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a8889843b0abf2812e1b514398ce02adb681b41fa125cb835455634fe4e99cdf",
        "title": "Europe power guru Wang Xiongfei brings grid stability expertise home to China",
        "summary": "One of the European Union’s top power systems experts, Wang Xiongfei, has come full circle after returning to China to take a leading academic role at Tsinghua University.\nAs the newly appointed Xinghua chair professor and doctoral supervisor, Wang brings years of knowledge and experience in European power electronics and grid stability.\nHe has led more than 40 research projects funded by the EU, Denmark, Sweden and various corporations. He has collaborated with grid companies in Germany, the...",
        "source": "smcp",
        "date": "2025-09-05T13:00:08+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3324355/europe-power-guru-wang-xiongfei-returns-china-bringing-expertise-grid-stability?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b286cd1a36ace4912f50488b3f0b6fa85f7e5a3e246ac8a08b7587e18c4bebba",
        "title": "China-Russia co-produced film \"Red Silk\" premieres in China",
        "summary": "China-Russia co-produced film \"Red Silk\" premieres in China",
        "source": "cgtn",
        "date": "2025-09-05T12:40:01+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/China-Russia-co-produced-film-Red-Silk-premieres-in-China-1GpFs9HfspG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "167c39bf9ce36098a35441320d1f9bae7436ba7ea6f0ef20be242f1a4c2f2b10",
        "title": "\"Village karaoke\" in Deqing, Zhejiang Province goes viral",
        "summary": "\"Village karaoke\" in Deqing, Zhejiang Province goes viral",
        "source": "cgtn",
        "date": "2025-09-05T12:39:26+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/-Village-karaoke-in-Deqing-Zhejiang-Province-goes-viral-1GliS0yFNN6/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "fe79b200e0ae2060d5ae78dbc40aeaa891eb89815169ef1954b1985a7582e931",
        "title": "World experts: China reaffirms peaceful development in grand parade",
        "summary": "World experts: China reaffirms peaceful development in grand parade",
        "source": "cgtn",
        "date": "2025-09-05T11:13:55+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/World-experts-China-reaffirms-peaceful-development-in-grand-parade-1Gpwh1GHLMY/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "56a210a965b1a76abb0c8fad07d00fbea1242f0ece405cd83882a5ebbcdb7e35",
        "title": "Beyond the parade, what China’s new stealth drones mean for future air combat",
        "summary": "Among the many pieces of advanced military hardware showcased during Wednesday’s Victory Day parade in Beijing were at least four unnamed drones, at least one of which was a “loyal wingman”, a stealth attack drone supposedly capable of coordinated aerial warfare alongside crewed jets, according to state broadcaster CCTV.\nThe appearance left military observers to speculate about what they had seen, and raised many new questions. Some experts believe the advanced aircraft are capable of hypersonic...",
        "source": "smcp",
        "date": "2025-09-05T11:00:22+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3324385/beyond-parade-what-chinas-new-stealth-drones-mean-future-air-combat?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e07515c60706dba2796edacb60ee5ffd6f8ee8440837efe4ea79c7312f835a28",
        "title": "Chinese province floats new use for digital yuan: paying long-delayed debts",
        "summary": "China is mulling the application of its digital yuan – the central bank-backed currency also known as the e-CNY – to tackle persistent payment defaults, a move that would broaden the asset’s scope beyond the set of use cases explored by Beijing since the currency’s launch in 2019.\nAuthorities in the central province of Hunan touched upon the subject when detailing plans to expand the digital currency’s application scenarios and scale, according to a document published last month.\nHunan will...",
        "source": "smcp",
        "date": "2025-09-05T10:00:12+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3324361/chinese-province-floats-new-use-digital-yuan-paying-long-delayed-debts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7bb74b45af15767807365194fc4f75675958693391ea4d321374800e4d43d8f6",
        "title": "Top Chinese diplomat meets chief advisor to Brazilian president",
        "summary": "Top Chinese diplomat meets chief advisor to Brazilian president",
        "source": "cgtn",
        "date": "2025-09-05T08:59:58+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/Top-Chinese-diplomat-meets-chief-advisor-to-Brazilian-president-1GpvDUi0sXC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "8c4e9d70a92f07a69e5bef347aed60274dce600cbfcb341e00e5cc066314cd28",
        "title": "US State Department employee sentenced for passing classified information",
        "summary": "A US State Department employee was sentenced to four years in prison in the US District Court for the Eastern District of Virginia on Thursday for conspiring to collect and transmit national defence secrets to individuals he believed were working for the Chinese government, according to the US Justice Department.\nMichael Schena, 42, sold “sensitive” US government documents to people who claimed to be international consultants, according to court documents, despite clear indications and his...",
        "source": "smcp",
        "date": "2025-09-05T08:23:54+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3324402/us-state-department-employee-sentenced-passing-classified-information?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3999524f62d0e60965e366e5fd3428fa66a02ce0922fbc9b9adcf896846ce4cd",
        "title": "‘Summer of stablecoins’: how will China respond to US dollar’s crypto surge?",
        "summary": "Once a niche corner of the cryptocurrency world, stablecoins have surged into the global spotlight this year, prompting analysts and industry insiders to declare that the digital asset’s time has come.\nIn July, US President Donald Trump signed the GENIUS Act into law, establishing the first federal regulatory regime for stablecoins – a move many believe could pave the way for mass-market adoption.\nShortly after, Hong Kong introduced its own ordinance, which took effect on August 1, requiring...",
        "source": "smcp",
        "date": "2025-09-05T07:00:12+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3324322/chinas-stablecoin-dilemma-why-us-dollar-tokens-matter-and-how-beijing-might-respond?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ba2cfbde766896db4eb7c4c4b7758fc6354f1a9a164da1271f94f54b73af7bab",
        "title": "China’s vision of ‘true multilateralism’ resonates with Muslim world",
        "summary": "President Xi Jinping’s renewed call for a new global security and economic order that places the Global South at its core is more than rhetorical positioning against the United States. It signals a paradigm shift in the architecture of world politics.\nSpeaking at the Shanghai Cooperation Organisation (SCO) summit in Tianjin on Monday, Xi called on nations to “oppose hegemonism and power politics” and instead “practise true multilateralism”. The message was unmistakable: the dominance of the US...",
        "source": "smcp",
        "date": "2025-09-05T06:30:07+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3324164/chinas-vision-true-multilateralism-resonates-muslim-world?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3370f604718c95647957ff0205b4f3689d93465063c846d4072bff5e5afa879e",
        "title": "China's V-Day Parade Sheds Light on History|The Unsung Ally|Part One",
        "summary": "China's V-Day Parade Sheds Light on History is out now!",
        "source": "cgtn",
        "date": "2025-09-05T02:06:25+09:00",
        "url": "https://news.cgtn.com/news/2025-09-05/China-s-V-Day-Parade-Sheds-Light-on-History-The-Unsung-Ally-Part-One-1GoQ6QbotfW/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0475907b77bc9642c5b58b25aa61daa5a7c435ab14188ad44ae4339df3f35208",
        "title": "Xi thanked foreign governments for WWII assistance: spokesperson",
        "summary": "Xi thanked foreign governments for WWII assistance: spokesperson",
        "source": "cgtn",
        "date": "2025-09-05T00:21:05+09:00",
        "url": "https://news.cgtn.com/news/2025-09-04/Xi-thanked-foreign-governments-for-WWII-assistance-spokesperson-1GoLz0yGiEU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    }
]