[
    {
        "id": "b5a9c8e2b42289f5d2d16f63f945f6776a6b8bf084fabefa2e51be0234fd0bb5",
        "title": "What is ‘winology’, the new theory about unfair Western views of China?",
        "summary": "China’s economic and technological advances are being unfairly dismissed in the United States and other parts of the West as a result of hierarchical thinking, according to a theory dubbed “winology” that is taking hold among some online commentators.\nThe term winology was coined by Chinese academics and refers to ways in which countries can both become a global leader in certain areas and be recognised as such.\nHowever, the theory argues that the West relegates China to the lowest tier of a...",
        "source": "smcp",
        "date": "2025-10-21T12:00:07+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3329673/what-winology-theory-about-unfair-western-views-china-sweeping-social-media?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "626e5373be85913a985bdb02d5143541dc45f8049eb5192d93c4bfb5590ac2b6",
        "title": "Chinese coastguard patrols reefs controlled by Vietnam in South China Sea",
        "summary": "The Chinese coastguard patrolled around disputed sites controlled by Vietnam in the South China Sea last week, vessel tracking information shows.\nThree patrol ships left a Chinese base on Mischief Reef in the Spratly Islands on Thursday and circled around a series of land features – some of which Vietnam has built facilities on – before returning to the reef on Saturday, according to Automatic Identification System data.\nThe purpose of the patrol by the coastguard vessels – identified by the...",
        "source": "smcp",
        "date": "2025-10-21T11:17:31+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329731/chinese-coastguard-patrols-disputed-reefs-controlled-vietnam-south-china-sea?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0b103c82b22f426999267f271ab8cf5b24fa45db8d72ea2bf475ee0afe5a49a5",
        "title": "How a single rule change sparked a major flare-up in US-China tensions",
        "summary": "When Beijing expanded its rare earth export controls earlier this month, it appeared to mark a fresh escalation in the US-China trade war. But for many observers, the dispute actually began over a week earlier – and its trigger was not a Chinese action, but an American one.\nThough it drew little fanfare at the time, the decision by the US Bureau of Industry and Security (BIS) to widen its trade blacklists in late September has had far-reaching effects. It not only pushed Beijing to take...",
        "source": "smcp",
        "date": "2025-10-21T09:00:14+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3329680/how-single-rule-change-sparked-major-flare-us-china-tensions?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "32232db49b6fe13610906ae6b77b607e211a7fe969fb77b9498785d0cc385fb5",
        "title": "CK Hutchison gets encouraging signs of a deal with Panama government",
        "summary": "A senior Panamanian official said on Monday that Panama will remain flexible and potentially reach an agreement with CK Hutchison as the Latin American country navigates the geopolitical rivalry between the United States and China.\n“We are working on a plan in case that [Panama’s Supreme Court] ruling goes against the extension of the contract” for CK Hutchison, said Jose Ramon Icaza, Panama’s minister of canal affairs.\n“In that case, we have to step in as the Panama Maritime Authority to take...",
        "source": "smcp",
        "date": "2025-10-21T07:39:00+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3329723/panama-ports-deal-ck-hutchison-gets-encouraging-signs-panamanian-government?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "de1cb4fd26dc88d56d5574bd15ac668fe718c970c46999bd88bfb79b8ba30d92",
        "title": "China AI plan offers hope for robot companions and kids by 2035",
        "summary": "When the Chinese government launched the “AI+” initiative in August, it was widely perceived as a new economic stimulus. However, observers may have underestimated Beijing’s true ambition.\nOn October 10, senior officials and experts published a series of analyses in the official journal E-Government, offering the public its first comprehensive look at the initiative’s deeper strategic intent.\nFar from being merely an economic policy, “AI+” is a decade-long national blueprint designed to propel...",
        "source": "smcp",
        "date": "2025-10-21T07:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329377/chinas-ai-plan-offers-citizens-infinite-hope-robot-companions-and-kids-2035?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "adcbb9b22f6ec5abdcb331cb460bd67d534abb2955db78ebb3cf4077a3b8ac61",
        "title": "To avert war, the West must shatter the mirror by which it views China",
        "summary": "In the shadow of escalating tensions between the United States and China, Graham Allison’s concept of the Thucydides Trap has become a staple of geopolitical discourse. Coined by the Harvard scholar, the term evokes the ancient Greek historian Thucydides’ observation that “it was the rise of Athens and the fear that this instilled in Sparta that made war inevitable”.\nAllison’s study of 16 historical cases, where a rising power challenged a ruling one, found war in 12 instances. He warns that...",
        "source": "smcp",
        "date": "2025-10-21T06:30:13+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3329612/avert-war-west-must-shatter-mirror-which-it-views-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7d9f3fc16c2cc3aa2877ce6d2267c6c687c2d88b2659e354fefefd0e94e43991",
        "title": "Trump downplays Beijing threat to Taiwan as Australia touts rare earths deal",
        "summary": "After nearly a year waiting to meet US President Donald Trump, Australian Prime Minister Anthony Albanese sought to argue his country’s strategic value Monday – only for the “America first” leader to dominate the encounter by opining that Beijing had no plans to invade Taiwan and posed no real threat in the Indo-Pacific.\n“China doesn’t want to do that,” he insisted on Taiwan, during a press gaggle alongside Albanese, later stating that the island will be one of the topics of discussion when he...",
        "source": "smcp",
        "date": "2025-10-21T03:01:12+09:00",
        "url": "https://www.scmp.com/news/china/article/3329717/trump-downplays-beijing-threat-taiwan-australia-touts-rare-earths-deal?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8458dd91c218b8c9da79be50b35d3613fbafdd129efa9b4b729b520b97de3ea2",
        "title": "3D printing trailblazer Chua Chee Kai relocates to China from Singapore hub",
        "summary": "Singaporean 3D printing pioneer Chua Chee Kai has joined Wuhan University of Science and Technology (WUST) as a full-time distinguished professor, receiving his appointment in a ceremony on October 10, according to the university’s website.\nFor decades, Chua led major 3D printing research initiatives in Singapore, helping to turn the country into a global hub for additive manufacturing technologies used in aerospace, biomedical and electronic applications.\nIn his remarks at the ceremony, Chua...",
        "source": "smcp",
        "date": "2025-10-20T23:00:08+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329692/3d-printing-trailblazer-chua-chee-kai-relocates-china-singapore-hub?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9dba7deb4beff5c4be9d140366419d6f13e9fc5aaa67640eab08542a6b716290",
        "title": "China doubles GenAI users, PLA ship near disputed shoal: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. China reports 4.8% quarterly GDP growth, moving closer to annual target\nChina’s economy grew 4.8 per cent year on year in the third quarter of 2025, keeping the country largely on track to achieve its full-year target, but analysts said further policy support is still needed to maintain this stable trajectory and improve domestic demand.\n2. China’s...",
        "source": "smcp",
        "date": "2025-10-20T22:15:08+09:00",
        "url": "https://www.scmp.com/news/china/article/3329699/chinas-genai-userbase-hits-515-million-fourth-plenum-kicks-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7c51f490c9a1521f9498a15189f118eac63eafe156b1f0e359893aead594cfb4",
        "title": "China’s soybean imports surge as orders to US hit zero and American farmers fret",
        "summary": "China imported no soybeans from the United States in September, but total imports remained at high levels amid a recent escalation in the US-China trade war, the latest Chinese customs data showed.\nLast month, the world’s largest food buyer purchased 12.8 million tonnes of soybeans – a crop heavily reliant on imports for its livestock industry – with a notable surge from Argentina during a brief suspension of export taxes, according to the detailed customs data released on Monday.\nThe absence of...",
        "source": "smcp",
        "date": "2025-10-20T22:00:17+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3329690/chinas-soybean-imports-surge-orders-us-hit-zero-and-south-america-cashing?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "dcb84e037a4f6fa1eaea81e1251fee852d576b5d988e2d0257fd55548a7d4748",
        "title": "Apple CEO Tim Cook pushes AI system launch in China after iPhone Air release",
        "summary": "Apple CEO Tim Cook is looking forward to launching the company’s artificial intelligence system in China, following the successful effort to release the iPhone Air in the vast market.\nCapping his six-day visit to the country last week, Cook said at an event in Shanghai on Saturday that AI was “making a difference in people’s lives” and that Apple was “working on getting [Apple Intelligence] into China right now”. No timeline was provided.\nApple Intelligence – a built-in AI feature of the...",
        "source": "smcp",
        "date": "2025-10-20T22:00:08+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3329686/apple-ceo-tim-cook-pushes-ai-system-launch-china-after-iphone-air-release?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0b64004d54db32646a95a16df604c11a66ef83041e01493cc51efefda016f159",
        "title": "‘Act of defiance’: China’s crude oil imports from Russia rise despite US pressure",
        "summary": "Russia remained China’s top crude oil supplier in September, at a time when the United States is stepping up pressure on major economies to curb their reliance on energy from the Eurasian country.\nImports from Russia rose 4.3 per cent in volume from August to 8.29 million tonnes in September, accounting for 17.5 per cent of China’s total crude imports, customs data showed – a sign of Beijing’s willingness to maintain trade links with Moscow despite geopolitical frictions.\nChinese purchases of US...",
        "source": "smcp",
        "date": "2025-10-20T21:30:18+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3329705/chinas-crude-oil-imports-russia-rise-september-despite-us-pressure?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "322921924744f243a2e9117ecf087284778d4008de671783bffe5399f81d5ba5",
        "title": "How China’s self-driving cars are shaping Europe’s tech sovereignty",
        "summary": "As global competition in autonomous driving intensifies, Europe has emerged as the latest frontier for China’s rapidly advancing self-driving technology. Start-ups such as Pony.ai, WeRide, AutoX, DeepRoute.ai, Momenta and Baidu’s Apollo Go are expanding their trials and partnerships across European cities, transforming Europe into the next stage of technological rivalry.\nWhat began as a domestic race to outpace US giants such as Waymo and Cruise has evolved into a transcontinental contest for...",
        "source": "smcp",
        "date": "2025-10-20T21:30:10+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3329619/how-chinas-self-driving-cars-are-shaping-europes-tech-sovereignty?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9847a036c2209da8807b3e6277c5c573a4c0b82149d4327a4abd5caf91c11d79",
        "title": "Taiwan sets out new rules outlining when troops can shoot down drones",
        "summary": "Taiwan has for the first time formally outlined the circumstances under which its troops can shoot down incoming drones.\nThe move is part of a broader effort by the island’s defence ministry to codify its rules of engagement and strengthen its ability to respond to mounting military pressure from mainland China.\nThe new procedures, disclosed in the recently released National Defence Report 2025, set out a four-step standard operating procedure – identification and monitoring, alert and...",
        "source": "smcp",
        "date": "2025-10-20T21:00:14+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3329698/taiwan-sets-out-new-rules-outlining-when-troops-can-shoot-down-drones?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "da5597c42b2bdf6f94612cd0a50ee53915a3da3081d8b65e8d31151534311a4a",
        "title": "China, Australia trade blame after PLA jet releases flares in mid-air encounter",
        "summary": "China and Australia exchanged accusations on Monday after an encounter over the disputed South China Sea, with the PLA’s Southern Theatre Command Air Force saying that it drove away a P-8A military aircraft that illegally intruded into Chinese airspace.\n“The People’s Liberation Army Southern Theatre Command organised naval and air forces to track and monitor the intruder in accordance with regulations, implement effective countermeasures, and issue warnings to drive it away,” Senior Colonel Li...",
        "source": "smcp",
        "date": "2025-10-20T20:06:02+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3329696/china-australia-trade-blame-after-pla-jet-releases-flares-mid-air-encounter?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5c0ed979c6c0bb83c3456d0742ca0b6a5d74aef77bf27d21e0cc4d02b848351a",
        "title": "Chinese loans fuel Angola’s future cities but analysts cautious over the costs",
        "summary": "Since nearly three decades of civil war ended in 2002, Angola has been relying heavily on China – its key financier of post-war infrastructure – to help the southern African country’s government deliver on its promise of a million new homes.\nWhen the West was unwilling to finance its projects, Luanda secured loans from Chinese state banks under the so-called Angolan model, using its oil as collateral.\nAngola became the largest recipient of Chinese financing in Africa, attracting 270 loans worth...",
        "source": "smcp",
        "date": "2025-10-20T19:00:16+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329665/chinese-loans-fuel-angolas-future-cities-analysts-cautious-over-costs?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7017641e3f6637f729540808cca38479ea71d00ce963d39302e0bcc74de64d3c",
        "title": "China’s Communist Party kicks off fourth plenum amid tight security in Beijing",
        "summary": "China’s ruling Communist Party kicked off a key four-day conclave on Monday that will determine the country’s development over the next five years.\nThe fourth plenum of the party’s Central Committee began on Monday morning, according to state news agency Xinhua.\nParty General Secretary Xi Jinping, who is also the nation’s president, delivered a work report to the meeting and outlined the party’s proposals for the next five-year plan, which will be submitted for deliberation, a brief report said...",
        "source": "smcp",
        "date": "2025-10-20T16:30:36+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3329656/chinas-communist-party-kicks-fourth-plenum-amid-tightened-security-beijing?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "75de36d0cdd427b644faa204f47288af069a0638c623630279a3f2e95437bea5",
        "title": "China’s Akeso gets share boost as data shows cancer drug’s benefits",
        "summary": "Shares of Chinese drug firm Akeso – likened by some Western media outlets to artificial intelligence start-up DeepSeek – rose after the company unveiled clinical-trial data showing that its lung-cancer drug outperformed a highly effective existing treatment.\nThe data showed that ivonescimab had “a decisive and strong positive outcome with both significant and clinically meaningful benefits”, Akeso said in a filing with the Hong Kong stock exchange on Monday. The drug, used along with...",
        "source": "smcp",
        "date": "2025-10-20T16:00:12+09:00",
        "url": "https://www.scmp.com/business/article/3329639/chinas-akeso-dubbed-biotechs-deepseek-gets-share-boost-cancer-drug-trial-data?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2b54290e4813ba549a59626b1f0bd36023d156d66877be342ea38fb9d0954646",
        "title": "Apple’s new iPhone 17 outsells previous generation by 14% in US, China",
        "summary": "Apple’s latest generation of iPhones is off to a faster start than usual, with its most basic model surging in popularity in the US and China.\nThe iPhone 17 series outsold the iPhone 16 range by 14 per cent over their respective first 10 days on sale in the US and China, according to Counterpoint Research.\nThe data, giving the first quantified indication of consumer response in Apple’s top two markets, shows the standard iPhone 17 is in much higher demand than the corresponding US$799 model last...",
        "source": "smcp",
        "date": "2025-10-20T15:15:04+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3329640/apples-new-iphone-17-outsells-previous-generation-14-us-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bc4b097a84c90688180bd0eb5e4a36832c4780af7dc757f662fbc50139ef4a7d",
        "title": "Chinese scientists caught neurons ‘kissing’ each other with cutting-edge tech",
        "summary": "Chinese scientists have captured the “kiss-shrink-run” process of neuronal communication using the world’s first camera with nanometre resolution and a millisecond-scale imaging speed.\nThis cutting-edge cryogenic electron microscopy development enables the team to freeze moments of neurotransmission in time and clearly observe the complete dynamic process of the synaptic vesicle – a tiny, membrane-bound sac in a neuron that stores neurotransmitters.\nTheir findings have also helped to resolve a...",
        "source": "smcp",
        "date": "2025-10-20T14:03:39+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329406/chinese-scientists-caught-neurons-kissing-each-other-cutting-edge-tech?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a2218de16c73dcb7192a53acffd3d1809b8aa5c1b18a793d6f39f6324609fc4a",
        "title": "Chinese scientists discover secret to healthy ageing in naked mole-rat DNA",
        "summary": "The remarkable longevity and disease resistance of naked mole rats are linked to a version of a protein involved in DNA repair that is also found in humans, Chinese scientists have discovered.\nThe team led by researchers from Shanghai’s Tongji University found that introducing this modified protein in flies and mice reduced the genetic damage associated with ageing and helped to extend lifespan, according to results of their study published earlier this month.\nTheir findings suggest that the...",
        "source": "smcp",
        "date": "2025-10-20T13:00:12+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329579/live-long-and-prosper-chinese-scientists-find-age-well-protein-naked-mole-rats?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ab4aa5f7d225b618e514d91bd61b6026105e11645dff848690dd19044b029711",
        "title": "China reports 4.8% quarterly GDP growth, moving closer to annual target",
        "summary": "China’s economy grew 4.8 per cent year on year in the third quarter of 2025, keeping the country largely on track to achieve its full-year target, but analysts said further policy support is still needed to maintain this stable trajectory and improve domestic demand.\nThe closely watched figure for gross domestic product, released by the National Bureau of Statistics (NBS) on Monday, came in just above the 4.76 per cent forecast in a survey of economists by Chinese financial data provider...",
        "source": "smcp",
        "date": "2025-10-20T11:03:24+09:00",
        "url": "https://www.scmp.com/economy/economic-indicators/article/3329606/china-reports-48-quarterly-gdp-growth-moving-closer-annual-target?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "911b04851bed6854c18764ac156ac500c16ef8c24cf9bc3ed1a9584ba8ec6b49",
        "title": "PLA tanker ‘spotted resupplying coastguard vessel’ near Scarborough Shoal",
        "summary": "The PLA Navy replenishment ship Qinghaihu was reportedly seen resupplying a China Coast Guard vessel near the disputed Scarborough Shoal last week.\nThe manoeuvre highlights growing coordination between China’s naval and coastguard forces amid heightened tensions with the Philippines in the contested South China Sea.\nAccording to a report by Manila-based ABS-CBN news, two Chinese navy warships and four coastguard vessels, as well as several Chinese maritime militia vessels, were monitored by the...",
        "source": "smcp",
        "date": "2025-10-20T10:00:21+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3329573/pla-navy-tanker-spotted-china-coast-guard-resupply-mission-near-scarborough-shoal?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ab1cb7628d7af653d2fbfa2eea3024d3c2e3bf696dcf21c4307716dd4135eb91",
        "title": "Liu Qian on Chinese innovation, the US rivalry and women holding up half the sky",
        "summary": "Liu Qian is the founder of Wusawa Advisory and formerly the managing director of The Economist Group in Greater China. She is also a prominent advocate for gender equality, and the only Chinese representative in the core working group of the UN Women Leaders Network. In this interview, she discusses how Chinese innovation differs from Western innovation, where the US-China rivalry is headed and the critical role of women’s voices in policymaking.\nThis interview first appeared in SCMP Plus. For...",
        "source": "smcp",
        "date": "2025-10-20T07:00:16+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3329426/liu-qian-chinese-innovation-us-rivalry-and-women-holding-half-sky?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9d71de7904ba4c15689cd7f305f012b6deb9121315bc492cce006e193ec31f20",
        "title": "Will today’s great powers heed the example of Richard Nixon and Zhou Enlai?",
        "summary": "When Germany emerged as Europe’s industrial powerhouse in the 19th century, the established powers spent years attempting to contain it, culminating in a war no serious statesman desired, yet none proved skilful enough to prevent. Today, as we navigate the transition from American unipolarity, a similar question looms: will this shift follow that tragic pattern, or can it be managed through institutional adaptation as Zhou Enlai and Richard Nixon did in the early 1970s?\nThe multipolar order is...",
        "source": "smcp",
        "date": "2025-10-20T06:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3329275/will-todays-great-powers-heed-example-richard-nixon-and-zhou-enlai?utm_source=rss_feed",
        "reportUrl": ""
    }
]