[
    {
        "id": "f02ada74df41de14a2da7f95c5f738629309d00435081fc3fa02251fad2363c1",
        "title": "‘Rational optimist’: sci-fi writer Liu Cixin on why he’ll be happy if AI surpasses humans",
        "summary": "Liu Cixin is the most influential contemporary science fiction writer in China. He is best known for his trilogy that starts with The Three-Body Problem, for which he won a Hugo Award for best novel in 2015. The trilogy earned international acclaim and has been adapted for television in both Chinese and English.\nBorn in 1963 and raised in Shanxi, Liu started his working life as a computer engineer at a power plant in the central province. Inspired by British sci-fi author Arthur C. Clarke, Liu...",
        "source": "smcp",
        "date": "2025-12-15T07:00:19+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3336312/rational-optimist-sci-fi-writer-liu-cixin-why-hell-be-happy-if-ai-surpasses-humans?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3493e4adb97d78326fe28738fb0feaade00f2f6a61e79669773cd132640e0795",
        "title": "How China’s US$150,000 robotic start-up beat Tesla boss Elon Musk in 2 years",
        "summary": "The odds seemed impossible: a shoestring Chinese start-up founded in 2023 with just 1 million yuan (US$142,000) taking on Elon Musk – tech legend, disrupter in space and CEO of Tesla – who is valued at half a trillion dollars.\nBut in less than two years, EngineAI Robotics, led by CEO Zhao Tongyang, created the T800 – a robot that delivers Bruce Lee-style roundhouse kicks with the force of a small car – and, under the instruction of smiling engineers and scientists, tried it first on the boss...",
        "source": "smcp",
        "date": "2025-12-14T23:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3336182/how-chinas-us150000-robotic-start-beat-tesla-boss-elon-musk-2-years?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a90249197eabede72c966eafbfb8c612028dd203fac18f8b0d715bd070156b4b",
        "title": "Why has reference to Taiwan attending Rimpac been removed from US defence bill?",
        "summary": "A proposal to invite Taiwan to next year’s US-led Rim of the Pacific (Rimpac) military exercises has been removed from defence policy legislation progressing through Congress, raising concerns in Taipei that Washington’s political calculus may be shifting.\nSome analysts have warned that the removal of language approved by the US Senate in the 2026 National Defence Authorisation Act (NDAA) could even pave the way for Beijing’s return to the world’s largest naval exercise.\nFor the first time, the...",
        "source": "smcp",
        "date": "2025-12-14T21:40:02+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3336217/why-has-reference-taiwan-attending-rimpac-been-removed-us-defence-bill?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "350e2d996140c1df57b63a2cb3f1dd5394104d6cfc7ad7f41ac18e61b656d806",
        "title": "US is rewriting its China policy under national security strategy",
        "summary": "The recently released US National Security Strategy (NSS) marks a sharp geographic and political turn. It moves the western hemisphere to the top of the agenda and pushes Asia – and with it, visible China-centric “great power competition” – down a notch.\nThis does not mean China no longer matters. Rather, it means Washington now sees China partly through the lens of what it is doing in the Americas instead of only what it is doing in the Indo-Pacific.\nThis shift is not accidental. It is a...",
        "source": "smcp",
        "date": "2025-12-14T21:30:10+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3336186/us-rewriting-its-china-policy-under-national-security-strategy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "dcfc545a248ad444dea05f7f7a75e040679f9f9204c453f554fe474c5e55c338",
        "title": "China orders local governments to settle company bills by end of year",
        "summary": "China has set a deadline for local governments to settle outstanding payments owed to companies, calling it essential for improving the country’s business environment amid an economic slowdown.\nAll arrears below 500,000 yuan (US$70,870) must be cleared by the end of the year, said Xiao Weiming, deputy secretary general of the National Development and Reform Commission, the country’s top economic planner.\n“The biggest step in improving the business environment right now is clearing the...",
        "source": "smcp",
        "date": "2025-12-14T20:49:59+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3336395/china-orders-local-governments-settle-bills-companies-year-end?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ddbde70e86c04efb08ca01a5cd149ddb08fe0a9c428eec3699716f75835974f0",
        "title": "Reporter’s notebook: home test kit takes headache out of Beijing healthcare",
        "summary": "When I woke up with a sore throat and fever in Beijing earlier this month, the last thing I wanted to do was go to a hospital.\nEven though the nearest public facility is just a 15-minute walk from my flat, I didn’t have the energy to leave my bed, let alone endure the long queues, crowds and cumbersome procedures that come with a hospital visit. In fact, I suspected I had contracted the virus that was causing my symptoms from a trip to that very hospital four days earlier, as it was the only...",
        "source": "smcp",
        "date": "2025-12-14T20:00:10+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3336227/reporters-notebook-home-test-kit-takes-headache-out-beijing-healthcare?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e0f802bf1dda4c4633457251f6dbf00314c22c25876c9950f1bb612c7c5a5dc9",
        "title": "How will China respond to latest West Africa coup as economic footprint expands?",
        "summary": "Just days after Chinese ambassador Yang Renhuo met Guinea-Bissau’s President Umaro Sissoco Embalo to donate airport security inspection equipment, the West African nation was hit by a military coup that ousted Embalo.\nThe November 26 coup marked yet another military takeover along Africa’s “coup belt”, adding Guinea-Bissau to nations like Mali, Burkina Faso, Guinea, Niger and Gabon that had recently seen leaders toppled.\nThe political turmoil has raised the stakes for China’s vast economic...",
        "source": "smcp",
        "date": "2025-12-14T19:35:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3336160/how-will-china-respond-latest-west-africa-coup-economic-footprint-expands?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5aeb765247259db33ceefc14c90fcf3aea47b6f75143cb5a1ecd692a1ec7463d",
        "title": "China to fully cover childbirth costs for all as fertility crisis sparks economic alarm",
        "summary": "China will expand its national healthcare insurance programme next year to fully cover all out-of-pocket expenses related to childbirth, according to state media reports.\nIt is the country’s latest bid to lift birth rates and avert a looming demographic crisis that threatens to undermine long-term growth prospects.\nThe pledge to widen the medical insurance coverage was unveiled at a national healthcare security conference in Beijing on Saturday, state news agency Xinhua reported.\nAccording to a...",
        "source": "smcp",
        "date": "2025-12-14T18:00:18+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3336383/china-fully-cover-childbirth-costs-all-fertility-crisis-sparks-economic-alarm?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "de72b9c9b47acbb79d1706bd30dcfe3f138b438a2cb6bb5801bba1e09ea29213",
        "title": "Sales of high-end cars tumble in China as affordable local brands trump European marques",
        "summary": "Chinese demand for foreign luxury cars is waning as customers opt for more affordable Chinese brand models, often sold at big discounts, catering to their taste for fancy electronics and comfort.\nThat is bad news for European carmakers like Porsche, Aston Martin, Mercedes-Benz and BMW that have long dominated the upper reaches of the world’s largest auto market.\nA prolonged property downturn in China has left many consumers with little appetite for big purchases. Meanwhile, the well-to-do are...",
        "source": "smcp",
        "date": "2025-12-14T16:22:53+09:00",
        "url": "https://www.scmp.com/business/companies/article/3336375/sales-high-end-cars-tumble-china-affordable-local-brands-trump-european-marques?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d2ecdd52712850b35aafe3de67a70f996ab127d53d1c5c11e9ce80f69832deff",
        "title": "China tourism: cold spots are hot tickets as southern residents head north to ski",
        "summary": "With temperatures falling and holidays approaching, ski resorts across northern China are experiencing a surge in visitors from the south, a trend that is cheering airlines as well as resort operators including Malaysia-based Genting Group.\nSince the ski season opened on November 15, the Changbai Beautiful China Resort in the northeast province of Jilin, a complex owned by China Green Development Group, has welcomed more than 110,000 visitors, marking a nearly 40 per cent year-on-year increase....",
        "source": "smcp",
        "date": "2025-12-14T13:30:10+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3336257/china-tourism-cold-spots-are-hot-tickets-southern-residents-head-north-ski?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "51868ec0e610f7e0e5cd2e3d356347f60aca0d8f24f81694fea8d16028e2dd4b",
        "title": "Is the US pushing South Korea to the fore in deterring a war over Taiwan?",
        "summary": "Mounting US pressure on allies to bolster the first island chain’s defence in the western Pacific Ocean is raising concerns about South Korea’s possible but reluctant involvement in a conflict over Taiwan, analysts have said.\nIn its recently released National Security Strategy (NSS), US President Donald Trump’s administration highlighted the importance of a “favourable conventional military balance” as an “essential component of strategic competition”, focusing on deterring conflict over Taiwan...",
        "source": "smcp",
        "date": "2025-12-14T13:00:22+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3336351/us-pushing-south-korea-fore-deterring-war-over-taiwan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e0b14b97170dae5ebee7b693951c2e19fc166df199cfa383c731f37aeceb9cdb",
        "title": "Soft power – hard work: can China harness social media apps to rewire its global image?",
        "summary": "Mary Roettger was just one of millions of Americans seeking a social media life raft when she warily logged onto China’s RedNote platform for the first time in January.\nAs fears loomed over a threatened US ban on TikTok, the Florida writer braced for a clumsy, spam-filled experience full of “negative people”.\nInstead, she was struck by a starkly different culture. Roettger was “blown away with the amount of tenderness and excitement” of the online community suddenly before her.\n“That was new,”...",
        "source": "smcp",
        "date": "2025-12-14T12:10:47+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335401/soft-power-hard-work-can-china-harness-social-media-apps-rewire-its-global-image?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b637e678748b634bd39e5f7363ccce12f0afd12e1013f43c6ae63f17d993e221",
        "title": "China’s growing young billionaire class masks innovation hurdles, analysts say",
        "summary": "While China continues to produce many young self-made billionaires, showcasing its economic dynamism, observers have urged the creation of a more supportive environment, saying that innovation is still being held back.\nAbout 98 per cent of the super-rich in mainland China, with assets valued at US$1 billion or more, are relatively young first-generation entrepreneurs, reflecting the vitality and wealth-creation power of its economy, Swiss bank UBS said in a recent report.\nHowever, Beijing’s...",
        "source": "smcp",
        "date": "2025-12-14T12:00:17+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3336231/chinas-growing-young-billionaire-class-masks-innovation-hurdles-analysts-say?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e99115becefb029a7f2db069862cfbee68b04b97cd59aa50b4e4e0772e7477a4",
        "title": "Virtual reality and the Nanking massacre: where does historical immersion become trauma?",
        "summary": "In October, as Simon Li finished speaking at an international conference about embracing technological innovation in education, several Chinese history educators approached him with a potent, pressing question: could a virtual reality (VR) project about the 1937 Nanking massacre become the next pedagogical frontier?\nLi, executive director of the Hong Kong Holocaust and Tolerance Centre, recalled it as an electrifying moment. “They were genuinely energised, saying that such a programme could help...",
        "source": "smcp",
        "date": "2025-12-14T11:00:15+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3336345/virtual-reality-and-nanking-massacre-where-does-historical-immersion-become-trauma?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9582eff9d1c76c1aebc2ee762423513582c94d2f857e350a62cc643a2d69a3a3",
        "title": "China narrows AI gap with US 3 years after initial ChatGPT shock",
        "summary": "US start-up OpenAI’s launch of ChatGPT on November 30, three years ago, sent China’s technology industry scrambling to get up to speed on the latest artificial intelligence developments.\nChinese government authorities sent urgent requests to various experts, including professors from Tsinghua University, to provide briefings on the implications of generative AI technology, according to people with knowledge of the matter.\nChina’s Big Tech firms and ambitious start-ups rushed to roll out their...",
        "source": "smcp",
        "date": "2025-12-14T00:00:09+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3336236/sea-change-china-narrows-ai-gap-us-three-years-after-initial-shock-chatgpt?utm_source=rss_feed",
        "reportUrl": ""
    }
]