[
    {
        "id": "e51049c938f23e79b427ed7b65814e623b63bbbb3d12bd30c4c2e14ed99faa04",
        "title": "AI models from US and China flatter users too much, study finds",
        "summary": "Leading artificial intelligence models from the United States and China are “highly sycophantic”, and their excessive flattery may make users less likely to repair interpersonal conflicts, a new study has found.\nThe study by researchers at Stanford University and Carnegie Mellon University published earlier this month tested how 11 large language models (LLMs) responded to user queries seeking advice on personal matters, including cases involving manipulation and deception.\nIn AI circles,...",
        "source": "smcp",
        "date": "2025-10-31T08:00:11+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3330922/ai-models-chinas-deepseek-alibaba-and-us-flatter-users-too-much-study-finds?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3f2e14b4f08251c18ff36645e65d58839e14b9dbed58d42db24078250ef00e60",
        "title": "Xi and Trump’s high-stakes meeting in South Korea: everything you need to know",
        "summary": "1. Trump hails ‘great success’ as Xi talks raise hopes of easing US-China tensions\nChina and the United States have reached a truce on thorny issues ranging from soybeans and rare earths to fentanyl, following Thursday’s meeting between Presidents Xi Jinping and Donald Trump.\n2. ‘Amazing’ Xi-Trump summit, as it happened – deals struck as trade war thaws\nCatch up on our live coverage of Xi and Trump’s first in-person meeting since the latter’s return to the White House.\n3. 5 takeaways from the...",
        "source": "smcp",
        "date": "2025-10-31T07:11:58+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330950/xi-and-trumps-high-stakes-meeting-south-korea-everything-you-need-know?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4af3674b3e8dc7b197824f2c2088f78984ad1ca358d15dbc35ce068805901ca2",
        "title": "Brazil shrugs off US-China soybean deal as seasonal trade",
        "summary": "Brazil’s soybean producers are downplaying concerns over a freshly minted US-China trade agreement that will see Beijing resume large-scale purchases of American soybeans, insisting the 12 million tonnes (13.23 million tons) pledged represents routine seasonal trade rather than a market upheaval.\nMauricio Buffon, president of Brazil’s Soybean Producers Association (Aprosoja), said the volume announced by Washington and Beijing on Wednesday should not alarm Brazilian exporters, framing it as part...",
        "source": "smcp",
        "date": "2025-10-31T01:31:34+09:00",
        "url": "https://www.scmp.com/news/china/article/3330968/brazil-shrugs-us-china-soybean-deal-seasonal-trade?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "51bda3ca4c3319636de665b7b0c36b19b8f20b3deaaf5b0e9d42005bd9936dd0",
        "title": "What does the Xi-Trump summit’s silence on Taiwan mean?",
        "summary": "In a stark departure from past China-US summits, Taiwan did not rate a mention on Thursday, prompting speculation that Xi Jinping and Donald Trump had arrived at a tacit and pragmatic understanding to deprioritise the contentious issue.\nTaiwan – regarded by Beijing as a core interest and “the first red line that cannot be crossed” in bilateral relations – has in recent years occupied a few lines in official readouts following face-to-face meetings between the countries’ leaders, but not in...",
        "source": "smcp",
        "date": "2025-10-31T00:00:10+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3330958/what-does-xi-trump-summits-silence-taiwan-mean-contentious-issue?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f0585647e53b7e11fad78b69fecaaf6771a7ea2707c980ad3cb5d4c24a6b17df",
        "title": "Xi-Trump summit yields wins for both China and US despite lack of breakthroughs",
        "summary": "The first in-person summit between Chinese and American leaders since US President Donald Trump’s return to office marked a symbolic reset in the balance of power between the two rivals, yielding a time-bound agreement to pause escalation in their intensifying trade conflict.\nFrom freezing new tariffs and rare earth export controls to resuming key US agricultural exports and pledging cooperation on Ukraine, both sides achieved tactical de-escalation in the Thursday meeting, allowing each to...",
        "source": "smcp",
        "date": "2025-10-30T23:37:21+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330960/xi-trump-summit-yields-wins-both-china-and-us-despite-lack-breakthroughs?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c1691568518be916aea9f973bda39500d2dbacbd1ea0ded5c23ae13451010552",
        "title": "Trump-Xi meeting closer to truce than durable peace, China seen looking stronger",
        "summary": "After months of threats, chest-thumping and uncertainty, the world breathed a collective sigh of relief on Thursday after a meeting between US President Donald Trump and Chinese President Xi Jinping teased at least temporary relief on a host of bilateral trade irritants.\nEven as Trump gained headlines and short-term “wins” involving soy purchases and fentanyl ingredients, analysts said Xi gained ground in some more fundamental areas – including recognition of its rare-earth leverage and some...",
        "source": "smcp",
        "date": "2025-10-30T23:24:52+09:00",
        "url": "https://www.scmp.com/news/china/article/3330959/trump-xi-strike-truce-soybean-deal-and-tiktok-nod-bessent?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4548adb532c0488539c63457bf126a06bebfc9a3c4bd91bf3a94dacc1dee9323",
        "title": "Dutch seizure of Nexperia faces uncertainty after Xi-Trump summit",
        "summary": "The Dutch government is under renewed pressure to end its seizure of the Chinese-owned, Netherlands-based semiconductor company Nexperia, after Washington agreed to suspend its updated export control rule for one year.\nAfter a meeting between Chinese President Xi Jinping and his US counterpart Donald Trump on Thursday, China’s Ministry of Commerce said Washington would temporarily halt the implementation of its so-called 50 per cent subsidiary rule.\nIntroduced in late September, that rule...",
        "source": "smcp",
        "date": "2025-10-30T23:00:34+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3330953/netherlands-faces-pressure-surrender-control-nexperia-after-xi-trump-summit?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3820483d1c01d5f27b600c7a93c7cc2376c0cf6a00be8d7cf785c50f6160b251",
        "title": "Xi and Trump strike a deal, Harvard scientist joins Wuhan virus lab: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. ‘Amazing’ Xi-Trump summit, as it happened – deals struck as trade war thaws\nChinese President Xi Jinping has held talks with his American counterpart Donald Trump, their first in-person meeting since Trump’s return to the White House, as the rivals seek to manage heightened tensions, particularly over trade.\n2. ‘Positive step’: cautious relief as China...",
        "source": "smcp",
        "date": "2025-10-30T22:15:07+09:00",
        "url": "https://www.scmp.com/news/china/article/3330942/xi-and-trump-strike-deal-harvard-scientist-joins-wuhan-virus-lab-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ee58916ef9a157c17c4fc31d71087434eb0277c7448e6e1fc911ea0976aa8a23",
        "title": "After Xi-Trump talks, lack of a chip deal seen as tech-independence issue",
        "summary": "Amid the apparent absence of a concrete deal being reached with Washington on one of Beijing’s long-standing points of trade contention – export controls on the most advanced semiconductors – analysts say it reflects China’s increasing resolve to become more independent from the US.\nAfter a meeting with President Xi Jinping in South Korea on Thursday morning, US President Donald Trump said the two sides “did discuss chips”.\n“China is going to be talking to Nvidia and others about taking chips …...",
        "source": "smcp",
        "date": "2025-10-30T22:00:10+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3330932/after-xi-trump-talks-lack-semiconductor-deal-seen-tech-independence-issue?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4f114cd7e3624baf93202a49b46c9671da1899b959098fa5de5fab6dab4e9cda",
        "title": "Trump hails ‘great success’ as Xi talks raise hopes of easing US-China tensions",
        "summary": "China and the United States have agreed to de-escalate their trade war, putting a pause on many thorny issues while making breakthroughs on soybean purchases and fentanyl tariffs.\nUS President Donald Trump hailed the meeting with President Xi Jinping at the Gimhae Air Base in Busan, South Korea, as a “great success”.\nHe confirmed he would visit China in April, adding that Xi would reciprocate with a trip to the US “some time after that”.\nThursday’s summit may help the two countries’ relationship...",
        "source": "smcp",
        "date": "2025-10-30T21:00:25+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330939/trump-hails-great-success-after-xi-talks-raise-hopes-easing-us-china-tensions?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "08e69f9b0a10ba6ab43950b1287a00e85642a3f166bf8e11967f11ee81311482",
        "title": "Shenzhen police busts syndicate selling fake Infineon, Texas Instruments chips",
        "summary": "Police in Shenzhen, the technology hub in southern China’s Guangdong province, have smashed a syndicate selling counterfeit imported chips to mainland manufacturers, according to local media, exposing an underground market for high-end semiconductors amid US export controls.\nThe syndicate’s modus operandi was to collect discarded chips, which were laser-polished and relabelled, and sold as imported products from Infineon Technologies, Texas Instruments and Analog Devices, according to a report...",
        "source": "smcp",
        "date": "2025-10-30T21:00:14+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3330921/shenzhen-police-busts-syndicate-selling-counterfeit-infineon-and-texas-instruments-chips?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4a31557525ea1014565b44429a2f40f9d9d62f370b081e8affb67dedc41b72b8",
        "title": "‘Amazing’ praise: Xi and Trump thaw summit ice with loads of warmth",
        "summary": "With smiles, firm handshakes and warm gestures, Chinese President Xi Jinping and his US counterpart Donald Trump set a cordial, friendly tone before their historic summit. More than an hour and a half later, they emerged from their first face-to-face encounter in six years with the same genial manner.\nIn front of reporters before the meeting in Busan, South Korea, a grinning Trump said “Good to see you again” as the two leaders shook hands. “Me too,” Xi replied through an interpreter.\nTrump...",
        "source": "smcp",
        "date": "2025-10-30T20:19:06+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330929/charm-whispers-and-pats-back-xi-and-trump-break-summit-ice-loads-warmth?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "344ac4ec121f03b45fe9a341cc2eca9da3b5a221f63ee29731621d707e7cbfb7",
        "title": "China’s civil service exam sees record-breaking applicant pool after age range expansion",
        "summary": "About 3.7 million candidates have been approved to take China’s coming national public service exam, according to official figures – a record-breaking applicant pool, and the first since Beijing expanded the age limit for entry into the country's civil sector, where jobs are known as “iron rice bowls” for their comparatively high level of security.\nWith 38,100 vacancies available at central government agencies and their affiliated institutions nationwide, the competition is fierce, translating...",
        "source": "smcp",
        "date": "2025-10-30T20:00:10+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330898/record-37-million-approved-chinas-civil-service-exam-race-iron-rice-bowl?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0f1f66e3f72f1669c2b1d8a4db55aa042ea9f61146b3c7a7e007f4e641b12c3a",
        "title": "South Korea’s Lee urges ‘friendly competition’ with China ahead of Xi meeting",
        "summary": "South Korean President Lee Jae-myung said Seoul aimed to work with Beijing to advance practical cooperation in trade, supply chains and people-to-people exchanges to improve ties based on “friendly competition” and “equal cooperation”.\nLee made the remarks in an interview with China’s state-run Xinhua news agency published a day ahead of Chinese President Xi Jinping’s arrival in the South Korean city of Busan on Thursday. This marks Xi’s first visit to South Korea in 11 years, following his last...",
        "source": "smcp",
        "date": "2025-10-30T19:12:56+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330917/south-koreas-lee-calls-friendly-competition-china-ahead-xi-meeting?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f15a64655d1e4447b265f3aa2682a2abf92b54fc9990e95df0a77093c7f20730",
        "title": "In 2015, China announces end to one-child policy – from the SCMP archive",
        "summary": "This article was first published on October 29, 2015\nby Cary Huang\nChina puts an end to its one-child policy\nThe main­land will abol­ish its dec­ades-old, con­tro­ver­sial one-child policy and allow all couples to have two chil­dren, Com­mun­ist Party lead­ers said on October 29, 2015 after they wrapped up a four-day annual poli­cy­mak­ing meeting.\nThe fifth plenum of the party’s 18th Cent­ral Com­mit­tee also endorsed a new five-year eco­nomic plan, accord­ing to a communique released by...",
        "source": "smcp",
        "date": "2025-10-30T18:36:43+09:00",
        "url": "https://www.scmp.com/news/china/article/3330863/2015-china-announces-end-one-child-policy-scmp-archive?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "279e7be3c5c3f931f729086bb21e67d370b48414e63f94b8ddecc6bd23c39bf1",
        "title": "China’s US soybean buys bring relief to farmers, but permanent deal elusive",
        "summary": "While China’s resumption of US soybean purchases has brought relief to American farmers – who spent months worried their largest buyer may never return – analysts said they expected the trade of agricultural products to become a regular part of bilateral negotiations in the coming years.\nUS President Donald Trump said aboard Air Force One that “tremendous amounts of the soybeans and other farm products are going to be purchased immediately”, after a meeting with President Xi Jinping in South...",
        "source": "smcp",
        "date": "2025-10-30T18:31:46+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3330907/us-china-soybean-deal-signals-yearly-negotiations-farmers-hope-steady-trade?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4cdf3cd872713c9aee0a24da4fca439b6ffb6aa0a734c9dafc8e380201ee2d2a",
        "title": "Ultra-rich families focus on impact ‘across generations’ in legacy planning",
        "summary": "Ultra-high-net-worth (UHNW) families are putting greater focus on legacy planning to create sustainable impact for future generations amid growing uncertainty and vast fortunes shifting to younger heirs, according to participants in a Standard Chartered event in Dubai focused on family offices.\nThe emphasis among such families was changing from wealth preservation towards a strategic repositioning of family-office locations, governance structures, succession planning and decision-making,...",
        "source": "smcp",
        "date": "2025-10-30T17:58:55+09:00",
        "url": "https://www.scmp.com/business/money/wealth/article/3330897/ultra-rich-families-focus-driving-impact-across-generations-legacy-planning?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "dd5aaf4a95ec75d970fa568a20625f2ea5cc46b8944422bf6e679e74c4cb6134",
        "title": "China’s Meituan eyes US$3 billion from bond issue as competition heats up",
        "summary": "Meituan expects to raise US$3 billion from a dual-currency bond offering, as the Chinese on-demand delivery giant looks to bolster its war chest to stave off the challenge from rivals led by Alibaba Group Holding and JD.com.\nThe Beijing-based company will offer US$1.99 billion in greenback-denominated bonds and 7.08 billion yuan (US$1 billion) of notes in the local currency, according to its statement to the Hong Kong stock exchange on Wednesday.\nMeituan said it had signed an agreement with...",
        "source": "smcp",
        "date": "2025-10-30T17:56:29+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3330895/chinese-delivery-giant-meituan-eyes-us3-billion-bond-issue-amid-intense-competition?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a6d56633973a2b63f45247424e3dbacdf1fc4c5f708cadb11a93c7b674abdb1e",
        "title": "‘Fancy tool’: how China cut chip defects by 99% for near-perfect lithography",
        "summary": "In a major leap for the global semiconductor industry, a joint Chinese research team has developed a method that can slash defects in lithography – a critical step in chipmaking – by up to 99 per cent.\nThe researchers achieved unprecedented clarity by using cryo-electron tomography (cryo-ET) to pinpoint, for the first time, the minute sources of common manufacturing flaws.\nThe findings, published in the journal Nature Communications on September 30, by Professor Peng Hailin from Peking...",
        "source": "smcp",
        "date": "2025-10-30T17:10:20+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330869/how-chinas-fancy-tool-cut-chip-defects-99-near-perfect-lithography?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1a94c5808db8b9cb8b8bf17b5db8aa217d4343b19cf177996aee70bdb8b49642",
        "title": "5 takeaways from the Xi-Trump summit in South Korea",
        "summary": "The high-stakes summit between Chinese President Xi Jinping and his US counterpart, Donald Trump, took place in Busan, South Korea, on Thursday and lasted 100 minutes. It marked their first in-person meeting since Trump returned to the White House for his second presidential term, having last met in 2019.\n1. Personal warmth on display\nThe two exchanged cordial greetings and praised each other.\nTrump called Xi his “friend”, describing Xi as a “very distinguished and respected president” and “a...",
        "source": "smcp",
        "date": "2025-10-30T16:27:53+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330879/5-takeaways-xi-trump-summit-south-korea?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f85d4ec0b8fb610cc406e9ef0ce7cd5f7daa1253223d33a3fe26f31e872902f6",
        "title": "Chinese EV maker BYD’s sales surge in Europe, narrowing gap with Tesla",
        "summary": "Chinese electric vehicle (EV) maker BYD recorded surging sales in Europe last month after it launched more models and expanded its sales network, narrowing its gap with market leader Tesla.\nThe Shenzhen-based carmaker racked up 24,963 new-car registrations in Europe in September, nearly five times its deliveries of 5,013 units a year ago, according to data from the European Automobile Manufacturers Association, known as the ACEA. The association tracks vehicle sales across the European Union,...",
        "source": "smcp",
        "date": "2025-10-30T16:02:25+09:00",
        "url": "https://www.scmp.com/business/china-evs/article/3330873/chinese-ev-maker-byds-sales-surge-europe-narrowing-gap-market-leader-tesla?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a31369038fb6416d780bc10892a7b9bfc9f93b7f4107b74e22386abd0d3c7792",
        "title": "Harvard HIV scientist Xie Zhenfei joins China’s national virus lab in Wuhan",
        "summary": "Award-winning Xie Zhenfei, a Harvard University rising star in cutting-edge research aimed at an HIV vaccine, has left the US and joined China’s leading biosafety laboratory in Wuhan.\nXie made headlines in May last year as first author of a landmark paper published by the journal Science that showed a way to use mRNA technology – used to develop vaccines during the Covid-19 pandemic – to develop an effective vaccine against HIV/Aids.\nThe method addresses the main challenge to a vaccine – the...",
        "source": "smcp",
        "date": "2025-10-30T13:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330745/harvard-hiv-scientist-xie-zhenfei-joins-chinas-national-virus-lab-wuhan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "38ec0a470b6f753a4a52246facc3f634bfbfa15b742843df1206f34079e16a3a",
        "title": "‘Amazing’ Xi-Trump summit, as it happened – deals struck as trade war thaws",
        "summary": "This live blog has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. Get faster notifications on the latest updates by downloading our app.\nChinese President Xi Jinping has held talks with his American counterpart Donald Trump, their first in-person meeting since Trump’s return to the White House, as the rivals seek to manage heightened tensions, particularly over trade.\nThe closed-door talks took place on the sidelines of...",
        "source": "smcp",
        "date": "2025-10-30T10:44:51+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330835/xi-and-trump-meet-apec-summit-trade-and-resources-high-agenda?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4bf2e99fd0d56116d3808cb5dd8eecd08033072fa4d180e341c340e15ed9f401",
        "title": "HSBC, other Hong Kong banks cut prime rate to as low as 5%",
        "summary": "Led by HSBC, Hong Kong’s major banks cut their prime lending rates – to a historic low of 5 per cent in some cases – on Thursday, further reducing funding costs to help reboot the city’s businesses and reduce the burden on mortgage borrowers.\nThe Hong Kong Monetary Authority (HKMA) cut the base rate by a quarter point to 4.25 per cent on Thursday morning, hours after the US Federal Reserve pared its target rate by the same margin to a range of 3.75 per cent to 4 per cent during the seventh...",
        "source": "smcp",
        "date": "2025-10-30T08:00:44+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3330832/hong-kong-follows-us-quarter-point-interest-rate-cut-reduce-loans-cost-borrowers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "58f7615004eb95f0404658f5652ae2ec9c2c46a312a65349e61a1feaf42ca46f",
        "title": "Democrats urge Trump not to ease national security restrictions for a trade deal",
        "summary": "Democrats in the US House of Representatives and Senate are urging President Donald Trump not to ease national security restrictions on China for a trade deal, hours ahead of his expected meeting with Chinese President Xi Jinping.\n“America’s export controls, investment safeguards, and our long-standing security partnerships must not be on the negotiating table,” a group of 12 senators led by Chuck Schumer, the chamber’s top Democrat, wrote in a letter to the Republican president on...",
        "source": "smcp",
        "date": "2025-10-30T07:58:46+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3330831/democrats-urge-trump-not-ease-national-security-restrictions-negotiations-xi?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3fdd64bf6981b2fb20841e50c3f43307233eb1f13b7d5c52a4c6f64dc5b813ec",
        "title": "‘Unforgivable’: Chinese county still living in shadow of wild spending binge",
        "summary": "Few areas of China reflect the country’s decades-long economic transformation more vividly than its cities. Rapid development has turned villages into dense urban landscapes and already sizeable metro areas into some of the world’s largest population centres. As the rate of urbanisation slows and the country transitions into a new economic era, we explore how select Chinese cities are navigating the change. Read the rest of our series here.\nIn a remote corner of China’s southwestern Guizhou...",
        "source": "smcp",
        "date": "2025-10-30T07:00:11+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330729/unforgivable-chinese-county-still-living-shadow-wild-spending-binge?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b3eec0da7d32d1d63b5a2037d82275e6b8c66ad433680b49a241f9a91e842816",
        "title": "China’s next power move is as much in the fields as in factories",
        "summary": "At last week’s fourth plenary session of the Central Committee of China’s Communist Party in Beijing, food emerged as a clear policy priority. The plenum’s communique highlighted the goal of accelerating China’s transformation into an agricultural power.\nA leading agricultural producer and importer and a significant exporter, China is doubling down on its next agricultural milestone ahead of the official approval of the 15th five-year plan (2026-2030) early next year.\nWhile detailed...",
        "source": "smcp",
        "date": "2025-10-30T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3330665/chinas-next-power-move-much-fields-factories?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "385e4a7a5b6471d5493f703e91db4fe04b0f3dc32beb824f35f928d683a18536",
        "title": "Why Trump must do more if Washington is to win US-China tech race",
        "summary": "US President Donald Trump’s administration needs to reverse the destructive policies undercutting America’s ability to compete with China in strategic hi-tech sectors or see Beijing race ahead, a leading member of the hardline US House Select Committee on China said on Wednesday.\nChina’s commitment to the progress of tech innovation has caused unease in the United States, with Beijing’s continued investment in the industry standing in sharp contrast to the US government’s current shutdown and...",
        "source": "smcp",
        "date": "2025-10-30T05:32:13+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3330828/trump-must-do-more-win-us-china-tech-race-says-us-house-select-committee-member?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1c7a063ca936b4dac25fb6c36ca6121f1fef85baea58d7b7274fbafd51ddae88",
        "title": "‘Positive step’: cautious relief as China resumes US soybean purchases",
        "summary": "American soybean farmers got some rare good news on Wednesday just hours before a high-stakes meeting between Chinese President Xi Jinping and US President Donald Trump when news broke that Beijing had placed its first order after months of trade tension that saw shipments blocked.\nThe Trump administration hailed the move as a “positive step forward” for farmers, touting the “America first” leader’s deal-making prowess.\n“Today’s purchase by China of multiple ships of American soybeans signals...",
        "source": "smcp",
        "date": "2025-10-30T02:15:56+09:00",
        "url": "https://www.scmp.com/news/china/article/3330823/relief-and-caution-china-resumes-us-soybean-purchases?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2d75dd8ba83119fc86ae66e61d7008b2b5d0b2c99e3a7095f5f5fa1df5bd371f",
        "title": "German vice-chancellor to lead Social Democrat-Beijing talks as ties fray",
        "summary": "German Vice-Chancellor Lars Klingbeil is set to chair talks between his Social Democrat Party (SPD) and China’s Communist Party in Beijing next month, even after Foreign Minister Johann Wadephul was forced to postpone a trip to China after being unable to arrange enough meetings.\nThe SPD and Communist Party meeting will take place in Beijing from November 17 to 19, several sources confirmed, as the two parties continue a long-standing tradition of dialogue.\nKlingbeil is the leader of the SPD,...",
        "source": "smcp",
        "date": "2025-10-30T02:12:44+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330822/germanys-vice-chancellor-lead-social-democrat-communist-party-talks-ties-fray?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "919835e96d25169c3c4b7fdc0026c0d88a865f9363bd5365e0415a01fb87764e",
        "title": "American lawmakers told US must learn from China to revive shipbuilding",
        "summary": "If the US hopes to rebuild a competitive shipbuilding industry and narrow China’s commanding lead, it should adopt some lessons from Beijing – emphasising long-term planning, steady government funding and policy consistency, witnesses told a US Senate hearing this week.\nChina’s phenomenal rise in the global shipbuilding sector has caught the attention of Washington’s policymakers who are keen to restore the nation’s commercial fleet and production capacity, leading many to blame China for...",
        "source": "smcp",
        "date": "2025-10-30T01:09:27+09:00",
        "url": "https://www.scmp.com/news/china/article/3330819/american-lawmakers-told-us-must-learn-china-revive-shipbuilding?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b875b40344c15d34a99cef01756471c1d45115ea6386113675bf548a16df0dac",
        "title": "China’s next 5-year plan aims to narrow nuclear gap with US and Russia: analysts",
        "summary": "China is expected to expand and modernise its nuclear arsenal to narrow the gap with the US and Russia following Beijing’s fresh pledge to strengthen its “strategic deterrence” to safeguard the global balance, according to analysts.\nThe pledge was part of the proposed 15th five-year plan which was endorsed last week by the Communist Party’s Central Committee and will cover the years 2026-2030.\nDetails of the proposal were released on Tuesday, including a pledge to “strengthen strategic...",
        "source": "smcp",
        "date": "2025-10-30T00:00:19+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3330774/chinas-next-5-year-plan-aims-narrow-nuclear-gap-us-and-russia-analysts-say?utm_source=rss_feed",
        "reportUrl": ""
    }
]