[
    {
        "id": "49ee19becd96961e0003ac6ab9a4930fb0f049176e6566d846533b0d4e4f3c8e",
        "title": "New US envoy Julie Eadeh to arrive in Hong Kong this month: sources",
        "summary": "Julie Eadeh, the new US consul general for Hong Kong and Macau, is set to arrive in the city at the end of this month, having received Beijing’s approval for the much-watched appointment, according to sources.\nThe Post reported in July that Eadeh, a career diplomat who served as the political section chief at the US consulate in Hong Kong and Macau during the 2019 protests, would take the role, subject to Beijing’s approval.\n“Her agrément was granted recently, so she is set to come to Hong...",
        "source": "smcp",
        "date": "2025-08-27T09:00:18+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3323227/new-us-envoy-julie-eadeh-arrive-hong-kong-month-sources?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8294ee230230ca596e3dd63c9e48caa2b4083185de557e9a67379ccc1a39e1ee",
        "title": "2027 PLA goal: Victory Day parade puts progress and challenges on show",
        "summary": "China is on a mission to turn its military into a modern fighting force. In the final article in this four-part series, we look at President Xi Jinping’s military goals and obstacles facing the People’s Liberation Army.\nThe 80th anniversary of China’s victory over Japan in World War II is intended to display both the strength and solidarity of the People’s Liberation Army.\nBut just two weeks before it is set to take place, Beijing announced that former navy chief of staff Li Hanjun – a veteran...",
        "source": "smcp",
        "date": "2025-08-27T07:00:09+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3323170/chinas-2027-pla-goal-victory-day-parade-puts-progress-and-challenges-show?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7c61863146bacdb770435907f7f447e05bbade8f2b54163c3196b89595e85343",
        "title": "As the West cedes leverage over Ukraine, China stands to benefit",
        "summary": "It seems clear that US President Donald Trump achieved little more than a photo opportunity from the bilateral summit in Anchorage, Alaska, with Russian President Vladimir Putin and his subsequent meeting with Ukrainian President Volodymyr Zelensky and other European leaders. Now, a ceasefire seems more out of reach than ever.\nFor a negotiated peace agreement, Putin has insisted on his demands that Ukraine give up ambitions to join the North Atlantic Treaty Organisation, as well as land occupied...",
        "source": "smcp",
        "date": "2025-08-27T06:30:07+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3323077/china-may-not-be-waging-war-ukraine-it-still-stands-win?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "647893e518e17cb04341d6cec0212e5d71f9f26d997a10ca94d4b57f4b72c041",
        "title": "Brazilians’ negative views of US double, China sees sharp rise in positives: poll",
        "summary": "Brazilians now view the United States more negatively than positively for the first time in two years, according to a new survey released on Tuesday, while perceptions of China have improved.\nThe shift follows US President Donald Trump raising tariffs on Brazilian exports and tightening visa rules, moves that unsettled a country long accustomed to close economic ties with Washington.\nThe Quaest poll found 48 per cent of Brazilians hold an unfavourable opinion of the US, double the level recorded...",
        "source": "smcp",
        "date": "2025-08-27T03:34:27+09:00",
        "url": "https://www.scmp.com/news/us/article/3323256/brazilians-negative-views-us-double-china-sees-sharp-rise-positives-poll?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "46397bc138348ff90e2745318931f84f15f7d9776244df36d44ee8b539bf2737",
        "title": "Trump calls criticism of move to admit thousands of Chinese students ‘insulting’",
        "summary": "US President Donald Trump on Tuesday defended his proposal to admit hundreds of thousands of Chinese students, saying the US is “honored” to host them and warning that the American college system would “go to hell” without them.\nFacing growing anger from his political base, Trump dismissed criticism of the plan as “insulting” and pointed to his relationship with Chinese President Xi Jinping as part of a broader strategy of engagement.\n“We’re getting along very well with China, and I’m getting...",
        "source": "smcp",
        "date": "2025-08-27T03:29:29+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3323255/trump-base-erupts-over-his-move-admit-thousands-more-chinese-students?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c3ffb518dd01e80917b88bfb4e099944e9153d878b86d4f0f8299c1d304eb73e",
        "title": "EU urged to unleash ‘trade bazooka’ in response to Trump’s tariff threats",
        "summary": "Calls are mounting for the European Union to fire its “trade bazooka” at Washington after US President Donald Trump threatened tariffs and export restrictions on countries applying digital laws and taxes to American firms.\nIn a late-night post on social media, Trump vowed to slap “substantial additional tariffs” and restrict the export of “technology and chips” to countries enforcing “digital taxes, legislation, rules or regulations”.\nWhile he did not name Europe directly, the American leader...",
        "source": "smcp",
        "date": "2025-08-27T01:00:12+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3323240/eu-urged-unleash-trade-bazooka-response-trumps-tariff-threats?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "827c7b10f73778d92b1b7a98a93652c4a73cde84dc7a2654d614bcf4d0733440",
        "title": "Trump’s 200% rare earth tariff threat proof of China’s leverage: analysts",
        "summary": "Revived threats of tariff increases from US President Donald Trump over China’s supply of rare earth elements highlight the minerals’ importance in global manufacturing, analysts said – and show Beijing its dominance in this area remains a potent source of leverage in trade negotiations.\nChina will face “200 per cent tariffs, or something” unless it continues to ensure shipments of permanent magnets containing the minerals will reach the US, Trump said during a meeting with South Korean...",
        "source": "smcp",
        "date": "2025-08-26T23:00:11+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3323223/trumps-200-rare-earth-tariff-threat-proof-chinas-leverage-analysts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2cb1734c0026e527e0984c14d534f4616694d62347175afb8f69cca65d726b36",
        "title": "Chinese VP meets special envoy of Republic of Korea president",
        "summary": "Chinese Vice President Han Zheng met with Park Byeong-seug, special envoy of President of the Republic of Korea (ROK) Lee Jae-myung in Beijing on Tuesday.",
        "source": "cgtn",
        "date": "2025-08-26T22:20:09+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/Chinese-VP-meets-special-envoy-of-Republic-of-Korea-president-1G9xJgcdb8c/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "cdaff2bcf8b562c666212c78806ac5584271c8d14af0228345852ad159c706e4",
        "title": "Trump’s fresh tariff threat, China’s invisibility tech: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Trump says China must ensure rare earth magnets or face 200% tariffs\nUS President Donald Trump said on Monday that China must ensure the US supply of rare earth magnets or face 200 per cent tariffs, and that he will continue to allow Chinese students into the country.\n2. Why China and US still invest in crewed military systems when they have drones\nRapid...",
        "source": "smcp",
        "date": "2025-08-26T22:15:07+09:00",
        "url": "https://www.scmp.com/news/china/article/3323199/trumps-fresh-tariff-threat-chinas-invisibility-tech-breakthrough-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ec0959caf2b55f33aeba01758cd1af0919a662537fd9271be33a60ca209c3a7e",
        "title": "'Victory': CMG's documentary on China's war of resistance airs Tuesday",
        "summary": "A 10-part documentary, \"Victory,\" produced by CMG, provides an objective and detailed account of the Chinese people's 14-year War of Resistance Against Japanese Aggression, using rare archival footage, personal testimonies from veterans and expert analysis to present China's contribution to the global anti-fascist war.",
        "source": "cgtn",
        "date": "2025-08-26T22:10:34+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/-Victory-CMG-s-documentary-on-China-s-war-of-resistance-airs-Tuesday-1G9M8XPZ0By/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "84bcce0f119bfa797b4ed1a65e046688161a98925aa9d724dd4726959517ec2c",
        "title": "DeepSeek’s V3.1 model emerges as ‘key pillar’ for China’s chip self-sufficiency",
        "summary": "DeepSeek’s recently released V3.1 AI model has unleashed fresh optimism about the prospects of China developing advanced artificial intelligence semiconductors, according to analysts.\nThe Hangzhou-based start-up’s updated model, which supports an innovative data format called UE8M0 FP8, was “ushering in a booming domestic computing power chain”, Huatai Securities analysts said in a research note on Tuesday.\nThat architecture showed that the synergy between mainland-designed software and chips...",
        "source": "smcp",
        "date": "2025-08-26T22:00:43+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3323235/tech-war-deepseeks-v31-model-emerges-key-pillar-chinas-chip-self-sufficiency?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b62ed8b23005af28cb23b6f346453655977388b1a4e3ddc80be249f489dc182f",
        "title": "New tank shows China adapting to drone-era battlefield and landing operations: analyst",
        "summary": "China is set to unveil a new-generation, lighter tank during next month’s military parade, designed to better survive drone strikes and be more suitable for potential Taiwan operations, according to a Chinese analyst.\nA new type of tank was recently spotted on Beijing’s streets during rehearsals for the September 3 massive military parade, which marks the 80th anniversary of China’s victory over Japan in World War II.\nThe vehicle appears to be a medium-weight tank, lighter than the...",
        "source": "smcp",
        "date": "2025-08-26T22:00:09+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3323231/new-tank-shows-china-adapting-drone-era-battlefield-and-landing-operations-analyst?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bc33446c33d8447f128ab50f778c9aa624eb78aff8fa3ca594869385e6602f1a",
        "title": "China report exposes unlawful nature of U.S. 'freedom of navigation'",
        "summary": "China report exposes unlawful nature of U.S. 'freedom of navigation'",
        "source": "cgtn",
        "date": "2025-08-26T21:57:51+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/China-report-exposes-unlawful-nature-of-U-S-freedom-of-navigation--1G9N9hmw1RC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "10d9f168596f09b3957a603b65a6f6ab5d3b9d64fa0375abd219a50baf0edc92",
        "title": "First Russian-born panda Katyusha celebrates birthday with avid fans",
        "summary": "First Russian-born panda Katyusha celebrates birthday with avid fans",
        "source": "cgtn",
        "date": "2025-08-26T21:41:55+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/First-Russian-born-panda-Katyusha-celebrates-birthday-with-avid-fans-1G9IytrSsrC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "6217e5c6bd42df74754fc1991f6e6b8f05bf2605f6af38dbc1126541d29ea894",
        "title": "Ping An interim profit misses estimates as China’s economy sputters",
        "summary": "The first-half profit of China’s most valuable insurance company missed analysts’ estimates, as one-off revaluations of investments eroded the increasing sales of life and health products by Ping An Insurance (Group).\nInterim net profit fell 8.8 per cent to 68.05 billion yuan (US$9.50 billion) from a year earlier, missing a 4.4 per cent increase that was expected by Bloomberg’s consensus estimate.\nThe value of new business in Ping An’s life and health insurance divisions, a key measure of future...",
        "source": "smcp",
        "date": "2025-08-26T21:38:42+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3323232/ping-interim-profit-misses-estimates-china-rate-cut-erodes-banks-investments?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4f9faad5f08e974880f293e7cd7bb4aa880348bfa1671370d6a2084eeb5ec2b3",
        "title": "US trade deal leaves EU as the sidekick in Trump’s China policy",
        "summary": "Europe has surrendered to Washington’s China containment strategy, trading sovereignty for subordination in a consequential geopolitical realignment.\nThe August US-EU “Framework on an Agreement on Reciprocal, Fair, and Balanced Trade” was not negotiation but a capitulation that redefined Europe’s international role. Brussels accepted US President Donald Trump’s terms wholesale, recasting the European Union as an auxiliary enforcer of America’s China policy.\nThis transformation centres on clause...",
        "source": "smcp",
        "date": "2025-08-26T21:30:08+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3323141/us-trade-deal-leaves-eu-sidekick-trumps-china-policy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a4d48d48ab25b0337d6af8b6bb9fec6b30afe58e014d5828c2f507d9798b0a7a",
        "title": "China protests over reports Japan urged other countries to skip WWII parade",
        "summary": "China has lodged a protest with Japan after Tokyo reportedly asked foreign leaders not to attend next month’s parade in Beijing to mark the end of World War II.\nCiting anonymous diplomatic sources, Japan’s Kyodo news agency reported on Sunday that Japanese embassies abroad had been warning that the Victory Day events had anti-Japanese overtones.\nGuo Jiakun, a spokesman for the Chinese foreign ministry, said on Tuesday that Beijing had lodged protests with Japan, asked for clarification and urged...",
        "source": "smcp",
        "date": "2025-08-26T21:02:27+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3323229/china-protests-japan-over-reports-it-asked-foreign-leaders-skip-victory-day-parade?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "29c78e822b0be9a88532aac48cfe3a6fdee9d4058a32b5ad7d78f47f0be6af5a",
        "title": "Kylin upgrades operating system with AI, support for Chinese semiconductors",
        "summary": "Kylin Software, a unit of state-owned China Electronics Corp, on Tuesday unveiled V11, the latest version of its operating system (OS) that features AI capabilities and extensive support for locally designed semiconductors.\nV11 provided deep artificial intelligence integration that brought out a “smart and efficient” experience for office use, while delivering expanded compatibility with a range of Chinese-designed and developed integrated circuits, the company said during its product launch at...",
        "source": "smcp",
        "date": "2025-08-26T21:00:17+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3323222/tech-war-kylin-upgrades-operating-system-ai-support-chinese-semiconductors?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d207e694ae7b86c10869b357ecbc236596dba27b7b9bc0c8bcdc48c1c69ccfab",
        "title": "Taiwan warns celebrities to be wary of supporting Beijing’s military parade",
        "summary": "Taiwan on Tuesday cautioned its entertainers against echoing mainland Chinese propaganda, singling out Beijing’s military parade next week while reiterating that government employees and senior retired officers were forbidden from attending.\nThe warning was issued by the island’s Mainland Affairs Council ahead of the Victory Day parade in Beijing’s Tiananmen Square on September 3 to mark the 80th anniversary of Japan’s defeat in World War II.\n“Taiwanese entertainers developing careers in...",
        "source": "smcp",
        "date": "2025-08-26T20:00:43+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3323211/taiwan-warns-celebrities-be-wary-supporting-mainland-chinas-military-parade?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ec595d31bbbf7b3574abd2b5fb9934b31796de0fb08b710cf8a947c5d77a025f",
        "title": "'Victory': CMG's documentary on China's war of resistance airs Tuesday",
        "summary": "A grand epic is coming to your screen. CMG's documentary, \"Victory,\" chronicles the Chinese People's War of Resistance Against Japanese Aggression and the World Anti-Fascist War. It premieres tonight! Watch two consecutive episodes on CCTV-1 at 8 p.m.",
        "source": "cgtn",
        "date": "2025-08-26T19:45:21+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/-Victory-CMG-s-documentary-on-China-s-war-of-resistance-airs-Tuesday-1G9EOMYZxPa/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "4ea3651c0d54eea68a38c6dce060398dc8e5cda7a9519750ec5a1ea395f5cdab",
        "title": "Roots and Longing: The Way Home",
        "summary": "Roots and Longing: The Way Home",
        "source": "cgtn",
        "date": "2025-08-26T19:43:09+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/Roots-and-Longing-The-Way-Home-1G99VP5Dna0/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f60ab998af41d5afa9d2f14bc64a39f072db0b259170313c1b839dba9dc39f69",
        "title": "Chinese fighter jet formations will simulate ‘real-war scenario’ in PLA fly-past",
        "summary": "The People’s Liberation Army will showcase its fighter jets from the air force, navy and army in joint formations during next week’s military parade, state news agency Xinhua reported.\nThe huge Victory Day parade will be held in the heart of Beijing on September 3 to mark 80 years since the end of World War II after Japan’s surrender.\nFighter jets will fly in formations simulating a “real-war scenario” and highlighting their joint combat operations, according to the Xinhua report on Monday.\n\n\nIt...",
        "source": "smcp",
        "date": "2025-08-26T19:00:19+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3323167/chinese-fighter-jet-formations-will-simulate-real-war-scenario-during-military-fly-past?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e69a01f86d4ff5e8d68296b3fe83b47861ccb73d258da529c77752826f47de76",
        "title": "China's political advisors discuss drafting of the 15th Five-Year Plan",
        "summary": "China's national political advisors on Tuesday shared their views on the drafting of the country's 15th Five-Year Plan (2026-2030).",
        "source": "cgtn",
        "date": "2025-08-26T18:58:43+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/China-s-political-advisors-discuss-drafting-of-the-15th-Five-Year-Plan-1G9uVZtjfxK/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "39a2e5bffa94a27b4dec0906d0a30e69ff8a16edc49cb7e99f7bb70d135090c1",
        "title": "Head-of-state diplomacy essential in China-U.S. ties: spokesperson",
        "summary": "Head-of-state diplomacy essential in China-U.S. ties: spokesperson",
        "source": "cgtn",
        "date": "2025-08-26T18:53:17+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/Head-of-state-diplomacy-essential-in-China-U-S-ties-spokesperson-1G9uSO4ZSve/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ed39e2d6c6af40dcaee92fbf9694f2edd336dd341088f068f73e743cc99c270b",
        "title": "China urges Japan to reflect on its history of aggression",
        "summary": "China urges Japan to reflect on its history of aggression",
        "source": "cgtn",
        "date": "2025-08-26T18:49:33+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/China-urges-Japan-to-reflect-on-its-history-of-aggression-1G9yxFgqwa4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "28270126996defcf242816b042a11652a2e0de939713c7b08963a4cafcdb4707",
        "title": "A short a cappella preview of 'Red Silk'",
        "summary": "Russian singer Alena Sviridova performed a short a cappella rendition of the song that she composed for the China-Russia co-produced film \"Red Silk.\"",
        "source": "cgtn",
        "date": "2025-08-26T18:47:45+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/A-short-a-cappella-preview-of-Red-Silk--1G9zkKyKp0I/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "c44be42e3332419449dbc62130751f958ee57ee2c2034359031d076779c2fb6d",
        "title": "China Popcast: Haunting stories of WWII in China",
        "summary": "In this episode of the China Popcast, a new video podcast covering culture, mountaineer Kevin Wang and Gen Z content creator Jonathan Yao join hosts Lucy Lv and Wendyl Martin for a discussion about the legacy of World War II in China.",
        "source": "cgtn",
        "date": "2025-08-26T18:47:20+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/China-Popcast-Haunting-stories-of-WWII-in-China-1G972rEqJZS/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "051000639b48917debfe7a35815cc7a7e9b52ab44ca347a1e23cc48b1a01f59a",
        "title": "Exhibition reflects on the bonds between human and nature",
        "summary": "Philosophers around the world have long discussed the concept of the harmony between humans and nature.",
        "source": "cgtn",
        "date": "2025-08-26T18:38:38+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/Exhibition-reflects-on-the-bonds-between-human-and-nature--1G9zxmQFGvu/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f8ec67cea4bb76e1a90e6a783b541458f13ad48241339a791865805549bbe192",
        "title": "Xi Jinping and his wife meet with Cambodian King and Queen Mother",
        "summary": "Chinese President Xi Jinping and his wife Peng Liyuan met with Cambodian King Norodom Sihamoni and Queen Mother Norodom Monineath Sihanouk in Beijing on Tuesday.",
        "source": "cgtn",
        "date": "2025-08-26T18:22:33+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/Xi-Jinping-and-his-wife-meet-Cambodian-King-Queen-Mother-1G9mZIDPEVW/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "678fd3f28602e9019b5a67817fd2e73d7959cedecf776681a8992c27f80c6d07",
        "title": "Construction workers trapped mid-air as rainstorm hits China",
        "summary": "Two construction workers were trapped mid-air on a suspended gondola after a rainstorm suddenly hit northwestern China’s Shaanxi province.",
        "source": "smcp",
        "date": "2025-08-26T18:15:15+09:00",
        "url": "https://www.scmp.com/news/china/article/3323175/construction-workers-trapped-mid-air-rainstorm-hits-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ae6d19d540359a271d957e465a4b825a41de882fdb8e7d7f1006bcdbfc9cd2d0",
        "title": "China defeat Colombia 3-1 to reach last 16 at FIVB World Championship",
        "summary": "China defeat Colombia 3-1 to reach last 16 at FIVB World Championship",
        "source": "cgtn",
        "date": "2025-08-26T18:05:53+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/China-defeat-Colombia-3-1-to-reach-last-16-at-FIVB-World-Championship-1G9h8ETE8yQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "e658b626fc7e16fae020b92d91fe212d963d1aff3d73c81d75b4f1b59ad3be17",
        "title": "China launches world’s most powerful detector for ‘ghost particles’",
        "summary": "China launched the Jiangmen Underground Neutrino Observatory (Juno), the world’s largest detector for elusive “ghost particles” called neutrinos, in southern Guangdong province on Tuesday.\nThe massive facility has started collecting data for its mission to track the mysterious particles with no electrical charge, very little mass and moving at near-light speed.\nThe Institute of High Energy Physics of the Chinese Academy of Sciences said Juno had successfully completed filling its 20,000 tonne...",
        "source": "smcp",
        "date": "2025-08-26T18:00:32+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3323196/china-launches-juno-worlds-most-powerful-detector-ghost-particles?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a70fbcf2ea06ee04ccfaa5255cf39f0d397ec606d397ddca14f72e3e9011b5e1",
        "title": "Hong Kong fund, Beijing academy team up to hunt for global AI talent",
        "summary": "Hong Kong’s government-owned wealth fund has partnered with one of China’s leading artificial intelligence agencies to attract global talent to the city, as it strengthens its commitment to transform into a technology hub.\nAs part of the inaugural AI Global Talents Connect initiative, the Hong Kong Investment Corporation (HKIC) would collaborate with the Beijing Academy of Artificial Intelligence (BAAI) to establish an “international hub for AI talent”, the two organisations said on Tuesday.\nThe...",
        "source": "smcp",
        "date": "2025-08-26T18:00:09+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3323177/hong-kong-wealth-fund-beijing-ai-academy-team-hunt-global-ai-talent?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3b111235577d7340ede40aee8d60e1e164a317b343bcf3688b57387c9be1ab4d",
        "title": "French peace advocate discusses CGTN's new song 'Ode to Peace'",
        "summary": "To mark the 80th anniversary of the victory in the World Anti-Fascist War, CGTN is set to release a new song titled \"Ode to Peace,\" a work conveying a message of peace and hope that transcends national borders.",
        "source": "cgtn",
        "date": "2025-08-26T17:48:14+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/French-peace-advocate-discusses-CGTN-s-new-song-Ode-to-Peace--1G9ujMZKJ0I/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a77803be33afb1abf90a2bee24e41af3e2f183fcb49a56a2d32427ee611dbde0",
        "title": "Pakistani minister praises SCO for advancing green development",
        "summary": "Pakistani minister praises SCO for advancing green development",
        "source": "cgtn",
        "date": "2025-08-26T17:39:07+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/Pakistani-minister-praises-SCO-for-advancing-green-development--1G9wjCqHMVG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "c7a654cc43cb5e9cf3a685afef6069868347d21cc663597150858671e828517e",
        "title": "China urged to take pragmatic view as South Korea and Japan pledge closer ties",
        "summary": "Beijing has been urged to take a pragmatic approach towards South Korea’s new government following a recent summit that signalled a thaw in relations with Japan.\nSouth Korean President Lee Jae-myung and Japanese Prime Minister Shigeru Ishiba agreed to work closely on economic and security issues, while also emphasising the need to move beyond historical disputes and the importance of their relationship with the United States. The three countries agreed to a three-way defence agreement in August...",
        "source": "smcp",
        "date": "2025-08-26T17:17:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3323182/china-urged-take-pragmatic-approach-south-korea-and-japan-pledge-closer-cooperation?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "af1c2f0d290082ce47913fe657a9686b85f85d4f7cf410ecdd9bb65c72c3ea5c",
        "title": "Mongolian Bökh: An unmissable highlight of the Naadam Fair",
        "summary": "On the vast grasslands, Bökh is known as one of the \"Three Manly Skills\" alongside horse racing and archery. Today, this sport remains an indispensable and celebrated event at the Naadam Fair.",
        "source": "cgtn",
        "date": "2025-08-26T17:05:54+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/Mongolian-B-kh-An-unmissable-highlight-of-the-Naadam-Fair-1G9ur0REoo0/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "3b275394ebe18ce6cc4b7bbd2e99b1d9a703724ee51ccced570e91e84095635e",
        "title": "The dedication of a Chinese-style wrestling inheritor",
        "summary": "A family heirloom dubbed the \"martial arts manual\" still ignites a spark in the nearly 60-year-old man's eyes. This precious wrestling manual, passed down from Zhang Shaohua's father, documents the history, techniques, and spirit of Chinese wrestling.",
        "source": "cgtn",
        "date": "2025-08-26T17:04:03+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/The-dedication-of-a-Chinese-style-wrestling-inheritor-1G9u7u3XtpC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "592008a54c4cebac447b6ffe60746e5c2251f0530afc679382fee3c214b1fc27",
        "title": "China's Yuan exits US Open in first round, Shang retires injured",
        "summary": "China's Yuan exits US Open in first round, Shang retires injured",
        "source": "cgtn",
        "date": "2025-08-26T16:48:25+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/China-s-Yuan-exits-US-Open-in-first-round-Shang-retires-injured-1G99sX0TXvG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b28393a6def9bd08ce5ba5546701d4137f0a466d790799259ffd8e0c8f239379",
        "title": "Elegance in motion with Zhou Yu’s sword dance",
        "summary": "In this performance, Jiao Pengfei brings Zhou Yu – a refined and talented general from China's Three Kingdoms period – to life with the famous sword dance from the Peking Opera \"Gathering of Heroes.\"",
        "source": "cgtn",
        "date": "2025-08-26T16:35:45+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/Elegance-in-motion-with-Zhou-Yu-s-sword-dance-1G9f1KPTwSQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a9b78b4caef93e6f1ee9f840aa526158c3d053381e46f30d6708af7318986690",
        "title": "China to expand carbon market to major industries by 2027",
        "summary": "China will accelerate the expansion of its carbon market to incorporate major industries by 2027, according to guidelines issued by top policymakers.\nBy 2030, China hopes to have in place “a transparent, standardised and internationally aligned voluntary reduction market”, according to a document on Monday from the Communist Party Central Committee and the State Council. The measures will help deliver President Xi Jinping’s pledge to peak China’s emissions by the end of the decade.\nThe plan also...",
        "source": "smcp",
        "date": "2025-08-26T16:07:50+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3323168/china-expand-carbon-market-major-industries-2027?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8a59ea4edd3f343c4e7a63aebac29acf5ced1e474a9b7dfa4c0fa8a908480dc5",
        "title": "The elegance of Mengthang: The sacred Thangka artistry of Xizang",
        "summary": "The elegance of Mengthang: The sacred Thangka artistry of Xizang",
        "source": "cgtn",
        "date": "2025-08-26T15:55:08+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/The-elegance-of-Mengthang-The-sacred-Thangka-artistry-of-Xizang-1G9eY1zViE0/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "45c568bad691a0889b01f56357a09fc05095c48db19acb1d5dde315d5edf93da",
        "title": "Ambassador Ma Qiang on China's Peacekeeping in South Sudan",
        "summary": "The world's youngest country, South Sudan, is still struggling for lasting peace.",
        "source": "cgtn",
        "date": "2025-08-26T14:46:54+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/Ambassador-Ma-Qiang-on-China-s-Peacekeeping-in-South-Sudan-1G99wT17rS8/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ede358abdd9352e91c8cd371fccd77c5ce20145ebdeb237beeb84de13ec99f83",
        "title": "JUNO completes liquid filling, begins data taking",
        "summary": "The Jiangmen Underground Neutrino Observatory (JUNO) successfully completed filling its 20,000-tonne liquid scintillator detector and begun data taking on Tuesday.",
        "source": "cgtn",
        "date": "2025-08-26T14:26:44+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/JUNO-completes-liquid-filling-begins-data-taking-1G9abvYUTWU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d0d1bf177113c2f1b291b9604d0d9f136a47e9829e3d126659f85a746111f1f4",
        "title": "Trump says he will allow 600,000 Chinese to study in US – double current figure",
        "summary": "US President Donald Trump said he would allow 600,000 Chinese students to enter the United States which is double the current figure, and reiterated that President Xi Jinping had invited him “to come to China”.\nThe significant shift in tone from the US government came soon after the Chinese embassy in the US advised students to “be cautious when choosing” Houston as their destination when entering America, saying some students have been “unjustifiably questioned and harassed” recently.\nOn...",
        "source": "smcp",
        "date": "2025-08-26T14:20:50+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3323156/trump-says-he-will-allow-600000-chinese-study-us-double-current-number?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "795379604a3bbfcc613204439ffe656396599f4492490ddffdba5236acb420bf",
        "title": "China achieves invisibility tech breakthrough for early warning aircraft",
        "summary": "Chinese air force scientists have developed a revolutionary radar technology capable of rendering its airborne early warning platforms nearly undetectable to enemy electronic surveillance.\nAirborne early warning and control (AEW&amp;C) aircraft – long considered indispensable yet vulnerable command nodes – have historically been high-value targets. Their powerful radar emissions, while essential for managing the battlespace, make them visible from hundreds of kilometres away.\nBut the Chinese...",
        "source": "smcp",
        "date": "2025-08-26T13:00:08+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322731/china-achieves-invisibility-tech-breakthrough-early-warning-aircraft?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7cfdc1a3653eb411253069eafb3eaa33c2559b9f93b748b72365c8812172a9a5",
        "title": "China contributes over 40% of world's new energy patents: official",
        "summary": "China contributes over 40% of world's new energy patents: official",
        "source": "cgtn",
        "date": "2025-08-26T12:47:48+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/China-contributes-over-40-of-world-s-new-energy-patents-official-1G9bdOfg5kA/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "71e77a31ec0f5a637c98e0ed543a41f876c9b824d8e6c45d48d9d3c7d045f439",
        "title": "President Xi Jinping meets Russian State Duma chairman",
        "summary": "Chinese President Xi Jinping met with Vyacheslav Volodin, chairman of the Russian parliament's lower house, the State Duma, in Beijing on Tuesday.",
        "source": "cgtn",
        "date": "2025-08-26T12:45:06+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/President-Xi-Jinping-meets-Russian-State-Duma-chairman-1G97QQ5bPTG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f02c93a666c978c3e19640975124fc25c40bb39ac879860ce2f5861d1dd39307",
        "title": "World's first gene-edited pig lung transplanted into human body",
        "summary": "World's first gene-edited pig lung transplanted into human body",
        "source": "cgtn",
        "date": "2025-08-26T12:44:15+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/World-s-first-gene-edited-pig-lung-transplanted-into-human-body-1G95MseMlu8/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f2d45e1e7570b622cbeab56e0cb2067d50894d273064c75894b3d9268695fb50",
        "title": "China issues guideline to strengthen national carbon trading market",
        "summary": "China has unveiled a guideline to accelerate the country's green and low-carbon transition and strengthen the construction of the national carbon trading market.",
        "source": "cgtn",
        "date": "2025-08-26T11:57:54+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/China-issues-guideline-to-strengthen-national-carbon-trading-market-1G90CM69rdm/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0ee63791cc7a4229edc59dec79d72c4bf1c4b40365f361c15d0bb3b4718d75a8",
        "title": "Cyborg roaches for disaster relief? Singapore team’s 68-second feat says yes",
        "summary": "Scientists in Singapore have industrialised the production of remote-controlled cyborg cockroaches that one day could form a tiny army suitable for disaster search missions.\nLast month, researchers led by Hirotaka Sato at Nanyang Technological University published their previously preprinted study describing a system for the mass production of mechanical cockroaches.\nThe July 28 article in Nature Communications said the team had continued with their pioneering concept of an “insect robot...",
        "source": "smcp",
        "date": "2025-08-26T11:00:13+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322924/singapore-teams-68-second-feat-opens-door-cyborg-cockroaches-disaster-relief?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5ff93d02b23d0f86c73c69724fd09e3a575b0066d422dc85b3d616a703986769",
        "title": "Public transport resumes in south China as Typhoon Kajiki weakens",
        "summary": "Public transportation services are gradually resuming in south China's Hainan Province and parts of Guangdong Province as Kajiki, the 13th typhoon of the year, weakened on Monday.",
        "source": "cgtn",
        "date": "2025-08-26T10:57:44+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/Public-transport-resumes-in-south-China-as-Typhoon-Kajiki-weakens-1G8Zi4viCAg/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ffb5f979c67f1e5edfc95e6eeefe93d89f3c734aabc8a3609d427fa67d6c26b1",
        "title": "China launches new gas pipeline to boost energy security",
        "summary": "China launches new gas pipeline to boost energy security",
        "source": "cgtn",
        "date": "2025-08-26T10:51:20+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/China-launches-new-gas-pipeline-to-boost-energy-security-1G8ZqwJ0GeA/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "120dade660dc72605367050ac5011032bb75012bdc10759952454d1a8574224a",
        "title": "China's Xi'an to host 2025 Euro-Asia Economic Forum in late September",
        "summary": "The Euro-Asia Economic Forum, an important economic cooperation mechanism under the framework of the Shanghai Cooperation Organization, has been held every two years since its inauguration in 2005.",
        "source": "cgtn",
        "date": "2025-08-26T10:48:25+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/China-s-Xi-an-to-host-2025-Euro-Asia-Economic-Forum-in-late-September-1G904IzgpI4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "9e6fed164d1920f548c1428e54bc699dee835b15b084e36856c3101b7bf6836b",
        "title": "Shares in Chinese energy-storage firm Shuangdeng soar in Hong Kong debut",
        "summary": "Shares of Shuangdeng Group, one of China’s largest makers of batteries and energy-storage systems, soared in their Hong Kong trading debut on Tuesday, as the city’s buoyant initial public offering (IPO) market continues to mint successful listings, especially for companies in the electric-vehicle boom.\nTrading under the stock sign 6960, Shuangdeng first changed hands at HK$22.50, a premium of 55 per cent to its offer price of HK$14.51 per share. It traded as high as HK$23.18 before retreating to...",
        "source": "smcp",
        "date": "2025-08-26T10:38:26+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3323126/shuangdeng-shares-soar-55-hong-kong-debut-evs-and-batteries-drive-citys-ipo-boom?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8a187846c0543ce1e381ab31555066f24d9712e043febe056e97aaeaa9f44b0e",
        "title": "China launches new low Earth orbit satellites",
        "summary": "China launched a new group of low Earth orbit satellites on Tuesday from a commercial spacecraft launch site in the southern island province of Hainan.",
        "source": "cgtn",
        "date": "2025-08-26T10:24:59+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/China-launches-new-low-Earth-orbit-satellites-1G8V6vACIh2/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "7fa0de7210345798d3abccc780b95fa24a0fd8302ac88a541fc8616caece0b94",
        "title": "AI enters the classroom: China’s Hangzhou makes lessons compulsory in schools",
        "summary": "Hangzhou, in China’s Zhejiang province, will introduce mandatory artificial intelligence (AI) courses for primary and secondary schools starting in the new semester – part of a nationwide strategy to nurture talent in the rapidly growing sector.\nThe initiative seeks to build a talent pipeline while improving educators’ ability to use smart tools and protect data, covering both student and teacher training, according to two documents released by the city’s education bureau.\nSchools will have...",
        "source": "smcp",
        "date": "2025-08-26T10:00:13+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3323082/chinas-hangzhou-makes-ai-classes-compulsory-schools-amid-nationwide-push?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f485d15b7ceeac4be64f0719318b11150af0ba7b530c9bc29aeb96a96fa42ea1",
        "title": "China's top legislator urges closer China-Russia parliamentary ties",
        "summary": "China's top legislator Zhao Leji on Monday called on China's National People's Congress (NPC) and the Federal Assembly of the Russian Federation to fully leverage cooperation mechanisms and platforms, and continuously enhance exchanges and cooperation.",
        "source": "cgtn",
        "date": "2025-08-26T09:49:37+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/China-s-top-legislator-urges-closer-China-Russia-parliamentary-ties-1G8Uf7jqBhe/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "4100abd703ed44ce1868adf388d0503fbf83c231a1a11c3803b149d58845d277",
        "title": "Political advisors urged to pool wisdom for 15th Five-Year Plan",
        "summary": "The Standing Committee of the 14th Chinese People's Political Consultative Conference (CPPCC) National Committee opened its 13th session on Monday to discuss the drafting of the country's 15th Five-Year Plan (2026-2030).",
        "source": "cgtn",
        "date": "2025-08-26T09:40:33+09:00",
        "url": "https://news.cgtn.com/news/2025-08-26/Political-advisors-urged-to-pool-wisdom-for-15th-Five-Year-Plan-1G8USDFpm24/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "40ff7194c8e94049b5618aa263b1b553bf0e2cd90b2be897addf7e89c24bef3b",
        "title": "Beijing expands its influence in Eurasia as Trump triggers geopolitical shifts",
        "summary": "While United States President Donald Trump aims to end – or at least freeze – the Ukraine conflict and portray himself as a peacemaker, China seems to be quietly expanding its influence in Eurasia – a region that Halford Mackinder, “the father of geopolitics”, viewed as the key to global power.\nThe coming Shanghai Cooperation Organisation summit, scheduled to start on August 31 in Tianjin, is expected to provide another opportunity for Beijing to strengthen its political, economic and military...",
        "source": "smcp",
        "date": "2025-08-26T07:30:07+09:00",
        "url": "https://www.scmp.com/opinion/asia-opinion/article/3323022/beijing-expands-its-influence-eurasia-trump-triggers-geopolitical-shifts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "28e2eb0d8d3a65af10407e87567f97813a3914773f088e0257b8b34221d58aee",
        "title": "Why China and US still invest in crewed military systems when they have drones",
        "summary": "China is on a mission to turn its military into a modern fighting force. In the third of this four-part series, we look at why drones are not replacing humans on the battlefield but ‘redefining roles’.\nRapid advances in drone and robot technology in recent years are reshaping modern warfare.\nFrom robot dogs to hi-tech drones, top military powers like China and the United States have technology that could – in the not too distant future – play important roles on the battlefield, while humans stay...",
        "source": "smcp",
        "date": "2025-08-26T07:00:12+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3323036/why-china-and-us-still-invest-costly-crewed-military-systems-when-they-have-drones?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "965d6ecb537d1c6e2e8f2a3d89293884201de2e0089f62156d90a0852aafa2af",
        "title": "Trump says China must ensure rare earth magnets or face 200% tariffs",
        "summary": "US President Donald Trump said on Monday that China must ensure the US supply of rare earth magnets or face 200 per cent tariffs, and that he will continue to allow Chinese students into the country.\n“They have to give us magnets,” otherwise “we have to charge them 200 per cent tariff or something”, Trump told reporters while meeting South Korean President Lee Jae Myung at the White House. He conceded, though, that such high duties would mean a breakdown in bilateral trade.\n“We have a much more...",
        "source": "smcp",
        "date": "2025-08-26T06:36:21+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3323120/trump-says-china-must-ensure-rare-earth-magnets-or-face-200-cent-tariffs?utm_source=rss_feed",
        "reportUrl": ""
    }
]