[
    {
        "id": "b6ecc1c553ab0cb694a9d2328daa2b3609c0949a24d9dbf4c77ee70e11690979",
        "title": "Survey reveals more than half of Americans want to cooperate with China",
        "summary": "More than half of Americans say the United States should cooperate and engage with China, according to a survey released on Tuesday, a sharp increase from the 40 per cent recorded in 2024.\nThe results released by the Chicago Council on Global Affairs also found that a majority of Americans are against higher tariffs on Chinese imports.\n“Americans’ views of China are beginning to improve after several years of sharp declines,” said Craig Kafura, the council’s director of public opinion and US...",
        "source": "smcp",
        "date": "2025-10-29T08:03:36+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3330695/survey-reveals-more-half-americans-want-more-friendly-engagement-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ab1688a17476dfe601bba64f194c29d23e93ffaad88e91fd098de5cda32122ce",
        "title": "Beyond soybeans: another group of Americans pins hopes on Xi-Trump talks",
        "summary": "Hundreds of American families who’ve waited over five years to embrace their adoptive children from China are clinging to hope that a meeting between US President Donald Trump and Chinese President Xi Jinping will finally bring their families together.\nTheir optimism grew after the White House, for the first time, told the Post on Monday that the “America first” president is aware of their plight. This came weeks after US State Department officials suggested they look elsewhere after Beijing...",
        "source": "smcp",
        "date": "2025-10-29T07:07:52+09:00",
        "url": "https://www.scmp.com/news/us/article/3330693/beyond-soybeans-another-group-americans-watching-xi-trump-meeting-hope?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a367e5a22633a098ad9984dd78dd4eadf1ad0164aa9160eacdd7ed0474e66523",
        "title": "From ancient glory to modern ghost towns, China’s urban revivals walk fine lines",
        "summary": "Few areas of China reflect the country’s decades-long economic transformation more vividly than its cities. Rapid development has turned villages into dense urban landscapes and already sizeable metro areas into some of the world’s largest population centres. As the rate of urbanisation slows and the country transitions into a new economic era, we explore how select Chinese cities are navigating the change. Read the rest of our series here.\nThere is hardly a city in China like Datong, where...",
        "source": "smcp",
        "date": "2025-10-29T07:00:16+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330638/chinas-urban-revival-and-datong-contradiction-when-planning-double-edged-sword?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fb07b95f6bb2d9fc6df0f33774b0442b8adcfc96aadfcb05335d577e783f1844",
        "title": "US bans new Chinese telecoms gear, citing national security risks",
        "summary": "The administration of US President Donald Trump on Tuesday tightened the rules on the importation, marketing and sales of new Chinese telecoms gear in the United States, a move set to haunt bilateral relations ahead of the summit of the top leaders later this week.\nThe US Federal Communications Commission (FCC) voted to block new approvals for devices with parts from companies on its “Covered List“ and also to allow it to bar previously approved equipment in certain cases.\nIt means that devices...",
        "source": "smcp",
        "date": "2025-10-29T06:47:44+09:00",
        "url": "https://www.scmp.com/news/china/article/3330692/us-bans-new-chinese-telecoms-gear-citing-national-security-risks?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "75ebf3338294e872e1b1fa705b2b26a18b4c880621c44fe3f03d9b27caa98ee7",
        "title": "Why Trump’s unpredictability and inconsistency could hamper meeting with Xi",
        "summary": "As US President Donald Trump and Chinese President Xi Jinping attempt to stabilise US-China trade relations on Thursday, a major problem unlikely to go away, no matter what the outcome, is the disjointed signalling and mixed messaging coming out of Washington, undercutting trust and confidence that any deal will even be implemented, say analysts and former officials.\nWhile governments worldwide face coordination problems, experts say the Trump administration is particularly prone to this. Also...",
        "source": "smcp",
        "date": "2025-10-29T06:43:29+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3330690/will-trumps-love-unpredictability-and-contradictions-hinder-negotiations-xi?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0553acd7b4f928c672d93eae803a7dfed79e21027ef9495e68fec906e04005f9",
        "title": "Could China’s Linglong One reactor be a game-changer for Asia?",
        "summary": "Earlier this month, China National Nuclear Corporation quietly marked a groundbreaking achievement. It announced that Linglong One – which it has billed as the world’s first commercial land-based small modular reactor – had successfully completed its “cold functional test”. This is the first comprehensive assessment of a reactor, done before fuel loading, checking how the system functions under high pressure.\nLinglong One, which has been much cheaper to construct than the larger Hualong One...",
        "source": "smcp",
        "date": "2025-10-29T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/asia-opinion/article/3330563/can-energy-hungry-asia-embrace-nuclear-power?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b6ab658804b6457ee4b2e0132f8710431882fe249494e64e9756348944abecbc",
        "title": "Chinese watching US moved more by policy, events than entrenched ideology: paper",
        "summary": "A new academic study tracking Chinese public opinion before and after the 2020 and 2024 US presidential elections suggests that the perception of the United States is related more to political changes and policy signals than to entrenched anti-American ideology.\nAnd the survey – conducted after Donald Trump won the election in November 2024, but before he returned to the White House for his second presidential term and the subsequent trade war – reveals a pivotal shift in Chinese public...",
        "source": "smcp",
        "date": "2025-10-29T00:00:11+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330617/chinese-watching-washington-moved-more-policy-events-entrenched-ideology-paper?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f3bbebbb6ed149cfa5f5c9c4b9a50d6a23b4a37aeaab68e304d45de9e4fa40e1",
        "title": "US soybean farmers’ plea; death of  leading AI scientist: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. ‘Partnership, not pressure’, US soybean farmers urge Trump before Xi talks\nIncreasingly desperate US farmers, including many who voted for US President Donald Trump, are urging him to adopt a conciliatory approach rather than a confrontational one if a lasting soy deal can be reached when he meets Chinese President Xi Jinping this week.\n2. China sees Europe...",
        "source": "smcp",
        "date": "2025-10-28T22:15:07+09:00",
        "url": "https://www.scmp.com/news/china/article/3330661/us-soybean-farmers-plea-trump-death-leading-ai-scientist-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "694a54cf9b3107069c1b94c9754405d734c5ed22ee9f186c0e7bd6d9ec527b66",
        "title": "Taiwanese increasingly reluctant to give lives to defend island, poll finds",
        "summary": "Growing numbers of Taiwanese are unwilling to give their lives to defend the island, according to a new opinion poll.\nIn a recent survey by My Formosa, respondents were asked if people should be prepared to pay any price – including death – to protect Taiwan’s status and prevent reunification with the Chinese mainland.\nThe poll found that 52.2 per cent of those questioned were unwilling to do so – an 8.4-point rise compared with a similar survey carried out two years ago – while 40.8 per cent...",
        "source": "smcp",
        "date": "2025-10-28T22:00:15+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3330641/taiwanese-increasingly-reluctant-give-their-lives-defend-island-opinion-poll-finds?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2d969fe63a8af96d9da3bc35bc7e7ec679e39dff6ce3a8ac749f38ced26b0edf",
        "title": "China expands frontiers in space, deep sea, poles amid fierce geopolitical race",
        "summary": "China’s geopolitical rivalry with the West is expanding into new frontiers – including the polar regions, outer space, cyberspace and the deep sea – as Beijing unveils a flurry of scientific milestones and state-driven ambitions that analysts say are challenging traditional Western dominance across these critical domains.\nOn Monday, China announced that its independently designed and built polar research vessel – the world’s first manned deep-sea-operations depot ship with icebreaking...",
        "source": "smcp",
        "date": "2025-10-28T22:00:10+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330611/chinas-geopolitical-competition-expands-new-frontiers-scientific-milestones?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a4a34c131a6d1d504094f5b2c631a4b99c67e2946743af6f2b30db5127d88fdf",
        "title": "China’s development model is reverberating around the world",
        "summary": "“We do not need to chase [after other countries], we are the road,” said President Xi Jinping after inaugurating a major scientific project in Sanya, Hainan province, in 2018. Xi urged scientists to push the boundaries of technological development.\nXi’s bold statement not only reflected his boundless confidence in China’s scientific community but also the wisdom of the “Made in China 2025” national economic strategy, which has produced nothing less than a technological renaissance.\nThanks to a...",
        "source": "smcp",
        "date": "2025-10-28T21:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3330495/chinas-development-model-reverberating-around-world?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "87f47e4346264df9e495940859792badaf0243d35f4d96e573360c086ebd17ac",
        "title": "China urges Japan’s new administration to take solid ‘first step’ in relations",
        "summary": "Chinese Foreign Minister Wang Yi urged Japan’s new administration to take a constructive “first step” in engaging with Beijing and to properly address sensitive issues such as Taiwan and wartime history.\nWang made the remarks during a phone call with his Japanese counterpart Toshimitsu Motegi on Tuesday – the first high-level diplomatic engagement between Beijing and Tokyo since Sanae Takaichi became Japan’s first female prime minister a week ago.\nChinese leaders, including President Xi Jinping,...",
        "source": "smcp",
        "date": "2025-10-28T20:24:26+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330654/china-urges-japans-new-administration-take-solid-first-step-relations?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a10e686b15a049ec7313fc148dd7f00ac1abd83e9ff0c044f0abee1b5d84665f",
        "title": "Caught between China and the US, Europe stumbles towards its independence day",
        "summary": "In a dramatic speech in Berlin on Saturday, European Commission President Ursula von der Leyen painted a dystopian picture of today’s world as she reiterated her calls for an independent Europe.\n“Europe is facing up to another seismic change in the way the global economy works. We may be approaching a shift in the international order – one increasingly defined by power, whether economic, technological or military,” she said.\nDeclaring a new “era of geoeconomics”, von der Leyen described unnamed...",
        "source": "smcp",
        "date": "2025-10-28T20:00:10+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330609/caught-between-china-and-us-europe-stumbles-towards-its-independence-day?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9fd8631a18f5b54d75908a71ed719abd2e88049a2b892b9ac62e135c98d4ce65",
        "title": "China-Asean free-trade pact gets upgrade as Beijing touts regional ties",
        "summary": "China and a bloc of 11 Southeast Asian countries signed an upgrade to their free-trade agreement on Tuesday, expanding its terms to cover product quality, environmental protection and help for small businesses, in a sought-after strengthening of multilateral economic ties for Beijing amid its ongoing trade war with the US.\nThe Association of Southeast Asian Nations (Asean), a group with a combined population of 680 million and a total gross domestic product of US$3.8 trillion in 2023, signed the...",
        "source": "smcp",
        "date": "2025-10-28T19:00:17+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3330635/china-asean-free-trade-pact-gets-upgrade-beijing-touts-regional-ties?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "49c10ecc189edfbefba8f0117f1a21dc7ff150e7e8e56e5f5f5b6c2b5e990bfe",
        "title": "‘Diehard’ Taiwanese lawmaker is formally investigated by mainland Chinese police",
        "summary": "Mainland Chinese police have formally initiated an investigation into Taiwanese legislator Puma Shen, marking Beijing’s latest move targeting individuals it deems to be “diehard Taiwan separatists”.\nOn Tuesday, the Chongqing Municipal Public Security Bureau in southwestern China issued a police bulletin on social media, stating Shen had “engaged in criminal activities aimed at splitting the nation by initiating and establishing the ‘Taiwan independence’ separatist organisation ‘Kuma...",
        "source": "smcp",
        "date": "2025-10-28T18:59:46+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3330631/diehard-taiwanese-lawmaker-formally-investigated-mainland-chinese-police?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "44c8153cb42bd383b010053339add80c18f722d6ae9451a06a32626a32a96f83",
        "title": "China unveils 5-year plan’s support for private sector, financial strength",
        "summary": "The Central Committee of China's ruling Communist Party has officially announced its proposals for the country's 15th five-year plan, including language that signals strategic support for the private sector and an accelerated transformation into a financial power, easing market concerns about their positions in the economy over the next five years.\nThese messages were not mentioned in the communique published last week at the end of the committee's fourth plenum.\n“The state should implement the...",
        "source": "smcp",
        "date": "2025-10-28T18:39:54+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330637/china-unveils-5-year-plans-support-private-sector-strengthening-financial-power?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8508aaa7ae95979ada5ac5e2490df393c84176ef84a9eb47808a06233fc214e3",
        "title": "Chinese GoPro rival Insta360 posts 90% jump in sales ahead of drone market foray",
        "summary": "Insta360, the Chinese rival of GoPro, recorded a 90 per cent jump in third-quarter revenue from a year earlier, as China’s leading maker of 360-degree and action cameras prepares to square off against drone giant DJI by the end of 2025.\nShenzhen-based Insta360 said its revenue in the September quarter grew 92.64 per cent to 2.94 billion yuan (US$413 million), according to the company’s filing to the Shanghai Stock Exchange on Monday.\nNet income for the period shrank 15.9 per cent to 271.9...",
        "source": "smcp",
        "date": "2025-10-28T18:30:12+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3330621/chinese-gopro-rival-insta360-posts-90-jump-sales-it-gears-enter-drone-market?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "188aa560dfcdfd28fc881bab2b5ae03f6536ae82976fe7c81f86a9243d25de38",
        "title": "Biologists find array of deep-sea survival mechanisms in Ring of Fire creatures",
        "summary": "Deep-sea animals in the Pacific Ring of Fire off Japan are rapidly growing and adapting, scientists observed in crewed submersible dives.\nCreatures in the deep, dark ocean have evolved diverse strategies to survive, adapting to varying depths and nutrient availability.\nThe team from the University of Western Australia (UWA) and Tokyo University of Marine Science and Technology published their findings gleaned from studies in the Ring of Fire – a Pacific belt that contains hundreds of active and...",
        "source": "smcp",
        "date": "2025-10-28T18:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330216/biologists-discover-ring-fire-creatures-have-array-deep-sea-survival-mechanisms?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3ec0565d23e9766e68e9175b335101b307f0d657fb8727424da0c7c3a21926a8",
        "title": "Time for China to set an explicit household consumption target",
        "summary": "The Chinese planning season is in full swing. Ahead of the formal release of the 15th five-year plan (running from 2026 to 2030) next March, early signs coming out of the just-completed fourth plenum of the Communist Party suggest that it will be more of the same: a focus on continuing China’s extraordinary industrial and technological ascendancy, driven by what President Xi Jinping has called “new productive forces”.\nThat would be a mistake in the following sense: China’s techno-industrial...",
        "source": "smcp",
        "date": "2025-10-28T17:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3330572/time-china-set-explicit-household-consumption-target?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6bd6df29b65f26717d039acf0c8e078eb15bfe3d00b71ba8dcca790dfc85dfb7",
        "title": "‘RoboCop’? Chinese policeman beats paralysis with spinal interface implant",
        "summary": "In the 1987 American action film RoboCop, protagonist Alex Murphy is a police officer in a dystopian 21st-century Detroit when he is mortally wounded and rebuilt by cybernetic enhancements so that he can keep fighting crime.\nNearly 40 years on, a Chinese policeman and a team of doctors at Jilin University have turned what once seemed a highly futuristic treatment into an encouraging new reality.\nRecently, state broadcaster CCTV reported that the Second Hospital of Jilin University earlier this...",
        "source": "smcp",
        "date": "2025-10-28T16:00:15+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330581/real-life-robocop-chinese-policeman-beats-paralysis-spinal-interface-implant?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8c7514fa666442f030e0702fc801b645c769442ee5e90b910031173e62e278f7",
        "title": "Jurassic spark: Dobot revives feathered dinosaur to take robotics beyond the factory floor",
        "summary": "Shenzhen-based robotics company Dobot has unveiled a lifelike robotic recreation of Sinosauropteryx – a small, feathered dinosaur that lived around 130 million years ago – in its latest push to broaden commercial applications of robotics beyond humanoid forms.\nThe company said in a statement on Monday that the machine, powered by multimodal interaction, environmental perception and motion-control technologies, could “walk, breathe, emit low murmurs and interact intelligently with its...",
        "source": "smcp",
        "date": "2025-10-28T15:29:42+09:00",
        "url": "https://www.scmp.com/tech/article/3330580/jurassic-spark-dobot-revives-feathered-dinosaur-take-robotics-beyond-factory-floor?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bde4abe9dc0885d1dac00cc27b101a64fafc2a5f952703f8037e3843b959e7cf",
        "title": "Why China may be banking on ‘institutional strength’ for next 5-year plan",
        "summary": "China’s “institutional strength” will help the country tackle “major tests” over the course of the next five-year plan, analysts and state media have said.\nThe country’s latest development plan, which is due to start next year and run until 2030, comes at a time when Beijing is facing increasing obstacles to its long-term ambitions both at home and abroad – particularly its intense rivalry with the United States.\nChina’s first five-year plan was introduced in 1953. The country has since...",
        "source": "smcp",
        "date": "2025-10-28T15:16:02+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3330584/why-china-may-be-banking-institutional-strength-implement-next-5-year-plan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2bf83fb130236184e043c44a8832c43858ad9cdf61ad5bc7cc44f05c7b0d6cf2",
        "title": "Beijing slams UK’s ‘unilateral’ sanctions on 11 Chinese companies",
        "summary": "China has denounced the United Kingdom for sanctioning 11 Chinese companies over “alleged connections” with Russia despite Beijing’s diplomatic objections, warning the move could damage the UK-China relationship.\n“The UK’s actions constitute unilateral sanctions that lack both a basis in international law and authorisation from the United Nations,” China’s Ministry of Commerce said in a statement on Monday.\nBeijing urged London to “immediately correct its mistake and lift the sanctions on the...",
        "source": "smcp",
        "date": "2025-10-28T14:23:38+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330576/beijing-slams-uks-unilateral-sanctions-11-chinese-firms-over-russia-links?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ba3ccb2befcf77072b9519d0ae88854a5d936acc1a089fb2147efa09e35dc02f",
        "title": "HSBC’s third-quarter profit dips amid falling rates, property slump",
        "summary": "HSBC Holdings’ third-quarter profit missed analysts’ forecasts, as falling interest rates amid a property slump combined with a one-off provision to weigh on the balance sheet of the largest banking group in Europe and Hong Kong ranked by assets.\nNet profit fell 25 per cent to US$4.58 billion, or 28 US cents per share, in the quarter that ended in September, HSBC said on Tuesday. The result missed the US$5.38 billion consensus in a survey of 18 analysts conducted in mid-October, before the...",
        "source": "smcp",
        "date": "2025-10-28T13:30:58+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3330568/hsbc-profit-slides-amid-falling-interest-rates-weak-commercial-property-market?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8913721ca435ec094816b627822c2c3c757aa51d1a98a2f0c851b15d8cfd4dc2",
        "title": "The new narrative: how China is telling its own story",
        "summary": "",
        "source": "smcp",
        "date": "2025-10-28T13:24:48+09:00",
        "url": "https://www.scmp.com/news/china/series/3330566/new-narrative-how-china-telling-its-own-story?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b82d3ec914f47beb5387a9ffffd0b2319944a0f48a5f6239cf157b9ea9e68cca",
        "title": "China sees Europe as indispensable force for stable multipolar world: envoy",
        "summary": "This month, the Post’s Xiaofei Xu sat down with Deng Li, China’s ambassador to France and Monaco, for an in-depth and wide-ranging interview. In part one, Deng outlines China’s diplomatic strategy in Europe.\nChina would like to see France lead Europe to become a truly independent power to help build a stable multipolar world, Beijing’s top diplomat to France told the South China Morning Post in an exclusive interview.\nStriking a positive tone on relations between Beijing and Paris despite...",
        "source": "smcp",
        "date": "2025-10-28T13:00:29+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330553/china-sees-europe-indispensable-force-stable-multipolar-world-amid-uncertainty?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8443392720d9428b4f149c02ddf49cf0fef3b0988d8c7ae516b10c68976d6b0c",
        "title": "Leading Chinese AI researcher Liu Haolin dies aged 37 after brief illness",
        "summary": "Academics and students have paid tribute to Liu Haolin, a leading computer scientist who died at the age of 37 after a sudden illness.\nAn obituary published online said that Liu, a professor at Xiangtan University in the central province of Hunan, had died in a hospital in Changsha on Saturday.\nThe obituary added that a memorial ceremony had been held the following day in the neighbouring city of Ningxiang.\nHis university also published its own obituary and changed his profile picture on its...",
        "source": "smcp",
        "date": "2025-10-28T13:00:17+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330505/leading-chinese-ai-researcher-liu-haolin-dies-aged-37-after-brief-illness?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "37baac4d379de9bf7bd87eb2cce67042b555ae76917dd3207ff77d838deb1f2c",
        "title": "US senators call on Trump to show support for Jimmy Lai in meeting with Xi",
        "summary": "A bipartisan group of 38 US senators is urging President Donald Trump to use his expected summit with Chinese President Xi Jinping in South Korea next week to secure the release of former Hong Kong media mogul Jimmy Lai Chee-ying, the latest in the US Congress’s efforts to get human rights on the agenda of the high-stakes meeting.\nIn a letter released on Friday, the lawmakers described Lai as a political prisoner and said the case for his release was “more dire than ever” due to his worsening...",
        "source": "smcp",
        "date": "2025-10-28T11:48:11+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3330287/us-senators-call-trump-raise-jimmy-lai-concerns-xi-key-meeting?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6ea64ce77ce1513e87e3e3c58dc832c08f1a6a734875fb830e37c112909e0dee",
        "title": "China minted a new billionaire a day last year, Hurun’s Rich List says",
        "summary": "China saw a remarkable increase in the number of ultra-wealthy individuals over the past year, driven by a bull market in stocks, with leaders of “new economy” companies emerging as the primary beneficiaries, according to the Hurun Research Institute.\nA record 1,434 individuals made it onto Hurun’s latest China Rich List, each having a net worth of at least 5 billion yuan (US$702 million). This marked an increase of 340 individuals, or 31 per cent, from the previous year.\nThe collective wealth...",
        "source": "smcp",
        "date": "2025-10-28T11:00:26+09:00",
        "url": "https://www.scmp.com/business/article/3330544/rich-list-chinas-billionaire-count-hits-record-stock-markets-surge?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c000f44ba2ad26aaa193d9562b1ad37bde23c68428fbcfd5b94d019dec7d95e6",
        "title": "KMT accuses Taiwan government of erasing Chiang Kai-shek after army hall renamed",
        "summary": "Taiwan’s army has renamed the main auditorium of its headquarters in what is widely seen as another move by the Democratic Progressive Party (DPP) government to erase the legacy of late Kuomintang leader Chiang Kai-shek and the island’s historical ties to mainland China.\nThe auditorium, known for decades as Chiang Kai-shek Hall, has been retitled Loyalty Hall, according to the Army Command Headquarters.\nThe change sparked uproar from opposition lawmakers, who accused the government of quietly...",
        "source": "smcp",
        "date": "2025-10-28T11:00:21+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3330509/kmt-accuses-taiwan-government-erasing-chiang-kai-shek-legacy-after-army-hall-renamed?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1166295edd87daf2562e4383f27cbe7d57ff6241c9766e86e97292a05f34804f",
        "title": "When mines run dry: why some Chinese cities are racing to reinvent themselves",
        "summary": "Few areas of China reflect the country’s decades-long economic transformation more vividly than its cities. Rapid development has made villages into dense urban landscapes and already sizeable metro areas into some of the world’s largest population centres. As the rate of urbanisation slows and the country transitions into a new economic era, we explore how select Chinese cities are navigating the change. Read the rest of our series here.\nOnce a remote industrial powerhouse forged deep in the...",
        "source": "smcp",
        "date": "2025-10-28T07:00:13+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330490/chinas-old-industrial-cities-race-reinvent-themselves-rapidly-changing-economy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "36818f268dce3c033389b6eeca4d7300eb821fe4addc2e64c9bbab4e34841691",
        "title": "China is spearheading a new phase of globalisation",
        "summary": "China’s 15th five-year plan is more than a policy blueprint; it is a pivotal turning point. This plan and the next one will define an era of innovation-led growth, solidifying China’s status as a major power and peer competitor to the United States.\nSince the reform and opening-up policy was launched, China’s economic development has had distinct phases. The 1978-1992 period marked the initial stage of opening up. Reform and opening-up was imperative in the wake of economic challenges after the...",
        "source": "smcp",
        "date": "2025-10-28T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3330435/chinas-transition-global-powerhouse-hinges-more-innovation?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "74b02b99bb38bfb2aa41196bb347f53065b38cd92730f0cff62ef1e9ee4c505d",
        "title": "‘Partnership, not pressure’, US soybean farmers urge Trump before Xi talks",
        "summary": "Increasingly desperate US farmers, including many who voted for US President Donald Trump, are urging him to adopt a conciliatory approach rather than a confrontational one if a lasting soy deal can be reached when he meets Chinese President Xi Jinping this week.\nAs the harvest season slips by with no orders from China and rising input costs – from equipment to fertiliser – farmers say partnership, not strong-arming Beijing, would serve both sides better.\nMany voiced frustration at Washington’s...",
        "source": "smcp",
        "date": "2025-10-28T04:50:27+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3330537/us-soybean-farmers-urge-trump-choose-partnership-not-pressure-ahead-xi-meeting?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "10fa1877ac53e3377d788dd2ce23d49fada13911a62fa0b4ea2f120e5e9abfe7",
        "title": "Freed French cyclist describes ‘strange experience’ after Russian detention",
        "summary": "A French cyclist freed after weeks in a Russian jail for illegally crossing the border on Monday described his time in the country as a “rather strange experience” but said the Russians he met were “friendly”.\nSofiane Sehili, 44, was arrested on the Russian-Chinese border in early September while attempting to break the record for the fastest endurance cycle from Lisbon to Vladivostok.\nSehili, who describes himself as an ultra-endurance racer and adventure cyclist, had faced two years in a...",
        "source": "smcp",
        "date": "2025-10-28T04:03:13+09:00",
        "url": "https://www.scmp.com/news/world/russia-central-asia/article/3330536/french-cyclist-freed-russia-says-detention-was-strange-experience?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e515380fb24d0fd999338b31228e2a176c9b2b95a893c91a0a21b6aa6af02b8e",
        "title": "German foreign minister urges ‘fair’ rare earth, chip trade with China",
        "summary": "German Foreign Minister Johann Wadephul on Monday called for “fair” trade with China in chips and rare earth minerals, amid heightened tensions between China and the European Union.\nWadephul, who last week was forced to cancel a planned visit to China, said he planned to speak to Chinese representatives by phone “as soon as possible and reschedule the trip”.\n“It’s only postponed, not cancelled,” Wadephul said of the visit.\nGermany called off the trip after the Chinese side were unable to confirm...",
        "source": "smcp",
        "date": "2025-10-28T02:10:20+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330532/german-foreign-minister-urges-fair-rare-earth-chip-trade-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f442a16d3d6190dd15cbc7ca9541dd186bea53fa79a1d6fb5cdf536d93130310",
        "title": "China doubles down on crypto crackdown as central bank vows to expand digital yuan",
        "summary": "China on Monday reaffirmed its hardline approach towards virtual currencies at home, warning of the risks of stablecoins, despite growing concerns that the United States might have consolidated its US dollar dominance through them.\nInstead, the world’s second largest economy vowed to broaden the use of its central bank digital currency known as e-CNY, according to Pan Gongsheng, governor of the People’s Bank of China.\n“[Stablecoins] are still in their early stages of development,” said Pan,...",
        "source": "smcp",
        "date": "2025-10-28T00:36:10+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3330525/china-doubles-down-crypto-crackdown-central-bank-vows-expand-digital-yuan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "64235c4e2c35667fe5c8e9b32972e29e8a5991216aee99fc2cf2fb7626f4c47b",
        "title": "‘Hawkish’ interpretations rise as US, China discourse gets lost in translation",
        "summary": "Would the Cold War have unfolded differently if Nikita Khrushchev had chosen a different interpreter? It is a decades-old thought experiment, born of the phrase translated as “we will bury you”, but it is chiming with today’s strategic rivalry between China and the US.\nWhether the statement, attributed to the then-leader of the Soviet Union in 1956, should instead have been interpreted as the less aggressive “we will outlive you”, the incident sheds light on a recurrent headache in modern...",
        "source": "smcp",
        "date": "2025-10-28T00:00:15+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330459/hawkish-interpretations-rise-us-china-discourse-gets-lost-translation?utm_source=rss_feed",
        "reportUrl": ""
    }
]