[
    {
        "id": "10f409c3d4213e61bcf2ab6763e687d122c8b45aff3e12aeeba6db1e7b51a09b",
        "title": "China says Philippine ship deliberately hit coastguard boat near disputed shoal",
        "summary": "China’s coastguard says a Philippine ship deliberately collided with one of its vessels in a confrontation near the disputed Scarborough Shoal on Tuesday, as tensions escalate in the South China Sea.\nThe coastguard used water cannons and other “control measures” against the Philippine vessels it said were conducting “illegal activities” in the area.\nIt is the latest flare-up between the rival claimants to the atoll – known as Huangyan Island in China and Panatag Shoal in the Philippines – and...",
        "source": "smcp",
        "date": "2025-09-16T15:00:15+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3325684/china-says-philippine-ship-deliberately-hit-coastguard-vessel-near-scarborough-shoal?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ee07a201e9f25d2f6a7d9464c24a26e7c07b062e47ad5ad6e3bcaeaecd637819",
        "title": "China’s Xi calls for building unified market to ‘secure an edge’ in global race",
        "summary": "President Xi Jinping has called for more efforts to develop a unified domestic market, arguing that it will be crucial to helping China secure an edge in international competition and meet its development goals.\nIn an article published on Monday in Qiushi, the ruling Communist Party’s leading theoretical journal, the Chinese leader listed six key tasks, with measures to deal with excessive cutthroat competition at the forefront.\nVicious price wars have broken out in several industries in recent...",
        "source": "smcp",
        "date": "2025-09-16T13:30:10+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3325680/chinas-xi-calls-building-unified-market-secure-edge-global-race?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "09bec66f9ee78ebaf5e9e835f885c499257e9af79347b4d9ca7c1180a1e814c0",
        "title": "Red flags, eagles and the east wind: how Mao inspired Chinese missile names",
        "summary": "As the West speculated about the capabilities of Chinese missiles seen at its huge military parade in Beijing this month, it was their names – inspired by the words of Mao Zedong – that drew attention in China.\nThe People’s Liberation Army revealed some of its newest weaponry during the September 3 parade that marked 80 years since the end of World War II.\nAmong the most talked about were the latest additions to the Dongfeng series of strategic missiles, with the land-based DF-61, DF-31BJ and...",
        "source": "smcp",
        "date": "2025-09-16T13:00:11+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3325664/red-flags-eagles-and-east-wind-how-mao-zedong-inspired-chinese-missile-names?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5a70fd6852e17f0b6fc8f1aa6844b34ee29dd791fed4211db2760220d02323a5",
        "title": "Shares in Chinese lidar-sensor maker Hesai rise in Hong Kong debut",
        "summary": "Shares of Hesai Group, the world’s largest supplier of lidar sensors, rose in their Hong Kong debut on Tuesday as investors tapped into the offering amid a slew of blockbuster deals in the city’s listing pipeline.\nTrading under the code 2525, Hesai’s shares opened at HK$229.20, a premium of 7.7 per cent to the offer price of HK$212.80 per share.\nThe company sold 19.55 million shares, including 2.55 million shares through the full exercise of the offer size adjustment option, raising about...",
        "source": "smcp",
        "date": "2025-09-16T10:35:58+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3325653/chinas-hesai-rises-hong-kong-share-debut-lidar-sensor-maker-raises-us531-million?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0dc6a3257d71648e57f453dfae151c2687d45013cc28bb58225101453959b2ea",
        "title": "Is Taiwan’s military ready for its overdue arms deliveries?",
        "summary": "Next year will see Taiwan take delivery of some big-ticket US weapons – including more M1A2T Abrams tanks and MQ-9B SkyGuardian drones – from a nearly US$22 billion long-delayed package of arms sales.\nThe shipments will mark the highest annual volume of arms arrivals in years, significantly strengthening Taiwan’s deterrence and war-fighting capacity amid mounting threats from Beijing, according to two reports recently submitted to the legislature by the island’s defence ministry.\nOne report on...",
        "source": "smcp",
        "date": "2025-09-16T10:00:13+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3325630/taiwans-overdue-us-arms-orders-will-arrive-soon-are-its-forces-ready?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8974beff25559eabc6d6462878c90c9670cc718d7c91d47f5091c81eceb98f98",
        "title": "China’s moment to rewire the world is arriving. What will it do?",
        "summary": "Earlier this month, Anthropic, the American artificial intelligence company, entered the US-China fight. It barred companies from using its AI services if they were more than 50 per cent owned by Chinese entities. This was a double punch – China’s access to American technology hit another obstacle, and the global business world was prodded again to reject Chinese investment.\nJust a few months ago, Anthropic’s move would have knocked the wind out of China. But the recent Shanghai Cooperation...",
        "source": "smcp",
        "date": "2025-09-16T07:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3325174/chinas-moment-rewire-world-arriving-what-will-it-do?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f49436178dc1f9bea9cc5969b109a1a2359b6991d2405f6b32864599348def2e",
        "title": "China’s satellite spies on US spycraft in a ‘tit-for-tat’ orbital standoff",
        "summary": "In a notable display of reconnaissance capabilities, a Chinese satellite has observed an American satellite that was itself monitoring China’s space station and high-value satellite, a move analysts described as a strategic tit-for-tat in an increasingly contested space domain.\nChina’s Jilin-1 satellite constellation, operated by Chang Guang Satellite Technology, seized a favourable orbital window on September 8 to capture four images of the WorldView Legion satellite from distances ranging...",
        "source": "smcp",
        "date": "2025-09-16T07:00:12+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3325624/us-satellite-spies-chinese-space-station-and-more-china-spies-back?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9aca4a1894d1b414cd7d71394cbaaa276357eea7bf3ff33bf5fc69f7392abffe",
        "title": "Chinese envoy calls out Trump for eroding institutions, breaking norms",
        "summary": "A senior Chinese diplomat implicated the United States on Monday for holding back developing countries and called on Washington to stop tearing down global institutions.\nThe comments in New York by Fu Cong, Beijing’s ambassador to the United Nations, did not mention the US by name. But his remarks appeared clearly directed at the administration of US President Donald Trump, with its focus on eroding institutions worldwide and breaking norms.\n“Unilateralism, driven by some countries, is wearing...",
        "source": "smcp",
        "date": "2025-09-16T06:31:07+09:00",
        "url": "https://www.scmp.com/news/us/article/3325650/chinese-envoy-calls-out-trump-administration-eroding-institutions-breaking-norms?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6cd9528528cc2abfa7741fdf2013331b75f0fd326eb96dc6ef8a9b785b32d43e",
        "title": "JPMorgan to cut China, India share in flagship emerging-market index",
        "summary": "JPMorgan Chase will cut the weight of the largest bond issuers in its flagship emerging-market index, diverting investor flows from the likes of China and India towards smaller nations.\nThe Wall Street bank will gradually lower the issuer cap on its GBI-EM Global Diversified index in the first half of 2026, according to a client notice seen by Bloomberg.\nThe limit will fall to 9 per cent from 10 per cent currently, with the implementation to be phased over a period of several months, the...",
        "source": "smcp",
        "date": "2025-09-16T05:25:46+09:00",
        "url": "https://www.scmp.com/news/article/3325648/jpmorgan-cut-china-india-share-flagship-emerging-market-index?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4ccba6626acec5a3b2d981fb616811c28522231fcb88d1a5da91a045ccecd41f",
        "title": "China’s economy strains, Beijing’s oil threat vow: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. China’s economy strains in August as retail sales, industrial output miss forecasts\nChina’s economy showed signs of strain in August, as sluggish domestic demand, headwinds from the US trade war and a prolonged property downturn continued to weigh on several major indicators.\n2. Zheng Yongnian on why China must look beyond the West to build a better AI\nThe...",
        "source": "smcp",
        "date": "2025-09-15T23:25:12+09:00",
        "url": "https://www.scmp.com/news/china/article/3325638/chinas-economy-strains-august-beijings-oil-threat-vow-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cec68a7548aa56f0b7e4ed779c996b2a26caf86c19d46e13ef9529c031a565ff",
        "title": "Why younger Europeans can see their futures in China, despite the obstacles",
        "summary": "This year marks half a century of formal diplomatic relations between China and the European Union as well as the 25th anniversary of the founding of the European Union Chamber of Commerce in China. The fourth in a series of reports examining ties between the two powers reveals a shift underway in the attitudes of younger Europeans towards China and the opportunities it offers.\nMore than two years after stringent Covid-19 restrictions prompted an exodus of foreigners from China, there are...",
        "source": "smcp",
        "date": "2025-09-15T23:00:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3324879/enduring-opportunity-why-younger-europeans-can-see-their-futures-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3d17de18424b91d2940b5501df80b98e5c44fa5f72ac2c80dcae6ad1e7fd9eab",
        "title": "China launches further probe into Nvidia's anti-trust violations",
        "summary": "China launches further probe into Nvidia's anti-trust violations",
        "source": "cgtn",
        "date": "2025-09-15T21:56:12+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/China-launches-further-probe-into-Nvidia-s-anti-trust-violations-1GGZNPShA1W/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b4d4db31125632ec5a114d3114315a884b169b67c3a62694a03f35953a946876",
        "title": "China vows retaliation for US tariff threats over its Russian oil trade",
        "summary": "Beijing on Monday slammed US calls for its allies to impose tariffs on China over its oil trade with Russia, warning of swift retaliation if its interests are undermined.\n“China will take resolute countermeasures to protect its sovereignty, security, and development interests if its legitimate rights and interests are harmed,” Chinese foreign ministry spokesman Lin Jian said during a regular press conference on Monday.\nHe added that Beijing strongly rejected the imposition of illegal unilateral...",
        "source": "smcp",
        "date": "2025-09-15T21:40:50+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3325629/china-vows-retaliation-us-tariff-threats-over-its-russian-oil-trade?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d5ce31651a4168ecd776822f74f80dd0e337146c197abeb3ebf1da902dc5bc21",
        "title": "China, US reach ‘framework’ on TikTok; Xi and Trump to speak on Friday",
        "summary": "China has confirmed that a framework agreement has been reached with the United States on resolving TikTok-related issues, while stressing that the “hard-won” results should not be accompanied by continued “suppression” of Chinese companies.\n“The two sides held candid and in-depth exchanges and reached a basic framework consensus on properly resolving relevant issues concerning TikTok through cooperation, on reducing barriers to investment and on promoting relevant trade and economic...",
        "source": "smcp",
        "date": "2025-09-15T21:37:25+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3325628/trump-teases-possible-deal-tiktok-plans-call-xi?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c1ab1a00be455e75a67a4486b8622b8b0f139606aa4d582fd35999e60c91e6e9",
        "title": "Charlie Kirk’s killing poses a question for nationalism in US – and China",
        "summary": "A young Winston Churchill once warned: “The wars of peoples will be more terrible than those of kings.” In our current moment, this warning feels less like prophecy and more like diagnosis. Across the globe, nationalism is no longer a quiet undercurrent; it is a dominant force shaping identities, policies and personal destinies. And nowhere is this more visible than in the two most influential powers of our time, the United States and China.\nIn the US, the death of Charlie Kirk, a young...",
        "source": "smcp",
        "date": "2025-09-15T21:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3325534/why-charlie-kirks-killing-holds-warning-world?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b872db27c6381dae22daf407ee70d25de213438aa99da007e7421904a1abce0e",
        "title": "Nepal has been mired in turmoil. What does this mean for relations with China?",
        "summary": "China’s swift recognition of Nepal’s interim government reflects Beijing’s interest in regional stability, according to analysts who said that the political transition was unlikely to have a significant impact on relations between the two countries.\nFormer chief justice Sushila Karki was sworn in as the country’s interim leader on Friday after days of tumultuous protests forced prime minister K.P. Sharma Oli to resign earlier in the week.\nKarki is the first woman to hold the position as well as...",
        "source": "smcp",
        "date": "2025-09-15T21:00:14+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3325620/nepals-political-turmoil-not-expected-have-major-impact-relations-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "25712475c466816f6e2674aaed971e3aac269e2e5a9ff3d391f8e685831dbf01",
        "title": "Step into Liuxing Street, where Xinjiang's cultures truly shine",
        "summary": "Step into Liuxing Street, where Xinjiang's cultures truly shine",
        "source": "cgtn",
        "date": "2025-09-15T20:47:32+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Step-into-Liuxing-Street-where-Xinjiang-s-cultures-truly-shine-1GGHeSB0xSo/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "209349fb59ac0c50bb10dff46fd657d6768ea1535fd4803f1b2567cc3c97dc37",
        "title": "China issues rules on Chinese employees in foreign diplomatic missions",
        "summary": "China issues rules on Chinese employees in foreign diplomatic missions",
        "source": "cgtn",
        "date": "2025-09-15T20:02:00+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/China-issues-rules-on-Chinese-employees-in-foreign-diplomatic-missions-1GGR5pJcdRC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "5f77de32bc5dafa5385df390ed89ac89191c8631735d0c909b92be5713ad4a19",
        "title": "China: Trade and energy cooperation with Russia is beyond reproach",
        "summary": "China's normal trade and energy cooperation with all countries – including Russia – is justified, legitimate, and beyond reproach, Chinese foreign ministry spokesperson Lin Jian said on Monday.",
        "source": "cgtn",
        "date": "2025-09-15T20:00:44+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/China-Trade-and-energy-cooperation-with-Russia-is-beyond-reproach-1GGQ3OiRGzC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f59c2a7f5ecf51eb014d461a2122ce87e896866f1a24660a6bcd9591e2de3dd5",
        "title": "Already world’s top energy-storing nation, China to supercharge capacity by 2027",
        "summary": "China, which already boasts the world’s largest energy-storage capacity, is set to nearly double that level by 2027, with an anticipated investment of 250 billion yuan (US$35 billion), according to Beijing’s latest action plan.\nAs outlined in the action plan, China’s “new-energy storage system” capacity – primarily based on lithium-ion batteries – is set to exceed 180 gigawatts within two years, up from 95GW as of June.\nReleased jointly by the National Development and Reform Commission and the...",
        "source": "smcp",
        "date": "2025-09-15T20:00:08+09:00",
        "url": "https://www.scmp.com/economy/economic-indicators/article/3325610/china-supercharge-energy-storage-tech-world-leading-advancements-2027?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1317c557f18453853586b66c332e6cb5c02a1618b1ef07617aba4c5d24e502df",
        "title": "China mandates 1-hour reporting for serious cybersecurity incidents",
        "summary": "China’s top internet regulator has rolled out new rules for the rapid reporting of cybersecurity breaches and major incidents involving critical information infrastructure.\nNetwork operators must report “particularly serious” cybersecurity incidents within one hour to relevant authorities, according to the draft regulation announced by the Cyberspace Administration of China on Monday.\nThe measures are due to come into effect on November 1.\nThis comes less than a week after Chinese cyber...",
        "source": "smcp",
        "date": "2025-09-15T19:34:54+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3325596/chinas-internet-watchdog-mandates-1-hour-reporting-serious-cybersecurity-incidents?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "391b3d4e1144e1c1044b4e45ed48d17ca205659612846ddcd7c2719351d8abcd",
        "title": "Pakistan leader pledges deeper China defence ties during rare jet factory visit",
        "summary": "Pakistani President Asif Ali Zardari has become the first foreign state leader to visit China’s largest military aviation manufacturer, pledging stronger defence industry ties between Islamabad and Beijing, according to Pakistan’s presidential office.\nOn Sunday, Zardari visited the advanced aircraft complex of China’s state-owned aerospace and defence giant, Aviation Industry Corporation of China (AVIC), in Chengdu, touring the production line that produces the J-10C fighter jet that played a...",
        "source": "smcp",
        "date": "2025-09-15T19:29:43+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3325609/pakistan-president-pledges-deeper-china-defence-ties-during-rare-jet-factory-visit?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bd734508e93a606ce363aacf8f4490902f8e882e2885087dcc4dcb1461ffcde4",
        "title": "Xinjiang color palette: A land of football and sweetness",
        "summary": "Xinjiang color palette: A land of football and sweetness",
        "source": "cgtn",
        "date": "2025-09-15T18:37:09+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Xinjiang-color-palette-A-land-of-football-and-sweetness-1GGG6w4NfLG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ddccc1898d27daea1a1a3d96fe18fc09dc893c33ac1eb302aeccfb3b13c2eb6a",
        "title": "Chinese woman detained for assaulting security guard at Shenzhen metro",
        "summary": "A woman has been detained for assaulting a security guard at a metro station in China’s Shenzhen. The woman refused to undergo a mandatory security check at the gate.",
        "source": "smcp",
        "date": "2025-09-15T18:30:09+09:00",
        "url": "https://www.scmp.com/news/china/article/3325593/chinese-woman-detained-assaulting-security-guard-shenzhen-metro?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0b17fa6f4134eeb8baa43f190248dac892dfbc9144fbed4ac427e5b4274f47a4",
        "title": "Amateur Taklimakan Rally: A fusion of sport and tourism",
        "summary": "An amateur edition of the Taklimakan Rally has taken place from Aksu in Xinjiang to Bishkek, the capital of Kyrgyzstan.",
        "source": "cgtn",
        "date": "2025-09-15T17:53:35+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Amateur-Taklimakan-Rally-A-fusion-of-sport-and-tourism-1GGK104jebS/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f64446e263740841bf7a94793ea7f998012bd64da0f78d28401b41093e5e35e0",
        "title": "China finds US chip giant Nvidia violated anti-monopoly law",
        "summary": "China’s antitrust regulator said on Monday it found Nvidia in violation of the country’s anti-monopoly law and would proceed with further investigation, which could lead to punitive actions against the American chipmaker amid escalating technology rivalry with the US.\nThe State Administration for Market Regulation (SAMR) said in a one-line statement that Nvidia violated both antitrust laws and the Chinese government’s terms of approval for the company’s acquisition of Israeli interconnect...",
        "source": "smcp",
        "date": "2025-09-15T17:35:31+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3325595/tech-war-china-finds-us-chip-giant-nvidia-violated-anti-monopoly-law?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b2e5c40b16ef7b6a02a245d609f843173e7315d77ee1e254eeddc25f64a50545",
        "title": "Serbian Vice President hails Xinjiang as key Belt & Road bridge",
        "summary": "Amid the vibrant setting of the 2025 Legislators Forum for Friendly Exchanges in Xinjiang, Edin Djerlek, vice president of Serbia’s National Assembly and deputy president of the Justice and Reconciliation Party, shared his insights as one of the event’s highest-ranking delegates. Following a keynote address and a special visit to Ili with fellow international lawmakers, he offered a powerful testimony of his experience.",
        "source": "cgtn",
        "date": "2025-09-15T17:34:41+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Serbian-Vice-President-hails-Xinjiang-as-key-Belt-Road-bridge-1GGk9XY1TDq/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "6a51cae7e03dcbc1c2c62e9ed99431827c01be95ce8c4a37ca3afc6b8b4cf0e4",
        "title": "Chinese, U.S. teams reconvene for 2nd day of trade talks in Madrid",
        "summary": "Chinese, U.S. teams reconvene for 2nd day of trade talks in Madrid",
        "source": "cgtn",
        "date": "2025-09-15T17:34:39+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Chinese-U-S-teams-reconvene-for-2nd-day-of-economic-trade-talks-in-Madrid-1GGJc7opYVG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "6cc146b964e60ac5778ee37bec4a94c4f9b303b7c90d7353aa6a27262de478db",
        "title": "Melodies without borders: A harmonious connection",
        "summary": "Listening to \"Jasmine Flower\" envelops you in tender Chinese warmth, while \"Kalinka\" ignites with a fiery Russian passion. Although language may initially seem like a barrier, after a game or a song, the choir forges a connection that transcends words, joining everyone in harmony.",
        "source": "cgtn",
        "date": "2025-09-15T17:32:30+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Melodies-without-borders-A-harmonious-connection-1GGEB5Vi9mE/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "30f52b8dd9df1fa8e82d3cfaf977e4a29f9c98ea3e4c1630aeea9a405ef41434",
        "title": "Why China launched probe into US chips – and what it means for domestic firms",
        "summary": "China has launched an anti-dumping investigation into analogue integrated circuit (IC) chips imported from the United States, saying they have “lowered and suppressed” the prices of domestic alternatives.\nThe probe, requested by a provincial semiconductor association, was announced on Saturday, a day after Washington introduced its latest tech curbs on Chinese companies – and a day before the two economic powers began their fourth round of trade talks in Spain on Sunday.\nIn this explainer, the...",
        "source": "smcp",
        "date": "2025-09-15T17:31:06+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3325594/why-china-launched-anti-dumping-probe-us-chips-and-what-it-means-domestic-firms?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "467005344a179020eac06d300d5d83330ee1ea5f506da19bcff6f7ef8926eb11",
        "title": "China-South Korea ties: foreign minister meet smooths path for Xi to visit Seoul",
        "summary": "South Korea's Foreign Minister Cho Hyun will visit China on Wednesday and Thursday amid the prospect of China’s president visiting Seoul next month and the expected appointment of a new South Korean ambassador to Beijing.\nCho will meet Chinese Foreign Minister Wang Yi to discuss various plans, including Chinese President Xi Jinping’s visit to South Korea for the Asia-Pacific Economic Cooperation (Apec) leaders’ summit on October 31 and November 1, according to Reuters, which cited a statement...",
        "source": "smcp",
        "date": "2025-09-15T17:11:53+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3325588/china-south-korea-ties-foreign-minister-summit-smooths-path-xi-jinping-visit-seoul?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9adf84ebb501245c3758b96875b79e11f3076d9921b6fe35706868ec021e0329",
        "title": "U.S. Treasury secretary on TikTok deadline extension: 'we will see'",
        "summary": "U.S. Treasury secretary on TikTok deadline extension: 'we will see'",
        "source": "cgtn",
        "date": "2025-09-15T17:06:23+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/U-S-Treasury-secretary-tells-CGTN-regarding-TikTok-extension-We-will-see--1GGGYaMawkU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "3d19e1ec7f10607e6966f2ae502e54fa59f3876a9e60b890a26b7a1fd0b9e1c6",
        "title": "Chinese, U.S. teams reconvene for 2nd day of economic, trade talks in Madrid",
        "summary": "Chinese, U.S. teams reconvene for 2nd day of economic, trade talks in Madrid",
        "source": "cgtn",
        "date": "2025-09-15T16:34:17+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Chinese-U-S-teams-reconvene-for-2nd-day-of-economic-trade-talks-in-Madrid-1GGEZxmPCw0/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a53a21641b1b78659534a919a8a404f5c9d012ba32bd7e357754114691d26634",
        "title": "Chinese, U.S. teams reconvene for 2nd day of trade talks in Madrid",
        "summary": "Chinese, U.S. teams reconvene for 2nd day of trade talks in Madrid",
        "source": "cgtn",
        "date": "2025-09-15T16:21:28+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/news-1GGE5aI285W/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d072037cc79ab320b9e3e320b7572f023190ad62edf42843259a180ee4f2d41d",
        "title": "Russian lawmaker marvels at Xinjiang's thriving schools and bazaars",
        "summary": "In the heart of Urumqi, at the 2025 Legislators Forum for Friendly Exchanges, CGTN reporter Liu Mohan met with Maria Butina, member of the State Duma Committee on International Affairs of Russia, for an exclusive conversation about her exciting journey through Xinjiang.",
        "source": "cgtn",
        "date": "2025-09-15T16:16:00+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Russian-lawmaker-marvels-at-Xinjiang-s-thriving-schools-and-bazaars-1GGC2NtwK0o/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b8f996d85790424591f55a80d3fe440da319913e49bbc8b5ea02c22a92c86e21",
        "title": "Chinese officials arrive at venue to continue talks with U.S. in Spain",
        "summary": "Chinese officials arrive at venue to continue talks with U.S. in Spain",
        "source": "cgtn",
        "date": "2025-09-15T15:49:07+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Chinese-officials-arrive-at-venue-to-continue-talks-with-U-S-in-Spain-1GGs3MWouRi/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "3e043843cb0b16b2b21818d99a0b19f235cf4b2f424a79a5e0397d8c2f4dd391",
        "title": "Graphics of August: China's economy is generally steady",
        "summary": "Graphics of August: China's economy is generally steady",
        "source": "cgtn",
        "date": "2025-09-15T15:48:11+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Graphics-of-August-China-s-economy-is-generally-steady-1GGvkshWdPO/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "81edddb9066c40ad85d1615529964df854b2eb58bcf9b07b58e14ae42c16fcaf",
        "title": "'Play every game like it's your last and never fear defeat'",
        "summary": "'Play every game like it's your last and never fear defeat'",
        "source": "cgtn",
        "date": "2025-09-15T15:44:25+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/-Play-every-game-like-it-s-your-last-and-never-fear-defeat--1GGuPtVBHEs/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "8e6fbbfcb8ca466dd76127bdbc9ab1129470c43d73b518210ba65a0a6c4c3585",
        "title": "China’s stock rally set to run on as savings pour into equities",
        "summary": "Households continued to shift money into mainland China’s US$12.7 trillion stock market last month, suggesting that a rally in equities has room to run, according to data published by the central bank.\nDeposits at non-banking financial institutions rose by 1.17 trillion yuan (US$164.3 billion) in August, marking a second month of increases after July saw an inflow of 2.15 trillion yuan, data from the People’s Bank of China showed. The figure covers money parked at brokerages, mutual-fund...",
        "source": "smcp",
        "date": "2025-09-15T15:30:09+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3325555/chinas-stock-rally-poised-run-household-savings-pour-equities?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "034f5498200e6dbc74fe3c1f54c6b96acc14a722df97972f3c2c8e06d14b9381",
        "title": "Graphics: Xinjiang's rapid economic development over 70 years",
        "summary": "Graphics: Xinjiang's rapid economic development over 70 years",
        "source": "cgtn",
        "date": "2025-09-15T15:18:13+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Graphics-Xinjiang-s-rapid-economic-development-over-70-years-1GGiBSw1vX2/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0fb55d3c03090630c3f16bcab626ff6e4dcfad3054bf24fb9b1de3f3b9c35e1d",
        "title": "China mulls converting coal-fired power plants to nuclear facilities",
        "summary": "Targeting its overwhelming coal power capacity – enough to run the entire United States – China is investigating plans to convert retiring coal-fired plants into nuclear power stations.\nDriven by decarbonisation goals and land scarcity, this “Coal to Nuclear” (C2N) strategy would look to use retiring plants’ grid and water access for compact, meltdown-proof reactors, potentially offering a faster path to clean energy than building nuclear sites from scratch.\nAnd China could be the only country...",
        "source": "smcp",
        "date": "2025-09-15T15:00:15+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3325263/china-mulls-converting-coal-fired-power-plants-nuclear-facilities?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b79ceaa0ca1d349fb55bbfd33f30f81d2fd0f063b9a4ae9b06c1407ca26ea740",
        "title": "Zijin’s gold unit says it tops the world in output growth ahead of IPO",
        "summary": "Zijin Gold International said it was the world’s fastest-growing gold producer, as the offshore unit of China’s largest miner is poised to launch by Friday an initial public offering (IPO) in Hong Kong that could be the city’s second-biggest sale this year.\nAverage annual gold output grew 21.4 per cent every year between 2022 and 2024, making it the world’s 11th biggest producer last year, the unit of Zijin Mining Group said in its IPO prospectus. The Hong Kong-based company produced 1.5 million...",
        "source": "smcp",
        "date": "2025-09-15T13:51:23+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3325551/zijins-gold-mine-unit-tops-world-output-growth-ahead-us3-billion-hong-kong-ipo?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "49ce71e653733acf75dca546394da8ddc28e52f833166eec79af1b66c216055d",
        "title": "China delivers largest offshore LNG facility, sets local towing record",
        "summary": "China's independently developed offshore floating liquefied natural gas (LNG) facility, the largest in the country by both tonnage and gas storage capacity, was delivered in Nantong City, east China's Jiangsu Province on Sunday.",
        "source": "cgtn",
        "date": "2025-09-15T13:47:23+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/China-delivers-largest-offshore-LNG-facility-sets-local-towing-record-1GGpPYsyeiY/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "6c66f34adf97c11ed687bee31bd92406cf0123a9821940b7a849f71682f283fa",
        "title": "Wang Yi: China's growth offers opportunities for Slovenia and beyond",
        "summary": "The Chinese foreign minister made the remarks when meeting with Marko Lotric, president of the National Council of Slovenia, on Sunday.",
        "source": "cgtn",
        "date": "2025-09-15T13:38:36+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Wang-Yi-China-s-growth-offers-opportunities-for-Slovenia-and-beyond-1GG6UKj1neo/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "42245b898df15f44c5e3fa16afc885e8c0ec922fe77ce309e6e9f5f0834c1497",
        "title": "Full text: Urumqi declaration of 2025 legislators forum",
        "summary": "The Urumqi Declaration of the 2025 Legislators Forum for Friendly Exchanges was issued on Sunday.",
        "source": "cgtn",
        "date": "2025-09-15T13:35:41+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Full-text-Urumqi-declaration-of-2025-legislators-forum-1GG8mCAMf16/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b78200d6fe19c9a0e742e79f5a592897caea7c1bf6739de65466b859bc340179",
        "title": "Central Asia beckons for China’s cultural tourists retracing ancient Silk Road",
        "summary": "When Beijing company executive Lillian Zhu saw the Tianjin Museum’s exhibition of Kazakhstan artefacts earlier this year, she was captivated by the vibrant culture of Central Asia and was determined to find out more.\n“It struck me how little I knew about the Silk Road countries beyond China. The fusion of nomadic and settled lifestyles is so intriguing,” she said.\nInspired by the display of nearly 200 artefacts from Kazakhstan’s National Museum, Zhu booked a 15-day study tour this summer to the...",
        "source": "smcp",
        "date": "2025-09-15T13:00:33+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3325479/central-asia-draws-chinese-tourists-chinas-belt-and-road-plan-revitalises-region?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cbca271ccd8552368d0ad9d61aa8362eb79d32d7f2ba8a91f2a3d1aacd4ab284",
        "title": "\"There's static, but I love you\"",
        "summary": "In July 2006, four unarmed UN peacekeepers were killed in southern Lebanon, including Canadian Major Paeta Hess-von Kruedener.",
        "source": "cgtn",
        "date": "2025-09-15T12:05:50+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/-There-s-static-but-I-love-you--1GGjMT280rS/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b459bcd9c4787d76900a67815390852cbb4c25266d19854323980aeb2e98b147",
        "title": "26 new Macao SAR legislators elected, preliminary results show",
        "summary": "The Electoral Affairs Commission for the Legislative Assembly Election of Macao Special Administrative Region (SAR) announced early on Monday morning that 26 candidates have been preliminarily elected to the eighth Legislative Assembly through both direct and indirect elections.",
        "source": "cgtn",
        "date": "2025-09-15T11:52:13+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/26-elected-as-new-legislators-of-Macao-SAR-preliminary-results-show-1GGd2hjXHS8/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d6b7916e309d1cbe0f44ac60dda563b05408d84f9d4a070fc60c649402568a53",
        "title": "Chinese economy maintains overall stability in August: NBS",
        "summary": "China's economy maintained overall stability in August, with steady progress, according to data released on Monday by the National Bureau of Statistics (NBS).",
        "source": "cgtn",
        "date": "2025-09-15T11:14:58+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/Chinese-economy-maintains-overall-stability-in-August-NBS-says-1GGc7KEWGc0/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f6894840229d36b0ebde7511728e2277d65a84e24e71599496fd438f683195ae",
        "title": "China's industrial output rises 5.2% in August",
        "summary": "China's value-added industrial output expanded 5.2 percent year on year in August, official data showed on Monday.",
        "source": "cgtn",
        "date": "2025-09-15T11:12:46+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/news-1GGi1rGJYC4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "7a82f4b486b1d3cb7c15e0ed00fe026038faa07241e78d584b11cb04282a356f",
        "title": "China’s economy strains in August as retail sales, industrial output miss forecasts",
        "summary": "China’s economy showed signs of strain in August, as sluggish domestic demand, headwinds from the US trade war and a prolonged property downturn continued to weigh on several major indicators.\nRetail sales, a major gauge of consumption, rose by 3.4 per cent in August from a year earlier, missing the 3.82 per cent forecast in a poll by financial data provider Wind and down from July’s 3.7 per cent growth, data from the National Bureau of Statistics (NBS) showed on Monday.\nFu Linghui, spokesperson...",
        "source": "smcp",
        "date": "2025-09-15T10:59:44+09:00",
        "url": "https://www.scmp.com/economy/economic-indicators/article/3325524/chinas-economy-under-strain-august-retail-sales-industrial-output-miss-forecasts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fbbfc352a3a3341ea95713efa403fed3d2c363e4cbb9dd77ae9bcecd3bb6859d",
        "title": "The Smiling Peacekeeper",
        "summary": "In July 2006, Chinese Major Du Zhaoyu died with three fellow UN peacekeepers in southern Lebanon.",
        "source": "cgtn",
        "date": "2025-09-15T09:07:58+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/The-Smiling-Peacekeeper-1GFwUCH9msU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "1edac262f853acfd05791caaba61e82d0057e58a95a0e8b83d01e9e6d62fa8e0",
        "title": "China's UAS Unit",
        "summary": "CGTN brings you an exclusive look at China's Unmanned Aerial Systems Peacekeeping Standby Unit, part of the 8,000 standby troops pledged to UN peacekeeping.",
        "source": "cgtn",
        "date": "2025-09-15T09:05:58+09:00",
        "url": "https://news.cgtn.com/news/2025-09-15/China-s-UAS-Unit-1GFwJ6ze5ry/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "c40285c09d6292bde7201638e49bb7d6c6d3f15ce7a4ed76cc9a54e03b393426",
        "title": "China’s Victory Day parade was a message to the Global South",
        "summary": "China’s Victory Day military parade presents a fascinating paradox. With over 12,000 troops reportedly marching through Tiananmen Square, this spectacle celebrates a defensive military doctrine while showcasing power-projection capabilities that would make any expeditionary force envious. It reveals how Beijing is pioneering a new grammar of military power that particularly resonates with the Global South.\nThe parade’s most consequential audience may not be Washington but middle powers from...",
        "source": "smcp",
        "date": "2025-09-15T07:30:13+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3325349/chinas-victory-day-parade-was-message-global-south?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "38b9735b119448ecd1de78d0e6eb5a01746f311bce92eecb27adf1646cb2f414",
        "title": "Zheng Yongnian on why China must look beyond the West to build a better AI",
        "summary": "Zheng Yongnian is a leading political scientist and government adviser in China. His academic work is mainly about contemporary politics, the country’s transformation and external relations. In his second in-depth interview with the Post, Zheng discusses AI governance and how China can consolidate its narrative amid growing geopolitical risks. This interview first appeared in SCMP Plus. For other interviews in the Open Questions series, click here.\nFor many years, you have called for the...",
        "source": "smcp",
        "date": "2025-09-15T07:00:15+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3325111/zheng-yongnian-why-china-must-look-beyond-west-build-better-ai?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9808f41c43c20151707124ea7fd144b0a6ac36edca0fbb38d86d5bc5a25f5cc8",
        "title": "UK’s Sainsbury’s ends talks to sell Argos to China’s JD.com",
        "summary": "British supermarket group Sainsbury’s said on Sunday it has terminated talks with Chinese e-commerce giant JD.com over selling the Argos general merchandise retailer, a day after confirming discussions were under way.\n“JD.com has communicated that it would now only be prepared to engage on a materially revised set of terms and commitments, which are not in the best interests of Sainsbury’s shareholders, colleagues and broader stakeholders,” the company said in a statement.\nThe company repeated...",
        "source": "smcp",
        "date": "2025-09-15T02:16:31+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3325515/uks-sainsburys-ends-talks-sell-argos-chinas-jdcom?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "682260824369b2e89ab3ff336efdba1a4af6474a1de2f82ac850199580d21a55",
        "title": "How Kazakh embroiderers in Xinjiang keep traditions alive",
        "summary": "How Kazakh embroiderers in Xinjiang keep traditions alive",
        "source": "cgtn",
        "date": "2025-09-15T00:32:40+09:00",
        "url": "https://news.cgtn.com/news/2025-09-14/How-Kazakh-embroiderers-in-Xinjiang-keep-traditions-alive-1GF1iILJ83u/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    }
]