[
    {
        "id": "571dc7ec6a0c1c8208b77a5c6b9d1227501a7f62f083f15299491e7b990a0604",
        "title": "Could battery fires be the Achilles’ heel of China’s electric vehicle industry?",
        "summary": "A series of electric vehicle fires in China has pushed the issue of battery safety into the public spotlight, triggering a wider public debate about the potential risks.\nLast month saw a number of high-profile incidents, including one on October 13 in Chengdu, the capital of Sichuan province, where a Xiaomi EV burst into flames after a high-speed crash, killing the driver.\nOn October 23 in Shanghai, a Li Auto car suddenly burst into flames on a bumpy road, becoming fully engulfed within 10...",
        "source": "smcp",
        "date": "2025-11-18T09:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3332302/could-battery-fires-be-achilles-heel-chinas-electric-vehicle-industry?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0a857b2db9a32e6c76889406d1bf4dad7c7d1bc8ccccedf85a7db7b9d3b0e61c",
        "title": "Hasan Piker’s China tour draws fire after viral Tiananmen police encounter",
        "summary": "American political commentator and live-streamer Hasan Piker has stirred controversy during his ongoing trip to China, with a viral encounter in Tiananmen Square and remarks that critics say amount to promoting Chinese propaganda.\nOn Monday, Liu Pengyu, spokesperson for China’s embassy in Washington, shared on X (formerly Twitter) an interview Piker did with state-run China Global Television Network last week, writing: “Real reason why mega #US influencer Hasan Piker is in #China.”\nIn the...",
        "source": "smcp",
        "date": "2025-11-18T07:39:43+09:00",
        "url": "https://www.scmp.com/news/china/article/3333173/hasan-pikers-china-tour-draws-fire-after-viral-tiananmen-police-encounter?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "12bac4fddb6b0ee2ce07fa2a5951fe51f7f9e7e3b7cc8fefc17ebe0e72b85663",
        "title": "US soybean futures rebound on signs China is ramping up purchases",
        "summary": "Soybean futures jumped on signals that China is stepping up its buying of oilseed, offering hope for US farmers after purchases appeared to have stalled.\nPrices in Chicago rose as much as 3.2 per cent on Monday, hitting a fresh 17-month high, after US President Donald Trump said China is in the process of buying soybeans.\n“They’ll be doing a lot of soybean purchases,” he told reporters aboard Air Force One on Friday, adding that those purchases could start before spring.\nBrokerage AgResource Co...",
        "source": "smcp",
        "date": "2025-11-18T07:21:57+09:00",
        "url": "https://www.scmp.com/news/world/united-states-canada/article/3333172/us-soybean-futures-rebound-signs-china-ramping-purchases?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b81e5b9d8659e86548e3a891487a2a23ead9c766e482e18993e4b9141cf1c2e0",
        "title": "How China left the US behind in remote sensing research race",
        "summary": "The year was 2015, and New York University professor Debra Laefer sat at her desk in Brooklyn reviewing yet another stack of research papers on remote sensing. As she scanned the authors’ affiliations, she paused – the same journals that once overflowed with names from American universities and Nasa labs had begun to publish discoveries from Beijing, Wuhan and Shanghai.\nOver the next few years, the drips became a wave – and then a tsunami.\nBack in the 1990s, the United States dominated remote...",
        "source": "smcp",
        "date": "2025-11-18T07:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3333093/88-9-stark-data-shows-us-decline-chinas-rise-remote-sensing-research?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "74213e06f0c96844b25386f85af3e03693ae5abd435a6d7309e53c7d74c0306e",
        "title": "As US and China turn their eyes to Central Asia, Russia loses out",
        "summary": "As a result of Russia’s war in Ukraine, Moscow has lost much of its influence in Central Asia. In the coming months and years, the United States is expected to expand its presence in this strategically important region. But given that China has developed close economic ties with regional actors, how does Beijing view Washington’s ambitions?\nCoincidentally or not, on November 6, the US and China both held important meetings with Central Asia. In Washington, US President Donald Trump hosted the...",
        "source": "smcp",
        "date": "2025-11-18T06:30:10+09:00",
        "url": "https://www.scmp.com/opinion/asia-opinion/article/3332544/us-and-china-turn-their-eyes-central-asia-russia-loses-out?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f49d5ab56127f27d1fe1f9a594743b292c67e5be650106dc142babd3453c3629",
        "title": "Brazil ends 60-year ordeal of tortured Chinese detainees during military regime",
        "summary": "Brazil’s top military court has closed a dictatorship-era case against nine Chinese citizens who were arrested and tortured in 1964, ending a process that stayed open for more than six decades despite the lack of evidence behind the original charges.\nIn a decision released on Sunday, Brazil’s Superior Military Court ruled that the case should legally have expired in 1981 but was never closed. As a result, a 50-volume case file remained on the docket.\nThe closure lifts a lingering point of...",
        "source": "smcp",
        "date": "2025-11-18T04:58:24+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333168/brazil-ends-60-year-case-chinese-detainees-tortured-under-military-regime?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7b90b0031749247a6e5d412c826e645dd7ec41bb90c932166ab1416a809f7665",
        "title": "EU’s investment bank to work with Australia on critical raw materials",
        "summary": "The EU’s European Investment Bank (EIB) and the Australian government said in a joint statement on Monday they would deepen cooperation on critical raw materials, as Western powers scramble to cut their reliance on China.\nWith the exception of Japan, Group of Seven (G7) countries and the EU are heavily or exclusively reliant on China for a range of materials from rare earth magnets to battery metals.\nEuropean officials and industry sources say financing remains a key hurdle in the bloc’s efforts...",
        "source": "smcp",
        "date": "2025-11-18T04:22:32+09:00",
        "url": "https://www.scmp.com/news/world/europe/article/3333167/eus-investment-bank-work-australian-government-critical-raw-materials?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ac209436c3690c0f1747febf88d673d8a6b7f2ee27545dbe68bf0e255a217ab9",
        "title": "Colombia pushes for talks – to include China – over US military action in region",
        "summary": "Colombian President Gustavo Petro called for a high-level security meeting with the United States, China and regional partners, arguing that recent US military deployments and strikes on suspected drug-smuggling boats in the Caribbean and eastern Pacific are escalating tensions in the region.\nJoining other regional voices condemning the operations, he stressed that Latin America and the Caribbean should be treated with respect and repeated his proposal for talks in Pearl Harbour, noting that he...",
        "source": "smcp",
        "date": "2025-11-18T04:06:18+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3333166/colombia-pushes-talks-include-china-over-us-military-build-near-venezuela?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c2a9cfa3e31c60174faee67ba9acfb2ddeb02e6f7677cc9c91892e3802d8a9ea",
        "title": "US pulls missile system from Japan as Beijing–Tokyo row over Taiwan deepens",
        "summary": "A US missile system that could strike Beijing has been withdrawn from Japan, Japanese media reported on Monday, amid sharply escalating tensions triggered by the Japanese prime minister’s recent remarks on Taiwan.\nThe Typhon Mid-Range Capability (MRC) missile launcher system of the US Army, deployed to the Iwakuni base in Yamaguchi prefecture since September for the US-Japan “Resolute Dragon 2025” joint exercise, was already removed, the Japanese Defence Ministry confirmed on Monday.\nThe news...",
        "source": "smcp",
        "date": "2025-11-18T02:36:26+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3333161/us-pulls-missile-system-japan-beijing-tokyo-row-over-taiwan-deepens?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5ab70544e3d99b107bbc86ac9b15b91821b63cfe39a167f3b5fa5adec2363b71",
        "title": "Why ‘racist’ biologist James Watson is remembered in China with respect",
        "summary": "When Nobel laureate James Watson died at 97 in November, obituaries around the world painted a divided portrait: a scientific visionary who co-discovered the double helix of DNA – and a controversial figure long condemned for making racially charged statements about intelligence and genetics.\nIn the West, the American molecular biologist’s legacy was increasingly overshadowed by the fallout from those remarks, culminating in New York’s Cold Spring Harbour Laboratory (CSHL) severing ties with him...",
        "source": "smcp",
        "date": "2025-11-18T00:00:12+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3332771/why-racist-biologist-james-watson-remembered-china-respect?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f694ebdd2dadaee984a099001a6b14b529867c928c54c4045e7016fe13a38614",
        "title": "China looks to get relations with Syria ‘back on track’ after Assad’s downfall",
        "summary": "China will “actively consider” helping Syria’s post-war reconstruction, Foreign Minister Wang Yi said, as he called for the two countries to get relations back on track.\nWang made the comments in a meeting on Monday with his Syrian counterpart Asaad al-Shaibani, who was making his first trip to Beijing since the downfall of Bashar al-Assad last year.\nWang also urged the new government to act against Uygur militant groups that have been linked to the fight against Assad.\nAt Beijing’s request,...",
        "source": "smcp",
        "date": "2025-11-17T22:19:54+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333127/china-looks-get-relations-syria-back-track-after-assads-downfall?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c740ac6a2c364e9257e8a06063326b8c2d4771ec0564a3fd9e69ce0553a7e9ef",
        "title": "Beijing-Tokyo row, Chinese student numbers in US fall: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Beijing rejects G20 Japan meeting with Premier Li amid deepening Taiwan row\nChina continued a diplomatic chill with Japan over the weekend by ruling out a leaders’ meeting at the coming G20 summit in South Africa amid heightened tensions.\n2. Chinese student numbers in US fall as gap with Indian scholars widens: report\nChinese student numbers in the United...",
        "source": "smcp",
        "date": "2025-11-17T22:15:08+09:00",
        "url": "https://www.scmp.com/news/china/article/3333108/beijing-tokyo-row-deepens-chinese-student-numbers-us-fall-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "198527868fa9feeb7a2bcbe40ed9279943c9e6cb5780abe85ff476ffa868905e",
        "title": "US races to secure China rare earths deal as worries over chokeholds linger",
        "summary": "The administration of US President Donald Trump hopes to confirm a deal to secure rare earth supplies from China by Thanksgiving, Treasury Secretary Scott Bessent said in an interview, framing the agreement as vital to shoring up America’s supply chains.\nThe remarks came as the Council on Foreign Relations, a US-based think tank, warned in a new report that the US’ reliance on Chinese critical minerals remained a major strategic vulnerability that Washington needed to address.\nA rare earths deal...",
        "source": "smcp",
        "date": "2025-11-17T22:00:17+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3333113/us-races-secure-china-rare-earths-deal-worries-over-chokeholds-linger?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fe9db0eea97a4995b13d4d39d4ce637ca56a17ec213bc9226087353338420021",
        "title": "China targets AI-powered price manipulation in new antitrust guidelines",
        "summary": "China’s market regulator has moved to tackle the hidden risks of algorithm-driven price manipulation with newly proposed anti-monopoly guidelines for online shopping, food delivery and travel platforms.\nA draft of the “Anti-Monopoly Compliance Guidelines for Internet Platforms”, published over the weekend by the State Administration for Market Regulation (SAMR), focused heavily on the sophisticated, often opaque ways in which online platforms with significant market power can exploit...",
        "source": "smcp",
        "date": "2025-11-17T22:00:10+09:00",
        "url": "https://www.scmp.com/tech/article/3333098/china-targets-ai-powered-price-manipulation-new-antitrust-guidelines?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2066f3dbcaa30789b9620bbb4049ccbd1111f9fb611e605d7cb95920a3308088",
        "title": "Taiwan on edge amid Beijing fury over Takaichi’s ‘survival-threat’ remarks",
        "summary": "Taiwan is watching anxiously as it finds itself at the centre of a verbal clash between Beijing and Tokyo, fuelling fears that Taipei could be drawn into a major international conflict.\nThough the island’s government has openly embraced Tokyo’s stance and condemned Beijing’s response as “hegemonic”, critics and political analysts have cautioned that Taiwan is now at risk of becoming a flashpoint in a confrontation between two major world powers.\nThe row erupted after Japanese Prime Minister...",
        "source": "smcp",
        "date": "2025-11-17T21:31:46+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333133/taiwan-edge-beijing-fury-erupts-over-japan-pms-survival-threat-remarks?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a8a536a318a79159a26a90b2485361c25fd1dc00be31022c75d0c79c9818b2b6",
        "title": "15th five-year plan charts a course for China’s modernisation",
        "summary": "The most important outcome of the Communist Party of China’s fourth plenum, held last month in Beijing, was the review and adoption of the “Recommendations of the CPC Central Committee on Formulating the 15th Five-Year Plan for National Economic and Social Development”.\nLeading the drafting team in person, Communist Party General Secretary and Chinese President Xi Jinping played a decisive role in formulating the recommendations by setting the overall vision and providing guidance throughout the...",
        "source": "smcp",
        "date": "2025-11-17T21:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3332731/15th-five-year-plan-charts-course-chinas-modernisation?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5b1702ecf32cb36b3dafeabf1f769b67a8dc83f255104435b7db667c6bc4fca6",
        "title": "China’s travel warnings for Japan evoke mixed reactions at home",
        "summary": "Chinese tourists and students have expressed mixed reactions to Beijing’s travel and education advisories on Japan amid a spiralling diplomatic clash, with some downplaying the concerns as a peak travel season approaches.\nTensions escalated following Japanese Prime Minister Sanae Takaichi’s remarks earlier this month that suggested Tokyo could deploy its military forces in the event of a conflict in the Taiwan Strait. Beijing has reacted with anger, including summoning the Japanese ambassador to...",
        "source": "smcp",
        "date": "2025-11-17T21:01:44+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333125/chinas-travel-warnings-japan-evoke-mixed-reactions-home?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "00a9fbc352eedaca5856a7a3ab9fd6b61f467f2ab5fc328c68b624cf45d9163f",
        "title": "Mathematician Qian Hong, son of top scientific clan, leaves US for China",
        "summary": "A renowned mathematician who is also part of China’s Qian clan – a surname linked in the annals of Chinese scientific history to national pioneers in science and engineering – has become the latest US-based scientist to return to China.\nAfter more than 40 years in the United States, Qian Hong has left his endowed professorship at the University of Washington to join the prestigious and private Westlake University in eastern China.\nQian’s appointment last month as a full-time chair professor with...",
        "source": "smcp",
        "date": "2025-11-17T21:00:12+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3333087/mathematician-qian-hong-son-chinas-leading-scientific-clan-reverses-us-brain-drain?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "668236c2b114e98ff762ba1f9765664728836529edd1f2a5cae08f22d4648b21",
        "title": "KFC, Pizza Hut operator Yum China pushes rapid expansion into lower-tier cities",
        "summary": "Yum China Holdings, operator of KFC and Pizza Hut restaurant chains across mainland China and Hong Kong, plans to ramp up expansion into more lower-tier cities based on its flexible store formats, expecting this push to generate higher returns for the company over the next five years.\nAt the company’s Investor Day conference in Shenzhen on Monday, CEO Joey Wat said Yum China’s total number of outlets would increase to 30,000 by 2030, 76 per cent more than the firm’s estimated 17,000 outlets by...",
        "source": "smcp",
        "date": "2025-11-17T19:30:09+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3333117/kfc-pizza-hut-operator-yum-china-pushes-rapid-expansion-lower-tier-mainland-cities?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a7e6e4cd8c96f618940b4cfe6fea6beff80a6a6beef72770d063642f0eabda81",
        "title": "China’s aircraft carriers put to ‘train-as-you-fight’ test beyond island chains",
        "summary": "Chinese aircraft carriers have undergone intensive far-sea training to forge strong combat readiness, carrying out dozens of “train-as-you-fight” drills beyond the island chains and ramping up the frequency of aircraft launches.\nThe revelation was just one detail in a PLA Daily article last week that shed light on the training activities of China’s three aircraft carriers – a subject that the People’s Liberation Army has previously guarded closely.\nThe details come less than two weeks after...",
        "source": "smcp",
        "date": "2025-11-17T19:24:44+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3333118/china-reveals-guarded-carrier-tactics-train-you-fight-drills-beyond-island-chains?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "976d9eec10fab670075e2c057dd60c8a6fff48971f4450183ae27225719756fe",
        "title": "491,000 Japan-bound air tickets cancelled as China warns people to avoid travel",
        "summary": "Chinese airlines have recorded about 491,000 cancellations of tickets to Japan since Saturday – roughly 32 per cent of their total bookings to the typically popular destination – after Beijing advised citizens to avoid travelling there amid a diplomatic spat, according to a veteran aviation analyst.\nThe percentage of flights affected skyrocketed to 82.14 per cent on Sunday and 75.6 per cent on Monday, according to independent analyst Li Hanming, citing his research data covering all mainland...",
        "source": "smcp",
        "date": "2025-11-17T18:32:07+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3333106/491000-japan-bound-air-tickets-cancelled-china-warns-people-avoid-travel-amid-spat?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e066c96155632529202c4abff5eda76dbb4baaf51901950a5cf92caf976f9ab8",
        "title": "Ant International, UBS partner on blockchain-based cross-border payments",
        "summary": "Ant International, the Singapore-based spin-off of Chinese fintech giant Ant Group, is stepping up its global treasury operations through a strategic partnership with Swiss bank UBS, as both companies also seek to explore innovations in blockchain-based tokenised deposits.\nUnder a memorandum of understanding signed at UBS’ Singapore offices, Ant International will use UBS Digital Cash – a blockchain-based payments platform launched last year – for its global treasury operations to enhance...",
        "source": "smcp",
        "date": "2025-11-17T18:00:16+09:00",
        "url": "https://www.scmp.com/tech/blockchain/article/3333085/ant-international-ubs-join-forces-blockchain-based-cross-border-payment-settlements?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d60b13f78ee610e360a2ad30fb909baa68bbf60833c1143cefdd85a370fa5542",
        "title": "Stop ‘stigmatising’ Chinese students and researchers, ambassador to US says",
        "summary": "China’s ambassador to the United States has come to the defence of the country’s students and academics, saying they have been “smeared” as a threat to national security.\n“A few individuals in the United States have seen Chinese students, scholars, and friendly organisations … as national security threats through a biased lens and have tried every means to smear and obstruct them,” Xie Feng said in a video message to the US-China Hong Kong Forum.\n“People with vision in China and the US need to...",
        "source": "smcp",
        "date": "2025-11-17T18:00:11+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333080/stop-stigmatising-chinese-students-and-researchers-ambassador-us-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f80615d1858817eccba20bfacd1dbbcea9bb3b227783488e60739cab36496972",
        "title": "800 million: how a new target indicates a shift in China’s economic strategy",
        "summary": "Xiao Mei, a kindergarten teaching assistant living in the suburbs of Hangzhou in eastern China, has barely seen her income rise for three years and is not optimistic about her chances of getting a pay rise any time soon. Still, she counts herself as relatively fortunate.\n“At least I haven’t had my pay cut or lost my job,” she said, adding that several of her friends had suffered such setbacks recently.\nEarning around 6,000 yuan (US$845) a month – well below the local average of 13,500 yuan for...",
        "source": "smcp",
        "date": "2025-11-17T17:12:04+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3333084/800-million-how-china-plans-double-its-middle-income-population?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cb2e188c4f08601b15e9e658795143fdccb8d8ae4a156cbbd6e11d3d833eda22",
        "title": "PhD for landfill supervisor raises a stink over credential excess in China",
        "summary": "A county-level sanitation office in southern China has invited ridicule and stoked a public debate after posting a job that requires a PhD to supervise garbage trucks and landfills – an unusual demand that critics say epitomises China’s runaway degree inflation.\nThe posting in Guangdong province, by the office that manages urban environmental sanitation for Shixing county, appeared online last week under a notice for “urgently needed high-level talent for public institutions” issued by the...",
        "source": "smcp",
        "date": "2025-11-17T16:49:42+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3333076/wanted-china-garbage-supervisor-phd?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3663484e12bc08a8f8105f7fd13ea789b8b893087451759fc3b7287a82dd8a08",
        "title": "No plan for Japan-China meeting at G20 as Taiwan Strait row deepens",
        "summary": "China has ruled out a leaders’ meeting with Japan at the coming G20 summit in South Africa, as ties between the two Asian giants continue to fray over Taiwan.\n“I can tell you that Premier Li Qiang does not have a meeting arrangement with Japanese leaders,” Mao Ning, a spokeswoman for China’s foreign ministry, said at a regular media briefing on Monday.\nLi and Japanese Prime Minister Sanae Takaichi are expected to attend the Group of 20 gathering in Johannesburg on November 22 and 23, and it was...",
        "source": "smcp",
        "date": "2025-11-17T16:21:15+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333071/taiwan-row-stay-high-alert-peoples-daily-warns-japan-seeks-ease-tensions?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2ca5be1b9e07425467a599b014af108eaa841a864d5484f6354d3337c45dd061",
        "title": "Yuan rapidly gaining ground as Chinese firms plot global expansion",
        "summary": "Chinese companies expanding overseas are increasingly using the yuan for financing and payments to build their international operations, boosting the currency’s growing clout in international trade and investment.\n“Based on my calculation, 10 per cent of our company’s total orders were priced and settled in renminbi,” said Yang Feng, finance director for overseas marketing at Sieyuan Electric, in a panel discussion organised by Standard Chartered at the China International Import Expo in...",
        "source": "smcp",
        "date": "2025-11-17T15:38:44+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3333034/yuan-rapidly-gaining-ground-chinese-firms-plot-global-expansion?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "264473aac345a6e62f015ce29091900b2b7037278d790e16f57e2237aeb58be5",
        "title": "EU recalibrates on China as it seeks rare earths breakthrough",
        "summary": "Under pressure from Beijing’s chokehold on rare earths and the simmering feud over chipmaker Nexperia, EU officials have been asked to tone down their public rhetoric on Beijing, even as the bloc moves forward aggressively with its de-risking plans.\nBrussels is in “de-escalation mode”, several official sources confirmed, as it looks to convince China to issue more licences for the export of the critical minerals vital to hi-tech manufacturing and ensure the supply of chips from beleaguered...",
        "source": "smcp",
        "date": "2025-11-17T15:00:15+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333061/softer-words-harder-policy-eu-recalibrates-china-it-seeks-rare-earths-breakthrough?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ca94871958f560eaa4f6c6233762068c92a2c62a5ccd4ad2907ed19c9b497074",
        "title": "Tech war: Huawei bets on AI tech to squeeze more performance from GPUs",
        "summary": "Chinese technology giant Huawei Technologies is expected to unveil a new artificial intelligence infrastructure technology on Friday that could double the utilisation efficiency of graphic processing units (GPUs), according to the state-owned Shanghai Securities News.\nThe report said the technology would be able to lift the utilisation rate of AI chips – including GPUs and neural processing units (NPUs) – to 70 per cent, up from the current 30 to 40 per cent, in another major advance in “using...",
        "source": "smcp",
        "date": "2025-11-17T15:00:15+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3333058/tech-war-huawei-bets-ai-tech-squeeze-more-performance-gpus?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ffb37ada23570df1099b7b3f34e974edd1b52030937f0f69bd110e29b21b60d8",
        "title": "Chinese student numbers in US fall as gap with Indian scholars widens: report",
        "summary": "Chinese student numbers in the United States have continued to decline over the past year, but they remain the second-largest student group after Indians and the biggest contributors to the US economy, according to new data released on Monday.\nA total of 265,919 Chinese studied in the US in the 2024-25 academic year, marking a four per cent decrease from the previous academic year, according to the latest annual survey of higher education institutions by the Institute of International Education...",
        "source": "smcp",
        "date": "2025-11-17T14:01:08+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3332899/chinese-student-numbers-us-continue-fall-gap-indian-scholars-widens?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4192374339a5faa01db98ca55c59f9dc4d998fd081ca7d3fda154a141e793911",
        "title": "How China’s HQ-29 mid-course missile interceptor stacks up against its US rivals",
        "summary": "After 15 years of testing, China unveiled the HQ-29 at its Victory Day parade in September, showcasing the land-based air-defence missile system that is capable of intercepting targets in the near region of space outside the Earth’s atmosphere.\nThe HQ-29, also known as the Red Flag-29, is considered a key supplement to the top layer of China’s multilayered ballistic missile defence system.\nThe missile is mounted on a six-axle launcher, according to the Chinese military magazine Ordnance Science...",
        "source": "smcp",
        "date": "2025-11-17T13:00:08+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3332993/how-chinas-hq-29-mid-course-missile-interceptor-stacks-against-us-rivals?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ba3e5360654d7a70351c88698b3ccdbd503aadfc1bacdefbf60a3b11fcb762f9",
        "title": "Chinese history blamed this woman for 2,796 years. Science clears her name",
        "summary": "Few women in Chinese history have been as scorned – or as misunderstood – as Bao Si. For nearly three millennia, the queen has been remembered not as a person, but as a symbol: the beautiful femme fatale whose cold heart and unparalleled beauty brought down a dynasty.\nAccording to legend, Bao Si was a queen so aloof she never smiled.\nDesperate to amuse her, King You of the Western Zhou Dynasty (about 1046-771 BC) is said to have played a deadly prank: he lit the kingdom’s sacred beacon fires –...",
        "source": "smcp",
        "date": "2025-11-17T11:00:17+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3332716/chinas-queen-bao-si-was-blamed-thousands-years-science-has-cleared-her-name?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b1047eae8cdff66f9874b626726371754ab5b1631cf898397d8d6e5c81c417e2",
        "title": "Shanghai premium office market picks up amid discounted rents",
        "summary": "Lower rents improved occupancy rates in Shanghai’s premium office market as the city reported solid economic growth, but most companies remained cost-conscious amid a cloudy economic outlook and expectations for bigger discounts, according to JLL.\nDiscounts attracted corporate tenants in the quarter ended September, prompting relocations from business parks and suburban areas to grade-A office buildings, the property firm said.\n“As the rental disparity between grade-A and grade-B properties...",
        "source": "smcp",
        "date": "2025-11-17T10:30:11+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3332972/shanghai-premium-office-market-picks-rent-discounts-encourage-upgrades?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "657f7d25f8c1e948e722119bfcaf65f54c8a3bdf92abbf36b839b3ce77636416",
        "title": "Chinese economist Lu Feng on why the time is ripe for a consumption rebalance",
        "summary": "Lu Feng is a professor of economics and a former deputy dean at Peking University’s National School of Development. In more than 40 academic papers, six books and numerous magazine articles, he has studied issues critical to China’s economy, including the exchange rate, industrial development, food security and external imbalances. Lu has also served as an adviser to several government agencies, including the Ministry of Finance and the Ministry of Human Resources and Social Security.\nThis...",
        "source": "smcp",
        "date": "2025-11-17T07:00:31+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3332805/chinese-economist-lu-feng-why-time-ripe-consumption-rebalance?utm_source=rss_feed",
        "reportUrl": ""
    }
]