[
    {
        "id": "78cd612fdb5d5273f38addc9fd775cdb351c83d498f4faa12ddbc1286cf91caa",
        "title": "North Korean leader Kim Jong-un will attend military parade in Beijing",
        "summary": "North Korean leader Kim Jong-un will travel to China to attend next week’s military parade marking the 80th anniversary of the end of World War II, Beijing said on Thursday.\nIt will be the reclusive leader’s first visit to China for more than six years.\nHe will join Chinese President Xi Jinping and Russian leader Vladimir Putin – key allies of isolated North Korea – at the event on September 3.\nThey will be among an expected 26 world leaders at the parade, which will see thousands of...",
        "source": "smcp",
        "date": "2025-08-28T11:15:25+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3323418/north-korean-leader-kim-jong-un-will-attend-military-parade-beijing?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0a0fbcf494fcc8ad3727890bbda6f20d13c1f4ecd040da2fca135f68fddded53",
        "title": "JD’s property arm joins 2 firms in US$1 billion Singapore Reit: sources",
        "summary": "The property investment arm of Chinese e-commerce giant JD.com and two other firms plan to launch a Singapore-based real estate investment trust (Reit) with assets potentially valued at more than US$1 billion, said two sources with knowledge of the matter.\nJD Property, the unlisted infrastructure investment and asset management platform of JD.com, is setting up the Reit with Swiss investment firm Partners Group and EZA Hill Property, which is backed by Asian investment firm Hillhouse, the...",
        "source": "smcp",
        "date": "2025-08-28T11:09:15+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3323417/jdcoms-property-unit-joins-two-firms-us1-billion-singapore-reit-sources-say?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "597d61b35796eb69e9c16c8bbe336c8512bd21034730571ebe1f5407ecfba8e3",
        "title": "Why have stablecoins triggered caution from former China central bank governor?",
        "summary": "Former Chinese central bank governor Zhou Xiaochuan has urged a more measured tone amid a global surge of interest in stablecoins, calling for a “multidimensional assessment” of their genuine utility and the systemic risks they may pose.\nThe United States and Hong Kong are rolling out regulatory frameworks for the asset, and speculation has been growing about the likelihood of Beijing following suit by introducing yuan-backed stablecoins in a bid to further internationalise its currency.\n“We...",
        "source": "smcp",
        "date": "2025-08-28T10:59:29+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3323414/former-china-central-bank-governor-urges-caution-amid-stablecoin-frenzy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d0d501dcb14ef4e261e4e3256f02bd75371163e46fb609dd563d3ee4ad0cebcd",
        "title": "Chinese envoy warns against sowing ‘fear and hostility’ as US plans visa revamp",
        "summary": "Beijing’s top diplomat in Washington on Wednesday warned against undermining of people-to-people relations just hours after the US government proposed a sweeping revamp of visa rules for foreign students, scholars and media citing national security risks.\n“Going forward, we need to bring our people closer, rather than sow fear and hostility,” China’s ambassador to the US Xie Feng said during an event commemorating Chinese and American soldiers who fought together for Allied forces during World...",
        "source": "smcp",
        "date": "2025-08-28T10:51:32+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3323416/chinese-envoy-warns-against-sowing-fear-and-hostility-us-plans-visa-revamp?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4714665a0b2f50542b45b58f44fb68ab86d4a4cf400a9387173e48c23554ed3d",
        "title": "Once a forgotten WWII ally, China to reassert role as defender of world order",
        "summary": "Ahead of the 80th anniversary of Victory Day, marking the end of the Sino-Japanese war and the global fight against fascism, we look at the profound changes of the post-war period and how they continue to affect China’s place in the world. Part one of this series examines how the Chinese sacrifices of the conflict underpin Beijing’s determination to uphold global norms.\nAn estimated 35 million Chinese soldiers and civilians died as part of their country’s sacrifice as a key Allied power, yet 80...",
        "source": "smcp",
        "date": "2025-08-28T07:00:07+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3323368/80-years-wwii-has-china-become-main-guarantor-post-war-order?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3f74fd840567e5205afccfdae9c06178c5ceb9799f8b5512ea26f503fc4fdce7",
        "title": "Beijing slams Washington after Panama lawmakers join ‘anti-China’ group",
        "summary": "China’s state media and diplomats lashed out at Washington on Wednesday after nine Panamanian lawmakers joined a global parliamentary alliance that Beijing denounced as an anti-China front.\nThe move, announced in Panama’s National Assembly a day earlier at a ceremony backed by the US ambassador, drew sharp criticism from state outlets such as the China Daily and Global Times, which accused Washington of coercion and manipulation.\nThe lawmakers declared their membership in the Inter-Parliamentary...",
        "source": "smcp",
        "date": "2025-08-28T02:48:07+09:00",
        "url": "https://www.scmp.com/news/china/article/3323405/washington-draws-rebuke-beijing-after-panamanian-lawmakers-join-anti-china-group?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "747a920409a0a1198a6b401dcf54352bee2a5ec9b482ed62e5d4a5d1ad00b4d9",
        "title": "China steps up Belt and Road Initiative funding with focus on Central Asia",
        "summary": "Investments under China’s Belt and Road Initiative surged in the first half of the year – particularly for projects in Central Asia related to metals and mining – leading some analysts to conclude Beijing is seeking access to critical natural resources as a precaution against escalatory trade restrictions from the United States.\nThe 150 countries taking part in the global infrastructure initiative received a combined US$124 billion in investments and construction contracts from January to June,...",
        "source": "smcp",
        "date": "2025-08-28T00:00:09+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3323354/china-steps-belt-and-road-initiative-funding-focus-central-asia?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5ee7818e3cbbad1e1a860a5ebbf732b90f26fe6b758aed3531b73b22c430cdda",
        "title": "China rejects call to join U.S.-Russia nuclear disarmament talks",
        "summary": "Chinese Foreign Ministry spokesperson Guo Jiakun said on Wednesday that China rejects a call for joining nuclear disarmament negotiations with U.S. and Russia.",
        "source": "cgtn",
        "date": "2025-08-27T22:30:08+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/China-rejects-call-to-join-U-S-Russia-nuclear-disarmament-talks-1GbsEYTj8mQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "077002a399eb725606201cd8e80d88b17b51da64b9d88886ac1d774847f3e46d",
        "title": "China’s Tiangong beats ISS, mathematician mulls move: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Trump calls criticism of move to admit thousands of Chinese students ‘insulting’\nUS President Donald Trump on Tuesday defended his proposal to admit hundreds of thousands of Chinese students, saying the US is “honoured” to host them and warning that the American college system would “go to hell” without them.\n2. As the world watches PLA approach 100, is it...",
        "source": "smcp",
        "date": "2025-08-27T22:15:07+09:00",
        "url": "https://www.scmp.com/news/china/article/3323392/trump-defends-china-student-move-tiangong-space-station-beats-iss-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "423b3a3ed1e00abfd88c99716c07bd13a01852f2641f55cad2859baae34d92b6",
        "title": "Bird conservation efforts expand in China's Dongting Lake",
        "summary": "Bird conservation efforts expand in China's Dongting Lake",
        "source": "cgtn",
        "date": "2025-08-27T22:13:32+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Bird-conservation-efforts-expand-in-China-s-Dongting-Lake-1GbrIIu6fyo/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0b52b8211059c71c61af65964720c83bc14baa2bfb75aee1be26f825bcce79df",
        "title": "Mainland accuses DPP of 'selling out' Taiwan's interests to U.S.",
        "summary": "A Chinese mainland spokesperson on Wednesday condemned the Democratic Progressive Party (DPP) authorities in Taiwan for kowtowing to the United States and selling out the island's interests, calling them shameless and absurd.",
        "source": "cgtn",
        "date": "2025-08-27T22:10:33+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Mainland-accuses-DPP-of-selling-out-Taiwan-s-interests-to-U-S--1Gbd5kbXub6/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "1af95b5daebd04ffcc015c3122290d6e90ef83bebb642093f20e2bc0728760c9",
        "title": "Why Trump’s furniture tariffs could complicate efforts to reassemble China trade",
        "summary": "US President Donald Trump’s renewed threat to impose tariffs on imported furniture could erode some of China’s exports while doing little to bring manufacturing back to America as he promised, according to analysts.\nAnd they added that such a move risks escalating tensions between the world’s two largest economies, whose earlier extension of a trade truce, coupled with conciliatory statements, had suggested a more amenable posture in trade negotiations.\nTrump announced plans to impose steep...",
        "source": "smcp",
        "date": "2025-08-27T22:00:25+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3323381/china-trumps-furniture-tariff-threat-could-complicate-efforts-reassemble-trade?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e555060e88bdc85214f9b74dec780a49d1c03dc8b2a4ecdc883c8b08c1c176c4",
        "title": "Why US is joining China in race to ‘game-changing’ rotating detonation engine",
        "summary": "The United States has developed and tested its own version of a potentially transformative technology that could redefine the future of high-speed warfare and is already being mastered by China.\nThe rotating detonation engine (RDE) programme, a collaboration between the RTX Technology Research Centre and Pratt & Whitney, has moved into the practical validation phase after a decade of designing and testing.\nThese trials, conducted at a lab in Connecticut, aimed to integrate the RDE engine into a...",
        "source": "smcp",
        "date": "2025-08-27T22:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3323315/why-us-joining-china-race-game-changing-rotating-detonation-engine?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e1472e4711b8efc821977235422a0ec844bd607f8716718d02a980f2d2668b0e",
        "title": "China offers South Asia a choice between swords and ploughshares",
        "summary": "Chinese Foreign Minister Wang Yi didn’t just tour South Asia earlier this month; he redrew the region’s strategic map. In three stops – India, Afghanistan and Pakistan – Beijing offered a tactical reset, a warning and a lifeline. The choreography was deliberate; the message was unmistakable: China is shaping the region’s future, one handshake at a time.\nThe stops were not random. They were sequenced with intent, each one revealing something about China’s ambitions, South Asia’s anxieties and the...",
        "source": "smcp",
        "date": "2025-08-27T21:30:08+09:00",
        "url": "https://www.scmp.com/opinion/asia-opinion/article/3323179/china-offers-south-asia-choice-between-swords-and-ploughshares?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0eb929dddba5199b8bdd86f68f38e8ee71613693df990b3c6915a789a95f5a30",
        "title": "World Lake Day: Reflecting Earth's fragility and majesty",
        "summary": "World Lake Day: Reflecting Earth's fragility and majesty",
        "source": "cgtn",
        "date": "2025-08-27T21:25:13+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/World-Lake-Day-Reflecting-Earth-s-fragility-and-majesty-1GbnWY3OszS/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "45bb36686c247cf05e94ebfe390b2870f82216b80898ee31d2b9eab90bed2503",
        "title": "China releases latest data on global trade frictions",
        "summary": "The China Council for the Promotion of International Trade (CCPIT) released two sets of key data at its August press briefing on Wednesday, shedding light on global trade frictions and China's resilient foreign trade performance.",
        "source": "cgtn",
        "date": "2025-08-27T21:17:39+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/China-releases-latest-data-on-global-trade-frictions-1GbmDTpDaYo/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "4ac9ebb5e3dd610db78fb50f0dd64d932b32f7f48d4095d825e813a942ae1662",
        "title": "China says it hopes U.S. will safeguard rights of Chinese students",
        "summary": "China hopes the United States will stop unwarranted harassment, interrogation and deportation of Chinese students, and effectively safeguard their legitimate and lawful rights and interests, Chinese Foreign Ministry spokesperson Guo Jiakun said on Wednesday.",
        "source": "cgtn",
        "date": "2025-08-27T21:13:49+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/China-says-it-hopes-U-S-will-safeguard-rights-of-Chinese-students-1GbhYQMX7Fe/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "8fd5c08bbba1fce1addb5ef6078bd9a14e4234d0d88fa64b67ac5600a127f726",
        "title": "‘Will you leave US for China?’ It depends, mathematician Terence Tao says",
        "summary": "Would mathematician Terence Tao consider leaving the United States for Hong Kong or mainland China in light of funding cuts under the Trump administration?\nWhen the South China Morning Post put the question to the Fields medallist and University of California, Los Angeles (UCLA) professor, his response was measured but telling.\n“The situation is very fluid and unstable right now – far more than it has been at any previous point in the last 30 years,” Tao wrote in an email on August 21.\n“What...",
        "source": "smcp",
        "date": "2025-08-27T21:00:08+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3323325/will-you-leave-us-china-it-depends-says-mathematician-terence-tao?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "48e93ed047158e6e7cb71a1594acecc2ca4de00eb7900e8c946075d1b1271d07",
        "title": "A Home Across Borders: Fusion and intelligent upgrades in Shanghai",
        "summary": "A Home Across Borders: Fusion and intelligent upgrades in Shanghai",
        "source": "cgtn",
        "date": "2025-08-27T20:51:15+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/A-Home-Across-Borders-Fusion-and-intelligent-upgrades-in-Shanghai-1GboHEpgDDy/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "16ba827340f7cd2e7ca11aabd9dc0af1cdc7b0dac2091e21a3e1714dec745f19",
        "title": "The Unsung Ally｜From Expeditionary Army to Hump Route",
        "summary": "From the Hump to the Burma Road, from defending China’s lifeline during the War of Resistance against Japanese Aggression to rescuing Allied forces, countless Chinese soldiers and civilians sacrificed their lives.",
        "source": "cgtn",
        "date": "2025-08-27T20:37:10+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/The-Unsung-Ally-From-Expeditionary-Army-to-Hump-Route-1GbopoHZ23S/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "e017a0878676ab187890ff039a3f1b696b223b20e406157cf59cf5ab228a75a3",
        "title": "The Defiant: The Video Game Taking on the Eastern Battlefield",
        "summary": "A team of young Chinese innovators are using a video game to tell the story of China’s fortitude during the War of Resistance against Japanese Aggression.",
        "source": "cgtn",
        "date": "2025-08-27T20:25:59+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/The-Defiant-The-Video-Game-Taking-on-the-Eastern-Battlefield-1GbnnLACUAU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b2eb53feb1be87c5ae1b61bcb2238f9978673bdad8314c80290114c6c24ea67c",
        "title": "Meituan sales weaken, profit plummets amid ‘irrational’ delivery price war",
        "summary": "Chinese on-demand local services giant Meituan said its second-quarter earnings fell sharply, as it faced off against Alibaba Group Holding and JD.com in a costly delivery price war.\nMeituan’s management, however, said on Wednesday’s earnings call that the company would not be “greatly affected by a short-term price war”, highlighting its operational efficiency.\nStill, the management said the company would continue to prioritise growth over profitability in instant commerce. They also projected...",
        "source": "smcp",
        "date": "2025-08-27T20:12:43+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3323379/meituan-sales-weaken-profit-plummets-amid-irrational-instant-delivery-price-war?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a30bad2416dbf4912722ab2a323f9b371280cd75589b639f41a233621263d16a",
        "title": "China rejects Trump proposal to join US-Russia nuclear disarmament talks",
        "summary": "China’s foreign ministry said on Wednesday it was “neither reasonable nor realistic” for Beijing to join trilateral nuclear disarmament talks reportedly discussed between US President Donald Trump and his Russian counterpart Vladimir Putin in Alaska.\nTrump told reporters on Monday that Washington and Moscow were discussing ways to reduce their nuclear arsenals, adding that he hoped Beijing would also join the process.\nOn Wednesday, foreign ministry spokesman Guo Jiakun rejected the...",
        "source": "smcp",
        "date": "2025-08-27T20:04:33+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3323375/china-rejects-trump-proposal-join-us-russia-nuclear-disarmament-talks?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b233a94b9d213ca7e9c9b10c3f5aa3f465c747675e2659bdf76f5a06df51e098",
        "title": "Beijing says Taiwanese invited to Victory Day parade – but doesn’t specify who",
        "summary": "A number of Taiwanese have been invited to next month’s Victory Day military parade on the mainland, Beijing said on Wednesday, hitting out at Taipei’s warning to Taiwanese artists supporting the event.\nZhu Fenglian, spokeswoman for the mainland’s Taiwan Affairs Office, said that representatives from various sectors of society, including Taiwan compatriots, would take part in the parade on September 3 to mark the 80th anniversary of Japan’s defeat in World War II.\n“All of the Chinese people,...",
        "source": "smcp",
        "date": "2025-08-27T19:04:46+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3323370/beijing-says-taiwanese-invited-victory-day-parade-doesnt-specify-who?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "938e80de9bfbcd3ba24901851225fd5ca439e66e480fdbfde548e79260578efa",
        "title": "China’s infrastructure push in Tibet aims to elevate investments on world’s roof",
        "summary": "From giant dams to sprawling railways, Beijing has pledged to step up investments along the so-called roof of the world, led by state-owned enterprises, as China marks the 60th anniversary of the Tibet autonomous region’s establishment.\nThe State-owned Assets Supervision and Administration Commission (Sasac), China’s top state asset regulator, is calling for more targeted measures to boost industries, with more capital flowing into grass-roots projects and a greater promotion of cultural and...",
        "source": "smcp",
        "date": "2025-08-27T19:00:18+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3323352/china-elevates-infrastructure-push-tibet-aiming-raise-investments-worlds-roof?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "25d630962c8083c8096f9ab2290b3fc64abb500f36c6767c366d962c2373fcb5",
        "title": "Tianjin gears up for SCO Summit",
        "summary": "As the 2025 Shanghai Cooperation Organization (SCO) Summit approaches, the host city of Tianjin is making its final preparations.",
        "source": "cgtn",
        "date": "2025-08-27T18:34:59+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Tianjin-gears-up-for-SCO-Summit-1Gbfj5oQyGc/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0a271901f05ec34874b680dd864c7e81aa535272ffb743b7634247f78a1cc313",
        "title": "China's first 8K film shot in space to hit the big screen",
        "summary": "What does it feel like to travel aboard a spaceship? How does Earth look from orbit? What is it like to live and work in space? \"Shenzhou 13,\" China's first 8K film shot in space, brings the answers to the big screen.",
        "source": "cgtn",
        "date": "2025-08-27T18:34:15+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/China-s-first-8K-film-shot-in-space-to-hit-the-big-screen-1Gbf2XaGaha/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ff969796076333e2fae8ec3e6167d4922a046e2c9dc3bdb5a5579b9bc8390b31",
        "title": "Mainland slams DPP for blocking Taiwan people from war commemoration",
        "summary": "Mainland slams DPP for blocking Taiwan people from war commemoration",
        "source": "cgtn",
        "date": "2025-08-27T18:32:41+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Mainland-slams-DPP-for-blocking-Taiwan-people-from-war-commemoration-1Gb2GNsZOy4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a2de64800147fcd94bb4f02786520038eb3e90c8c214ea1e1dcdd806a1f1dd50",
        "title": "Seoul balks at Taiwan role for US troops stationed in South Korea",
        "summary": "Seoul may be reluctant to support the White House’s call for South Korea-based US troops to shift their focus from the North to a Taiwan conflict but it might be forced to get behind the strategy, according to analysts.\nOn his way to meet his US counterpart in Washington on Sunday, South Korean President Lee Jae-myung said it would be difficult to agree to an American demand for US Forces Korea (USFK) to have “strategic flexibility”.\n“This is not an issue we can easily agree with,” said Lee, who...",
        "source": "smcp",
        "date": "2025-08-27T18:32:15+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3323355/seoul-reluctant-trumps-push-more-flexible-us-forces-korea-taiwan-contingency?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "473ff00a958be88648ac335f06d9902f1ca35c6232339d1381f6fe702bb20974",
        "title": "What worries Chinese businesses most about political chaos in France?",
        "summary": "The Chinese business community in France is anxiously awaiting clarity on the country’s economic direction following French Prime Minister Francois Bayrou’s shock announcement on Monday that he plans to call a vote of confidence on his centrist minority government on September 8.\nHis high-stakes gamble, which most political pundits expect to fail, is of particular concern for Chinese businesses because it could open the door to power for the protectionist far-right National Rally party.\nBayrou...",
        "source": "smcp",
        "date": "2025-08-27T18:30:22+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3323360/what-worries-chinese-businesses-most-about-political-chaos-france?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "856fa6f4ffff03751f7a2a773f56beb0234794cc4f53f3bc90dfc5eaa531cab8",
        "title": "Sandstorm batters Chinese farm as live-streamer tries selling melons",
        "summary": "A sandstorm battered a farm in western China’s Xinjiang Uygur autonomous region as a man tried selling melons on a live-streaming platform.",
        "source": "smcp",
        "date": "2025-08-27T18:15:12+09:00",
        "url": "https://www.scmp.com/news/china/article/3323324/sandstorm-batters-chinese-farm-live-streamer-tries-selling-melons?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1d2806a851f2938713c7a1a7e04da3071e6a8c43e21a69fef121c244e31df946",
        "title": "China's trade with SCO member states hits record high, 2024",
        "summary": "In 2024, the total trade volume between China and other SCO member states amounted to approximately $512.4 billion, marking a 2.7-percent increase compared to the previous year, said the Chinese Commerce Ministry on Wednesday.",
        "source": "cgtn",
        "date": "2025-08-27T18:01:15+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/China-s-trade-with-SCO-member-states-hits-record-high-2024-1Gb9tXgjzsA/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "cb6b422e36976aec9d1fddbe645f23099b7db49a50e1545d17aa3578db49454f",
        "title": "Cyberpunk Labubu takes Chongqing by storm",
        "summary": "A giant, cyberpunk-style Labubu has made an appearance in Chongqing's Changjiahui Shopping Park, drawing crowds of residents and tourists to take photos and check in online.",
        "source": "cgtn",
        "date": "2025-08-27T17:53:16+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Cyberpunk-Labubu-takes-Chongqing-by-storm-1GbchDq1eEw/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "817a73855b8ef1cb1154b2a75ac08cf426a936a0930f857c49a93c357023e8ce",
        "title": "Rhythms of Tianjin: A cultural journey through jingyun dagu",
        "summary": "The 2025 Shanghai Cooperation Organization (SCO) Summit is being held in Tianjin from August 31 to September 1. Located in north China, the city boasts a rich cultural heritage and beautiful coastal scenery.",
        "source": "cgtn",
        "date": "2025-08-27T17:51:31+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Rhythms-of-Tianjin-A-cultural-journey-through-jingyun-dagu-1Gb8xQT1OGA/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d95bc545d54494a3c456e2b3af7f16591103d78fa1da2cc3af93ab6d8cfd54b5",
        "title": "The Unsung Ally｜From Expeditionary Army to Hump Route",
        "summary": "From the Hump to the Burma Road, from defending China’s lifeline during the War of Resistance against Japanese Aggression to rescuing Allied forces, countless Chinese soldiers and civilians sacrificed their lives. After tireless efforts, China and the Allies were eventually able to celebrate together in victory.",
        "source": "cgtn",
        "date": "2025-08-27T17:45:55+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/The-Unsung-Ally-From-Expeditionary-Army-to-Hump-Route-1Gba8pPLAk0/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f9a6b2305d5157a91b52ac39965e127c70561bbf14c336dd0c701cbf2acceadb",
        "title": "China announces press briefings on victory anniversary events",
        "summary": "China on Wednesday announced plans to hold three press conferences and three group interviews to further outline preparations on the upcoming victory anniversary events.",
        "source": "cgtn",
        "date": "2025-08-27T17:30:47+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Media-center-to-hold-press-conference-for-victory-anniversary-events-1Gb7bsBBbOg/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "dfb2ee1b3bab525bc8aa58c919ac6f912a060812b677ef1d1bcb98e130e053b3",
        "title": "World's tallest bridge completes load test in China's Guizhou",
        "summary": "The Huajiang Grand Canyon Bridge in southwest China's Guizhou Province, completed a key load test on Monday, ahead of its scheduled opening in late September.",
        "source": "cgtn",
        "date": "2025-08-27T17:28:54+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/World-s-tallest-bridge-completes-load-test-in-China-s-Guizhou-1Gb9oWzMvAs/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "57107b95368da6564e395957f6ceeb5c6152424b48c8f2f08eae49c29788d80c",
        "title": "Love in the East: A fusion of cultures and hearts",
        "summary": "Love in the East: A fusion of cultures and hearts",
        "source": "cgtn",
        "date": "2025-08-27T17:02:09+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Love-in-the-East-A-fusion-of-cultures-and-hearts-1Gb3vIQDZGo/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "9d740c2fe8866730cd5d198c45f70caab7a62126f65455c3babd51481ee03353",
        "title": "China races to embed AI use across major industries with ambitious 2030 target",
        "summary": "In its latest road map for artificial intelligence, China has set targets for the adoption of AI-powered devices across various industries – aiming for over 70 per cent by 2027 and over 90 per cent by 2030.\nThe targets, unveiled in guidelines by the State Council, China’s cabinet, on Tuesday, are part of Beijing’s “AI Plus” strategy, which seeks to integrate the cutting-edge technology across manufacturing, agriculture and services.\n“[The strategy aims to] boost productivity, reshape how...",
        "source": "smcp",
        "date": "2025-08-27T17:00:17+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3323323/china-races-embed-ai-use-across-major-industries-ambitious-2030-target?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cfe281eb505f4834d5f2d7054dcb0e01bb8cdb83f591d4cfca723292791b644a",
        "title": "Southwest Associated University: A miracle of education in wartime",
        "summary": "In our series \"Art Amid the Flames,\" we explore how Chinese artists, scholars, and institutions kept culture and creativity alive during the Chinese People's War of Resistance Against Japanese Aggression.",
        "source": "cgtn",
        "date": "2025-08-27T16:43:46+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Southwest-Associated-University-A-miracle-of-education-in-wartime-1GaWPZGjXBS/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "478110c93bc1f0dd3f1be12188d5dc2bd3a88d00040c2f5f07312c411063acda",
        "title": "Kazakhstan set to launch film-inspired tourism routes to China",
        "summary": "Kazakhstan plans to launch film-themed travel routes tailored to the country's growing number of Chinese visitors, with the aim of strengthening mutual understanding between the two nations.",
        "source": "cgtn",
        "date": "2025-08-27T16:31:13+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Kazakhstan-set-to-launch-film-inspired-tourism-routes-to-China-1Gb6miWkwWQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "14c5e197b2c493ca58d8d8d417bec336e10a1deb185318fc93b016ca3568cb29",
        "title": "Experiencing Tianjin's woodblock tradition with a friend from Pakistan",
        "summary": "A centuries-old tradition, explored with fresh curiosity and a beginner's eye. Would you like to try making your own print?",
        "source": "cgtn",
        "date": "2025-08-27T16:29:23+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Experiencing-Tianjin-s-woodblock-tradition-with-a-friend-from-Pakistan-1Gb2RM2hmbC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "9a2b6df0251b01318387068f0b1013446ff07b97d5c8e6efa9f921800150cd9a",
        "title": "China’s high-speed jet drone, aviation expert leaves US: 7 science highlights",
        "summary": "We have put together stories from our coverage on science from the past two weeks to help you stay informed. If you would like to see more of our reporting, please consider subscribing.\n1. China’s first high-speed jet drone makes every warship an aircraft carrier\nIn an aviation tech breakthrough that could change naval warfare, Chinese aerospace engineers have unveiled what could be the world’s first high-speed vertical take-off and landing (VTOL) drone powered by a jet engine. The sleek,...",
        "source": "smcp",
        "date": "2025-08-27T16:02:07+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3323300/chinas-first-high-speed-jet-drone-top-aviation-engineer-leaves-us-7-science-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7d478240fe1cb08c794673b425dc20cc25626795f6446fb2b099501edb55923f",
        "title": "CR Land, Sunac post better interim results in signs of property recovery",
        "summary": "China’s embattled property market is showing signs of a tentative recovery, as some developers posted stronger earnings and reduced losses, supported by government stimulus measures and recovering consumption.\nChina Resources Land’s first-half net profit increased by 16.2 per cent from last year to 11.9 billion yuan (US$1.66 billion), according to the state-owned developer’s statement on Wednesday. Sales rose 20 per cent to 94.9 billion yuan.\nSunac, one of China’s largest privately owned...",
        "source": "smcp",
        "date": "2025-08-27T16:00:08+09:00",
        "url": "https://www.scmp.com/business/article/3323304/cr-land-sunac-post-better-interim-results-chinas-property-shows-signs-recovery?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "281baf82893fab7e8224535d377c4e55bd32061134c3d0392439b6740de18987",
        "title": "China issues updated palliative care guidelines",
        "summary": "China issues updated palliative care guidelines",
        "source": "cgtn",
        "date": "2025-08-27T15:03:11+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/China-issues-updated-palliative-care-guidelines-1GaUeksiMFy/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a313ab46ee6a8d5f67e6e85d9e778937653bd3171b44ccdd33fd1c48e2922520",
        "title": "China tests meltdown-proof tech for nuclear waste-recycling fast reactor",
        "summary": "China has tested a new residual heat removal system that could make its next-generation, radioactive waste-recycling nuclear power plants more meltdown-proof.\nThe China Institute of Atomic Energy said it “recently” conducted the simulation of a passive heat removal system for fast nuclear reactors, calling it a breakthrough in the development of a fourth-generation nuclear plant with a closed-loop fuel cycle.\n“This is the first proof-of-principle test in China for a new passive residual heat...",
        "source": "smcp",
        "date": "2025-08-27T15:00:15+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3323301/china-tests-meltdown-proof-tech-nuclear-waste-recycling-fast-reactor?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7a30aaf0a7be3a6377b84160a96ea5dd5380596134ea268693e0e482ab1c9ce3",
        "title": "19 national key laboratories unveiled in Hong Kong and Macao",
        "summary": "19 national key laboratories unveiled in Hong Kong and Macao",
        "source": "cgtn",
        "date": "2025-08-27T14:57:25+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/19-national-key-laboratories-unveiled-in-Hong-Kong-and-Macao-1GaGum8fzji/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "57b2369eebb85fe1f02cfc636337fb1b89011b4e7e066e7e156eed4e271bb600",
        "title": "China issues guideline to deepen AI Plus integration across sectors",
        "summary": "China released a guideline on deepening the implementation of its \"Artificial Intelligence (AI) Plus initiative\" on Tuesday, setting out a framework to integrate AI into key sectors to foster the development of new quality productive forces.",
        "source": "cgtn",
        "date": "2025-08-27T13:51:40+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/China-issues-guideline-to-deepen-AI-Plus-integration-across-sectors-1GaUlVoxaqQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "6f5e23d96ac0241be1f6dfcd6200edffe0914e5ab13a3b1dfb03d8fd03f0b019",
        "title": "China’s ‘little Nvidia’ sees 4,348% revenue surge amid AI stock frenzy",
        "summary": "Cambricon Technologies, the Beijing-based chipmaker seen as a potential alternative to Nvidia’s graphics processing units (GPUs), reported a record revenue surge in the first half amid a Chinese stock market frenzy driven by DeepSeek’s breakthrough AI models.\nCambricon’s revenue surged 4,348 per cent year on year to 2.88 billion yuan (US$403.8 million) in the first six months of 2025, a record high for the company since it went public in 2020.\nProfit reached 1.04 billion yuan, reversing a net...",
        "source": "smcp",
        "date": "2025-08-27T13:43:12+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3323288/chinas-little-nvidia-cambricon-sees-4348-cent-revenue-surge-amid-ai-frenzy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "45e807c775e91c0ea77e5b04eef39555a898896dd43696b85ef6eefcaf99b7fb",
        "title": "China’s industrial profits fall more slowly amid crackdown on price wars",
        "summary": "China’s industrial companies saw their profits fall at a slower pace in July, in a potential sign that efforts to curb overcapacity are starting to ease the strain from aggressive competition among producers.\nIndustrial profits declined 1.5 per cent last month from a year earlier, falling the least since they began shrinking in May, according to data released on Wednesday by the National Bureau of Statistics. For the first seven months of the year, earnings contracted 1.7 per cent year on...",
        "source": "smcp",
        "date": "2025-08-27T13:07:31+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3323281/chinas-industrial-profits-fall-more-slowly-amid-crackdown-price-wars?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5a253ad08fee68dabd88883e641e6291ce9093904d1bbda86878ee304f8f2e94",
        "title": "China’s Tiangong beats ISS in heated space research race",
        "summary": "China’s Tiangong space station has set a new record in space-based materials research after a tungsten alloy was heated to temperatures exceeding 3,100 degrees Celsius (5,612 degrees Fahrenheit).\nThat surpasses the highest temperatures previously achieved aboard the International Space Station (ISS).\nOn the ISS’s Japanese module, Kibo, scientists used a similar method – known as electrostatic levitation – to suspend tiny metal samples in mid-air and heat them with lasers, reaching around 3,000...",
        "source": "smcp",
        "date": "2025-08-27T13:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3323171/chinas-tiangong-beats-iss-heated-space-research-race?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f7be0a7f7d02f2cc7d641e5f032a71eabb5e3edc41e9a277b0f4ecfadee43f50",
        "title": "China allocates 540m yuan for flood-related road emergencies",
        "summary": "China allocates 540m yuan for flood-related road emergencies",
        "source": "cgtn",
        "date": "2025-08-27T12:58:12+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/China-allocates-540m-yuan-for-flood-related-road-emergencies-1GaS6Nw4ymA/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "4056eafdd209c8749d1b3d436cadeac3d3922d9ec47751b3970cbd2e4eab9cb3",
        "title": "China launches two mega dredgers, marking milestone in dredging tech",
        "summary": "China Communications Construction Company (CCCC) Tianjin Dredging Co., Ltd. on Tuesday announced the successful launch of the \"Tongjun\" dredger, a 35,000 cubic meter capacity, ultra-large, self-propelled grab suction dredger.",
        "source": "cgtn",
        "date": "2025-08-27T11:29:48+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/China-launches-two-mega-dredgers-marking-milestone-in-dredging-tech-1GaFkDppOQU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0a9dfd8111c79e204922e97ead7fa996c054524fea6e97ce164e3e1ada7311ca",
        "title": "Chinese Tech Helps Tajik Cement Plant Enter the Future",
        "summary": "After lunch, Tajik engineer Firdavs Hasanov inspects a batching unit at the new Tajik Cement CJSC plant–a 35-hectare facility on Dushanbe's outskirts, powered by advanced Chinese tech and equipment.",
        "source": "cgtn",
        "date": "2025-08-27T11:19:30+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Chinese-Tech-Helps-Tajik-Cement-Plant-Enter-the-Future-1G9xgPT2Vna/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d1117f5fff479aa2c236c6a55260810f25a9f0e82b7afa7fe2cfe5dd1778e2de",
        "title": "Zhao Leji holds talks with Swiss council of states president",
        "summary": "China's top legislator Zhao Leji met with Andrea Caroni, president of the Council of States of Switzerland, in Beijing on Tuesday.",
        "source": "cgtn",
        "date": "2025-08-27T11:02:39+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/Zhao-Leji-holds-talks-with-Swiss-council-of-states-president-1GaEihyOICI/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "7808d9bc3b12cce20037fda9a85a25ac769f9a7e96f54941dab3b9e15faa1ffc",
        "title": "China's SCIO holds presser on CIFTIS 2025 preparations",
        "summary": "China's SCIO holds presser on CIFTIS 2025 preparations",
        "source": "cgtn",
        "date": "2025-08-27T11:00:48+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/China-s-SCIO-holds-presser-on-CIFTIS-2025-preparations-1GaJGMypFkI/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "965252ced0797aa82ab7ad4749f72da8fcd94bdab47e9d0d40c1f7dea74298a5",
        "title": "In a first, US-China team turns plastic waste into petrol in 1 step",
        "summary": "Scientists in the US and China say they have developed a one-step method to safely turn toxic mixed plastic waste into petrol, with more than 95 per cent efficiency at room temperature.\nCompared to conventional ways of turning plastic into fuel, their process requires less energy, less equipment and fewer steps, making it scalable for industrial applications.\nAt the end of this conversion process are the main components of petrol or gasoline, chemical raw materials, and hydrochloric acid. That...",
        "source": "smcp",
        "date": "2025-08-27T10:00:14+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3323139/first-us-china-team-turns-plastic-waste-petrol-one-step?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "17211260f9c0e14cdc7604e38ded37397d4425e1836647f089d1dba1b79d867d",
        "title": "China's top legislature schedules session for September",
        "summary": "The Standing Committee of the 14th National People's Congress (NPC), China's top legislature, will hold its 17th session in Beijing from September 8 to 12.",
        "source": "cgtn",
        "date": "2025-08-27T09:37:55+09:00",
        "url": "https://news.cgtn.com/news/2025-08-27/China-s-top-legislature-schedules-session-for-September-1GazAdYrwwU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "39f9205548956b0ccf4b454f0b82e686bffb104bc1ab1097863c8a5838de04ba",
        "title": "New US consul general Julie Eadeh arrives in Hong Kong to take up post",
        "summary": "Julie Eadeh, the new US consul general for Hong Kong and Macau, has arrived in the city, the US diplomatic service said on Wednesday afternoon.\nThe US consulate general posted on social media that it was “pleased to announce that Julie Eadeh has arrived in Hong Kong, succeeding consul general Greg May, who left Hong Kong last month”.\nThe confirmation came just hours after the South China Morning Post reported her imminent arrival.\nIt also reported in July that Eadeh, a career diplomat who served...",
        "source": "smcp",
        "date": "2025-08-27T09:00:18+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3323227/new-us-envoy-julie-eadeh-arrive-hong-kong-month-sources?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "56ccf3254d27eb2111ed07deb2b970cd0b32aa56e91ed8e7e64502cbad5881c1",
        "title": "As the world watches PLA approach 100, is it truly ‘capable of winning wars’?",
        "summary": "China is on a mission to turn its military into a modern fighting force. In the final article in this four-part series, we look at President Xi Jinping’s military goals and obstacles facing the People’s Liberation Army.\nThe 80th anniversary of China’s victory over Japan in World War II is intended to display both the strength and solidarity of the People’s Liberation Army.\nBut just two weeks before it is set to take place, Beijing announced that former navy chief of staff Li Hanjun – a veteran...",
        "source": "smcp",
        "date": "2025-08-27T07:00:09+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3323170/chinas-2027-pla-goal-victory-day-parade-puts-progress-and-challenges-show?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7c61863146bacdb770435907f7f447e05bbade8f2b54163c3196b89595e85343",
        "title": "As the West cedes leverage over Ukraine, China stands to benefit",
        "summary": "It seems clear that US President Donald Trump achieved little more than a photo opportunity from the bilateral summit in Anchorage, Alaska, with Russian President Vladimir Putin and his subsequent meeting with Ukrainian President Volodymyr Zelensky and other European leaders. Now, a ceasefire seems more out of reach than ever.\nFor a negotiated peace agreement, Putin has insisted on his demands that Ukraine give up ambitions to join the North Atlantic Treaty Organisation, as well as land occupied...",
        "source": "smcp",
        "date": "2025-08-27T06:30:07+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3323077/china-may-not-be-waging-war-ukraine-it-still-stands-win?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "647893e518e17cb04341d6cec0212e5d71f9f26d997a10ca94d4b57f4b72c041",
        "title": "Brazilians’ negative views of US double, China sees sharp rise in positives: poll",
        "summary": "Brazilians now view the United States more negatively than positively for the first time in two years, according to a new survey released on Tuesday, while perceptions of China have improved.\nThe shift follows US President Donald Trump raising tariffs on Brazilian exports and tightening visa rules, moves that unsettled a country long accustomed to close economic ties with Washington.\nThe Quaest poll found 48 per cent of Brazilians hold an unfavourable opinion of the US, double the level recorded...",
        "source": "smcp",
        "date": "2025-08-27T03:34:27+09:00",
        "url": "https://www.scmp.com/news/us/article/3323256/brazilians-negative-views-us-double-china-sees-sharp-rise-positives-poll?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "46397bc138348ff90e2745318931f84f15f7d9776244df36d44ee8b539bf2737",
        "title": "Trump calls criticism of move to admit thousands of Chinese students ‘insulting’",
        "summary": "US President Donald Trump on Tuesday defended his proposal to admit hundreds of thousands of Chinese students, saying the US is “honoured” to host them and warning that the American college system would “go to hell” without them.\nFacing growing anger from his political base, Trump dismissed criticism of the plan as “insulting” and pointed to his relationship with Chinese President Xi Jinping as part of a broader strategy of engagement.\n“We’re getting along very well with China, and I’m getting...",
        "source": "smcp",
        "date": "2025-08-27T03:29:29+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3323255/trump-base-erupts-over-his-move-admit-thousands-more-chinese-students?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c3ffb518dd01e80917b88bfb4e099944e9153d878b86d4f0f8299c1d304eb73e",
        "title": "EU urged to unleash ‘trade bazooka’ in response to Trump’s tariff threats",
        "summary": "Calls are mounting for the European Union to fire its “trade bazooka” at Washington after US President Donald Trump threatened tariffs and export restrictions on countries applying digital laws and taxes to American firms.\nIn a late-night post on social media, Trump vowed to slap “substantial additional tariffs” and restrict the export of “technology and chips” to countries enforcing “digital taxes, legislation, rules or regulations”.\nWhile he did not name Europe directly, the American leader...",
        "source": "smcp",
        "date": "2025-08-27T01:00:12+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3323240/eu-urged-unleash-trade-bazooka-response-trumps-tariff-threats?utm_source=rss_feed",
        "reportUrl": ""
    }
]