[
    {
        "id": "a75818fa3109db5d5db9193c215cb4486dcb793c1b300b8cd2c1bb4f7dda12a4",
        "title": "Sino-Dutch dispute over chipmaker Nexperia puts car sector supply chain at risk",
        "summary": "Semiconductor manufacturer Nexperia’s homebase in Nijmegen – the biggest city in Gelderland, the Netherlands’ largest province – offers few clues that it sits in the eye of a storm that threatens to disrupt the global car industry’s supply chain.\nDutch daily newspaper De Gelderlander, for example, featured more local stories including an explosion at a neighbourhood cannabis store, referred to as “coffeeshop”.\nThere were no banner headlines to be found about talks in Brussels on Tuesday between...",
        "source": "smcp",
        "date": "2025-10-26T12:00:27+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3330305/nexperia-crisis-sino-dutch-dispute-over-chipmaker-puts-car-industry-supply-chain-risk?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "75c15f816c58109ae9f2acbc8b28bc73c744076d62015053dd15bbc5b45ac0e5",
        "title": "Can the KMT’s new outspoken chairwoman win over Taiwan’s mainstream voters?",
        "summary": "The choice of an outspoken former legislator as chairwoman of Taiwan’s biggest opposition party may address the growing internal fatigue with the Kuomintang’s (KMT) old guard, but analysts warn it is far from certain that what appealed to members will win over mainstream voters.\nCheng Li-wun, a 55-year-old with roots in street activism and an early career inside the independence-leaning Democratic Progressive Party (DPP), defeated 73-year-old heavyweight Hau Lung-bin in last weekend’s election...",
        "source": "smcp",
        "date": "2025-10-26T11:00:08+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3330318/can-kmts-new-outspoken-chairwoman-cheng-li-wun-win-over-taiwans-mainstream-voters?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "285c255f5f659d27aa226e705e110020ee7972bd17dbaa71138c8dda1c6953e5",
        "title": "How Chinese jeweller Laopu Gold has become a luxury phenomenon",
        "summary": "At the newly opened Laopu Gold store in Hong Kong’s IFC Mall, it was quiet on a weekday afternoon. The barriers at the entrance, the spacious lounge and private rooms inside all exude the luxury image the brand aspires to project.\nA few days ago, long queues were seen before the shop’s opening, with some arriving hours earlier to secure a chance to buy gold jewellery at a discount as part of its inaugural promotion.\nThe Beijing-based jeweller has defied China’s sluggish consumption trend, in...",
        "source": "smcp",
        "date": "2025-10-26T10:30:21+09:00",
        "url": "https://www.scmp.com/business/companies/article/3330274/how-chinese-jeweller-laopu-gold-has-become-luxury-phenomenon?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4eab4fb7e084103d379f533df0dca79490136e464bff65b766615792c7d92697",
        "title": "China is supporting multilateralism one institution at a time",
        "summary": "The International Organisation for Mediation (IOMed) was inaugurated at its headquarters in Wan Chai on Monday, bringing the new China-led mechanism into operation to fill the void in dispute resolution. With 37 signatories, the organisation is attracting Western interest, particularly from Switzerland.\nThe IOMed is just one among several bodies announced by or established in China this year. They include the World Artificial Intelligence Cooperation Organisation, Unesco’s International...",
        "source": "smcp",
        "date": "2025-10-26T10:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3330086/china-supporting-multilateralism-one-institution-time?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e7d6b015c197df84baa0373bc357d02395cf4667ab3382ff9140e74b96d653a3",
        "title": "Losing its sparkle? How Chinese artificial gems are upending the diamond market",
        "summary": "Creating a new diamond used to be a process spanning millions or even billions of years. Now, it takes about a week.\nInside specialised factories, hulking 50-tonne machines simulate the crushing pressure and extreme temperatures inside the Earth’s crust, transforming seed crystals into flawless, glittering stones in just a few days.\nZhongjing Diamond, a company based in China’s central province of Hubei, has nearly 300 of the machines humming around the clock, which together mint some 600,000...",
        "source": "smcp",
        "date": "2025-10-26T07:00:14+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330244/china-churns-out-artificial-gems-diamond-still-forever?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3678f85a5494d2f5da090818804670f26831b844fb439e5915503146715121c6",
        "title": "Amid a wave of foreclosures, China’s homeowners could use a break",
        "summary": "Few outside China might know that e-commerce giants Alibaba and JD.com host the country’s largest online platforms for distressed property sales. On any given day, their auction websites offer a front-row view of China’s housing downturn where properties are foreclosed and liquidated under court orders, often at market-shaking discounts.\nA month ago, 66 flat units in a Shanghai project owned by indebted developer Sunac were put up for auction after being seized by courts. Buyers were found but...",
        "source": "smcp",
        "date": "2025-10-26T06:30:07+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3330176/amid-wave-foreclosures-chinas-homeowners-could-use-break?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7343b232a425889c53fd71224cdc3e90685bcf2095b142e794c8e684598baca4",
        "title": "Could China ‘militarise’ cryptocurrencies to beat financial sanctions?",
        "summary": "Digital currency is emerging as a powerful, disruptive tool in global geopolitics, fundamentally reshaping the financial battlefield in times of conflict, according to a commentary in a key Communist Party publication.\nNations are increasingly leveraging digital assets to bypass international sanctions, mobilise vital resources and maintain economic stability during regional conflicts, according to the author of an article published on Monday in Study Times, the official newspaper of the Central...",
        "source": "smcp",
        "date": "2025-10-26T00:55:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330105/could-china-militarise-cryptocurrencies-sanction-proof-its-economy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b7ee5f708f38f5592ceda79363bdb550198e3a5f3de2f59bc1eb37fd8a6544d2",
        "title": "Chinese President Xi Jinping puts personal stamp on 5-year plan",
        "summary": "Chinese President Xi Jinping put his personal stamp on the national master plan for the next five years, with state media describing the plan’s framework as Xi’s brainchild – an indication of the document’s political weight.\nIn a lengthy article on Saturday detailing some of the build-up to the Communist Party’s fourth plenum this week, state news agency Xinhua and party mouthpiece People’s Daily said Xi “personally headed” the team that drafted the outline for the next five-year plan.\n“[He]...",
        "source": "smcp",
        "date": "2025-10-25T23:20:04+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3330329/chinese-president-xi-jinping-puts-personal-stamp-5-year-plan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "710f417354d4840935135c98b22764e5c83c407d7a8e576b3826c2a79b743c1e",
        "title": "China unveils ‘ghost’ drone for stealth underwater surveillance",
        "summary": "Chinese scientists have created a ghostlike jellyfish robot that can carry out covert underwater missions.\nDescribed as an “underwater phantom”, the bionic jellyfish robot was developed by Tao Kai from Northwestern Polytechnical University’s school of mechanical and electrical engineering in Xian, Shaanxi province.\nAccording to the university, the robot is nearly indistinguishable from real jellyfish when submerged, enabling intelligent detection and real-time monitoring in aquatic...",
        "source": "smcp",
        "date": "2025-10-25T23:00:08+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330169/china-unveils-ghost-drone-stealth-underwater-surveillance?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c9ce8eb406a4fcff7723731c3eb5f4ab2697364b2dd903a1e61a8b6f34b68a8d",
        "title": "Beijing takes aim at ‘Taiwan independence’ in restoration day address",
        "summary": "Beijing will leave no room for any form of “Taiwan independence” separatist activities, one of Beijing’s most senior leaders said on Saturday, marking the 80th anniversary of the island’s return from Japanese rule.\n“We should work together to advance the cause of national reunification and must leave no room for any form of ‘Taiwan independence’ separatist activities,” Wang Huning, Beijing’s No 4 official and top political adviser, said at an event to commemorate “Taiwan Restoration Day”.\n“[We]...",
        "source": "smcp",
        "date": "2025-10-25T21:48:15+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3330323/beijings-wang-huning-takes-aim-taiwan-independence-restoration-day-address?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "959ec9c3f9979444e8b61e351f10320ab232cc862a3bb51a9b37c8b7c6e173e3",
        "title": "China’s shift to higher-end exports lifts margins as US reliance shrinks: report",
        "summary": "Flagship Chinese companies, spanning sectors from tech to retail, are increasingly shunning the United States and expanding in less-developed markets such as Southeast Asia, where they can leverage historic low-cost advantages and build out supply chains, a Goldman Sachs strategist said.\nChinese exports to non-US markets have grown at a compound annual rate of about 7.5 per cent since 2018, according to a research note by the investment bank. In contrast, exports to the US have declined by 0.6...",
        "source": "smcp",
        "date": "2025-10-25T19:00:13+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3330215/china-shift-higher-end-exports-boosts-margins-mutual-gains-us-reliance-dips-report?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f05da7a95a402c278e4c39e49bff473a537dd96688acc9e2e625a9df29624ec1",
        "title": "Von der Leyen vows to strike back against China as EU feels rare earths squeeze",
        "summary": "The European Union is ready to retaliate against China’s export restrictions on rare earths, commission chief Ursula von der Leyen said in a hardline speech on Saturday.\n“In the short term, we are focusing on finding solutions with our Chinese counterparts. But we are ready to use all of the instruments in our toolbox to respond if needed. And we will work with our G7 partners on a coordinated response,” von der Leyen told the Berlin Global Dialogue conference.\nShe also announced a new plan to...",
        "source": "smcp",
        "date": "2025-10-25T18:51:37+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330313/von-der-leyen-vows-strike-back-against-china-eu-feels-rare-earths-squeeze?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ebc1f09d8dd4f23e6be8c7d0a6c339cec1f3e5db8c6c4cb9a17a3d3b866d5fe3",
        "title": "China bids farewell to Nobel Prize-winning physicist Chen-ning Yang",
        "summary": "Chinese President Xi Jinping sent a wreath to the funeral on Friday of Chen-ning Yang, a Nobel Prize-winning theoretical physicist who died in Beijing last Saturday at the age of 103.\nCai Qi, the president’s chief of staff, was also among the Communist Party dignitaries to offer floral tributes for the ceremony at the Babaoshan Revolutionary Cemetery in western Beijing, where many of the country’s leaders are interred.\nThe farewell ceremony began at around 9am, with the late professor draped in...",
        "source": "smcp",
        "date": "2025-10-25T17:29:50+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330306/china-bids-farewell-nobel-prize-winning-physicist-chen-ning-yang?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "dd379738827c325ca8d14b835bd3f6401f6ed4730ab5c7e379c25a7029347898",
        "title": "Chinese envoy calls for ‘shared prosperity’ as possible Xi-Trump summit approaches",
        "summary": "Beijing’s top envoy in Washington has emphasised the need for “shared prosperity”, framing a possible summit between US President Donald Trump and Chinese President Xi Jinping next week in South Korea as an opportunity for cooperation rather than confrontation.\nSpeaking at an event on Friday, China’s ambassador to the United States, Xie Feng, said that China and the US, as the world’s two largest economies, should improve communication and manage their differences.\n“In this chaotic world, we...",
        "source": "smcp",
        "date": "2025-10-25T13:41:10+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330299/chinese-envoy-calls-shared-prosperity-possible-xi-trump-summit-approaches?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "dca97dd3ccdda072c6e0ce8b04a1aa46d3f74a2064b54d6544b35baaa867b691",
        "title": "Chinese sanctions will cost a South Korean shipbuilder but could boost US ties",
        "summary": "China’s sanctions on Hanwha Ocean will drive up the firm’s costs in the medium term but may also end up boosting South Korean ties with the US over the long term as Washington seeks to expand naval shipbuilding capacity, analysts said.\nLast week, the Chinese commerce ministry announced it had imposed sanctions on five US-based affiliates of Hanwha Ocean, one of South Korea’s largest shipbuilding companies.\nThe ministry alleged that Hanwha had supported Washington’s investigation into Chinese...",
        "source": "smcp",
        "date": "2025-10-25T13:00:12+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3330219/chinese-sanctions-will-cost-south-korean-shipbuilder-could-boost-us-ties?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f9e884c0e965b2401ca7f61b066e548386cc465384de22ca79db41e35f30d41d",
        "title": "China, US trade talks start in Kuala Lumpur ahead of possible Xi-Trump summit",
        "summary": "Chinese Vice-Premier He Lifeng and US Treasury Secretary Scott Bessent have started a new round of trade talks in Kuala Lumpur, paving the way for a possible meeting between the presidents of the world’s two largest economies.\nThe Chinese delegation of about 20 people arrived at the Merdeka 118 tower, the highest skyscraper in Malaysia, just before 11am on Saturday, and quietly walked past waiting reporters to a lift that would take them to the 96th floor of the glassy structure, which is still...",
        "source": "smcp",
        "date": "2025-10-25T12:16:20+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330296/china-us-trade-delegates-meet-kuala-lumpur-ahead-possible-xi-trump-talks?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "56d097f134c96974c8176e498744304eaf8b69a53e432369a1b33e86aaf87b6e",
        "title": "China, South Korea eye ‘symbolic restart’ for ties during Xi’s visit: experts",
        "summary": "For the first time in more than a decade, Chinese President Xi Jinping will visit South Korea next week, travelling to the historic city of Gyeongju for talks with South Korean President Lee Jae-myung as well as to attend the Asia-Pacific Economic Cooperation (Apec) summit.\nWhile the trip carries limited expectations for immediate breakthroughs, it is seen as a carefully calibrated step towards resetting strained China-South Korea ties, according to experts.\nXi’s last visit in 2014, at the...",
        "source": "smcp",
        "date": "2025-10-25T12:00:12+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330223/beyond-apec-xis-south-korea-visit-signals-symbolic-restart-strained-ties-experts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5b93f8dd4feba9243cc53d4b8bc730c74aa31b5395dffd044ef76d9a06fcbe06",
        "title": "The STEM crisis in China’s universities: how outdated courses are wasting talent",
        "summary": "At a conference in December, Wang Xingxing – the robotics guru who founded China’s industry-leading Unitree Robotics – had a sharp critique.\n“China is at a disadvantage in terms of talent reserves because its education system has decided that knowledge learned in school is often outdated, whereas overseas students study the world’s most cutting-edge technologies,” he told the audience.\n“The education system fundamentally shapes future development potential and opportunities,” Wang said, adding...",
        "source": "smcp",
        "date": "2025-10-25T07:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329310/stem-crisis-chinas-universities-how-outdated-courses-are-wasting-talent?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a15a4c0de6d498c595d34e83a7b71dc482246b4beb569c9f532ea5ee7bd55335",
        "title": "Trump turns up the heat with probe into China’s compliance with 2020 trade deal",
        "summary": "In a move that piles up further US leverage in advance of next week’s planned meeting between US President Donald Trump and Chinese President Xi Jinping, the US trade representative announced an investigation on Friday into Beijing’s compliance with the Phase One Trade Agreement.\nThe latest tit-for-tat salvo comes as the two economic giants amass threats that, if carried through, could cripple the global economy.\n“The initiation of this investigation underscores the Trump administration’s...",
        "source": "smcp",
        "date": "2025-10-25T01:21:43+09:00",
        "url": "https://www.scmp.com/news/us/economy-trade-business/article/3330280/us-launches-investigation-chinas-compliance-trumps-2020-trade-deal?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f332b7fd56984f302d42a4c3df9d22ecec07d711fd08792bc80755e621b654e4",
        "title": "Modest hopes for Xi-Trump summit as China and US count down to South Korea talks",
        "summary": "As the presidents of China and the United States prepare to meet in South Korea next week, observers remain sceptical of breakthroughs but see potential for incremental steps towards mutual de-escalation of US-China tensions.\nWithout confirming a bilateral meeting with Donald Trump, China’s foreign ministry said on Friday that Xi Jinping would visit South Korea from October 30 to November 1 for the Asia-Pacific Economic Cooperation (Apec) summit in Gyeongju.\nThe White House, however, announced...",
        "source": "smcp",
        "date": "2025-10-25T00:00:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330268/modest-hopes-xi-trump-summit-china-and-us-count-down-south-korea-talks?utm_source=rss_feed",
        "reportUrl": ""
    }
]