[
    {
        "id": "14a214867ee77888e3ceead42501ee55577a5aca13e8adb98062a941f580b7a8",
        "title": "How China’s 5-year plan could steer economy through turbulent times",
        "summary": "As China drafts its 15th five-year plan – the next entry in a line of expansive blueprints that have set the tone for the country’s development over more than seven decades – we examine how these documents inform and reflect high-level policy priorities, what to expect in the coming iteration and why Beijing has continued this tradition after the seismic economic changes of the reform era.\n“Plans can’t keep up with changes,” the Chinese proverb goes. Yet for more than seven decades, China has...",
        "source": "smcp",
        "date": "2025-09-23T07:00:08+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3326401/why-chinas-five-year-plan-matters-and-how-it-could-steer-economy-turbulent-times?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b1ae78dbc319f3cb8eebfc02281c08ae1d7f50b16ace4d8a14b2316d2d34e161",
        "title": "Lula, TikTok CEO discuss $10 billion Brazil data centre amid regulatory tensions",
        "summary": "Brazilian President Luiz Inacio Lula da Silva opened his week at the United Nations on Monday by meeting with TikTok Chief Executive Shou Zi Chew to discuss plans for a multibillion-dollar data centre investment in Brazil, even as political controversies persist over regulation of the Chinese-owned platform.\nThe meeting, held at Brazil’s mission to the UN, was Lula’s first working engagement in New York, highlighting the importance of technology and digital policy in his international...",
        "source": "smcp",
        "date": "2025-09-23T06:43:28+09:00",
        "url": "https://www.scmp.com/news/china/article/3326450/lula-meets-tiktok-chief-push-10-billion-brazil-data-centre-amid-regulatory-tensions?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "45549fbe4e18fa3d5a2eb49d79f3aa9476b138dc8e42fd054413a2b03be4e822",
        "title": "China could shore up Scarborough Shoal control with artificial island: analyst",
        "summary": "China could build an artificial island at the fiercely contested Scarborough Shoal to shore up control of the surrounding waters if its newly established nature reserve fails to stem challenges by the Philippines, a prominent Chinese scholar on the dispute has said.\nBut a final decision would boil down to control, cost and confrontation, according to Wu Shicun of the National Institute for South China Sea Studies, a government-sponsored think tank.\nA major consideration would be “whether it...",
        "source": "smcp",
        "date": "2025-09-23T00:00:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326420/china-could-shore-scarborough-shoal-control-artificial-island-analyst?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "11d4a46b0e8b60b93884d54de6286ba4a5ced5475b46be601959359addc700e5",
        "title": "China prepares for long US soybean stand-off with huge Brazilian imports",
        "summary": "China’s soybean imports remained at historically high levels in August, with companies making huge purchases from Brazil and other South American growers as they prepared for a protracted trade stand-off between Beijing and Washington.\nMore than 12.2 million tonnes of soybeans entered China in August – the second-highest monthly total the country has ever recorded after May’s 13.9 million tonne inflow, according to detailed Chinese customs data released over the weekend.\nBrazil provided 10.49...",
        "source": "smcp",
        "date": "2025-09-22T23:30:08+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3326394/china-prepares-long-us-soybean-stand-huge-brazilian-imports?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a7e9ed167584c915120f9fc66758d7fd9b17a72e493869407aff5650b8176991",
        "title": "China exports to Africa soar, Super Typhoon Ragasa: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Super Typhoon Ragasa: Shenzhen to evacuate 400,000, Guangdong suspends trains\n\nCities in China’s southern provinces are bracing for Ragasa, the strongest typhoon to hit the country this year, with Shenzhen warning of “disastrous calamities” ahead and preparing to relocate hundreds of thousands of people.\n2. China’s exports to Africa up by 25% as Trump’s...",
        "source": "smcp",
        "date": "2025-09-22T23:24:10+09:00",
        "url": "https://www.scmp.com/news/china/article/3326436/chinas-south-braces-ragasa-possible-lab-scarborough-shoal-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e9b24b07782a26ec99555060610143a45ac6dee776f10ac21b43c16adb2e21e8",
        "title": "China’s crude oil imports from Russia dip in August – is it a one-off blip?",
        "summary": "China’s imports of crude oil from Russia fell in August, but official data shows the change was offset by higher purchases from elsewhere, even as China’s purchases from the US remained suspended for a third straight month.\nBy volume, China imported 15.2 per cent less crude oil from its northern neighbour last month, year on year, totalling 7.94 million tonnes. And analysts were mixed on whether the decline might be a temporary fluctuation or a sign of a broader trend.\nThe latest customs data...",
        "source": "smcp",
        "date": "2025-09-22T23:00:20+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3326395/chinas-crude-oil-imports-russia-dip-august-it-one-blip?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ad013e50b1e6151b1d94b5a1727b2a696138cc69c1c205544b86acdf6a39fa7b",
        "title": "The PLA turned a Soviet-era fighter jet into a drone that could swarm Taiwan",
        "summary": "The People’s Liberation Army has revealed a combat drone – converted from a retired 1950s J-6 fighter jet – that could be used for a swarm attack in a potential conflict across the Taiwan Strait.\nThe drone was unveiled at the Changchun air show in northeast China, which opened on Friday and finishes on Tuesday.\nIts appearance has confirmed years of speculation that the PLA was trying to repurpose its legacy fleet of J-6s.\nChina built thousands of the warplanes – based on the Soviet MiG-19 – from...",
        "source": "smcp",
        "date": "2025-09-22T23:00:17+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3326390/pla-turned-soviet-era-fighter-jet-drone-could-be-used-swarm-taiwan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "324e300d2c413247732c2a1e843b32150e55ad0739a2e5f34f6aa49a3a354872",
        "title": "UN General Assembly: will China rise up to fill US void created by Trump?",
        "summary": "As world leaders descend on New York this week, blocking traffic and frustrating local residents, expect widely divergent messages from Washington and Beijing at the UN General Assembly, deep anxiety over institutional reform and fundamental questions about the organisation’s future on its 80th anniversary.\nDespite US President Donald Trump’s globally unpopular tariffs, norm-breaking policies and destabilising pullback from the global body, Beijing has not rushed to fill the leadership vacuum –...",
        "source": "smcp",
        "date": "2025-09-22T22:39:22+09:00",
        "url": "https://www.scmp.com/news/china/article/3326430/un-general-assembly-will-china-rise-fill-us-void-created-trump?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "da3f78e3b37f9f0f4e9dcad2b7609b2aac4e6c11c658a6d253f5c19aaf65e6c7",
        "title": "China will soon hold global summit of women in Beijing: spokesperson",
        "summary": "China will soon hold the global summit of women in Beijing on occasion of the 30th anniversary of the 1995 World Conference on Women, a Chinese Foreign Ministry spokesperson announced on Monday.",
        "source": "cgtn",
        "date": "2025-09-22T22:32:30+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/China-will-soon-hold-global-summit-of-women-in-Beijing-spokesperson-1GSBz6JairK/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "c8636d78fda1018512db8f0177cbdd4ed7639c05bae7c090d90182ca992adaa6",
        "title": "China’s rare earth magnet exports to the US decline amid trade war uncertainty",
        "summary": "China’s exports of rare earth permanent magnets to the United States fell in August despite total shipments rising on the back of quicker approvals from Beijing.\nChina shipped 6,146 tonnes of permanent magnets last month, up 10.2 per cent month on month and 15.4 per cent year on year, according to official customs data. That marked the highest monthly total since January, when exports reached 6,357 tonnes.\nThe US, China’s second-largest buyer, imported 590 tonnes in August, down 5 per cent from...",
        "source": "smcp",
        "date": "2025-09-22T22:00:14+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3326411/chinas-rare-earth-magnet-exports-us-decline-amid-trade-war-uncertainty?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5dd4f62a04515509f33882b2b7248dc199b19bfe6d0716894ffb06dd0856fb87",
        "title": "Can China’s new tech crack Einstein’s brain? Scientists hope to give it a try",
        "summary": "Could the secrets of Albert Einstein’s brain – preserved since his death in 1955 – be unlocked by modern Chinese technology?\nA new technique developed by Chinese scientists has shown potential in analysing old biological samples, including cancer tissues stored for nearly 10 years under less than ideal conditions.\nWhile cautious about the challenges posed by ageing preservation methods, the team behind the advanced RNA-mapping technology known as Stereo-seq V2 does not rule out the possibility...",
        "source": "smcp",
        "date": "2025-09-22T22:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3326104/can-chinas-new-tech-crack-einsteins-brain-scientists-hope-give-it-try?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3860b5a964852109f0baeea5c096c928a3ed117bd218cf95d89a6b06ffc41e56",
        "title": "Landmark launch for China’s J-35 stealth jet from Fujian aircraft carrier",
        "summary": "China’s third aircraft carrier, the Fujian, has used its advanced electromagnetic catapults to launch all three types of fixed-wing aircraft developed for the vessel, passing another major test before commissioning.\nQuoting the navy, state broadcaster CCTV reported on Monday that J-15T fighters, fifth-generation J-35 stealth jets and carrier-based KJ-600 early warning and control aircraft completed catapult launch and arrest landing tests on the carrier.\nThe J-35 is the world’s second...",
        "source": "smcp",
        "date": "2025-09-22T21:42:15+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3326424/landmark-launch-chinas-j-35-stealth-jet-fujian-aircraft-carrier?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "474fb8a1dfff29c6311b9fbe7d921ce09bf125b52b73ec4abcea04b2bda969a0",
        "title": "Chinese defense minister urges improved military ties with U.S.",
        "summary": "Chinese defense minister urges improved military ties with U.S.",
        "source": "cgtn",
        "date": "2025-09-22T21:41:19+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Chinese-defense-minister-urges-improved-military-ties-with-U-S--1GSAJhKH0T6/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ca0266e99e1bde9d3293e87746fb63be53e3c113b65b1dc6947332b5db01114f",
        "title": "Trump-Xi call signals a new normal for US and China: managed rivalry",
        "summary": "The recent phone call between Chinese President Xi Jinping and US President Donald Trump signals a pivotal moment in the world’s most critical bilateral relationship.\nWhile tensions between the two powers have dominated headlines, the conversation – described as “pragmatic, positive and constructive” by China’s People’s Daily – hints at an emerging reality: the US and China are being pushed into accommodation rather than escalation. This shift reflects pragmatic acceptance of mutual dependence...",
        "source": "smcp",
        "date": "2025-09-22T21:30:07+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3326346/trump-xi-call-signals-new-normal-us-and-china-managed-rivalry?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c557bf1319065bac8045468c4760cf8afbdfe195873c9f5618853544e959ff1d",
        "title": "Three aircraft types catapult-tested on China's Fujian carrier",
        "summary": "Three aircraft types catapult-tested on China's Fujian carrier",
        "source": "cgtn",
        "date": "2025-09-22T21:27:45+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Three-aircraft-types-catapult-tested-on-China-s-Fujian-carrier-1GSzUbYYZFu/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "bb998c339093551cfef84488e12d05782d92540c9415427bcc4506eb5e799aca",
        "title": "Taiwanese voter discontent spikes over Lai’s cross-strait policy, poll finds",
        "summary": "Taiwanese leader William Lai Ching-te’s approval rating has taken a sharp blow, with more than 60 per cent of eligible voters expressing disapproval of his handling of cross-strait relations, according to a new survey.\nEven as Beijing’s military pressure intensified, most respondents said the two sides should keep talking – a verdict that has underscored mounting unease with Lai’s leadership.\nThe annual cross-strait relations survey released by the United Daily News in Taipei on Monday found...",
        "source": "smcp",
        "date": "2025-09-22T21:02:02+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3326418/taiwan-leaders-approval-rating-plunges-over-cross-strait-tensions-poll?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "608b2bf412ba878809ca582bebc0be8b0979cbde3bdc798191b47e69bb2c358c",
        "title": "Chinese defence minister urges US to promote ‘constructive’ cooperation",
        "summary": "Chinese Defence Minister Dong Jun has urged members of the US Congress to take “constructive and pragmatic measures” to improve relations between the two militaries.\nA bipartisan delegation met Dong and Vice-Premier He Lifeng on Monday, a day after they met Premier Li Qiang in Beijing.\n“I hope you members of Congress can exclude disruptive measures and take constructive and pragmatic measures to contribute to the improvement of relations between the two militaries and promote US and Chinese...",
        "source": "smcp",
        "date": "2025-09-22T20:30:44+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3326416/visiting-us-lawmakers-meet-chinese-premier-and-defence-minister?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6a17c005f2f230bff2ae5dc0f333c4a59b0ee397f86936b31339e0b7a41a5698",
        "title": "China expands ‘circle of friends’ as overseas investors boost domestic assets",
        "summary": "China’s top financial officials said the country’s assets have become much more attractive to overseas capital in the past year at a high-profile press conference, adding Beijing would continue to prioritise domestic economic objectives even as interest rate cuts from the US Federal Reserve have created room for looser monetary policy.\nAdjustments to China’s monetary policy are “self-determined” and “data-based”, said Pan Gongsheng, governor of the People’s Bank of China, at the conference on...",
        "source": "smcp",
        "date": "2025-09-22T20:00:13+09:00",
        "url": "https://www.scmp.com/economy/policy/article/3326403/china-expands-circle-friends-overseas-investors-boost-domestic-assets?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c7e01a212d216c7772705d07348e67054641ce5e8385edf42a805b0b9b7c2c1b",
        "title": "China’s exports to Africa up by 25% as Trump’s tariffs bite hard",
        "summary": "Beijing has diversified its export routes amid the tariff war with the US, with high-value shipments to Africa growing by 25 per cent in the first eight months of this year.\nAccording to China’s General Administration of Customs, exports to Africa totalled US$140.8 billion (1 trillion yuan) and grew between two and four times as fast as those to other major regions, such as Europe, Asia and Latin America.\nMeanwhile, shipments to the US fell by 15.5 per cent in the period, as Beijing moved to...",
        "source": "smcp",
        "date": "2025-09-22T19:00:11+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3325932/chinas-exports-africa-25-trumps-tariffs-bite-hard?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1105132b2c9615bb78c7ec105b24a5ac8e085761dfe60ac300264788ba3652ab",
        "title": "China tech SME loans grow by 20% yearly 2021-2025, central bank",
        "summary": "China tech SME loans grow by 20% yearly 2021-2025, central bank",
        "source": "cgtn",
        "date": "2025-09-22T18:42:52+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/China-tech-SME-loans-grow-by-20-yearly-2021-2025-central-bank-1GSmvOJBTC8/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "bceca68fbbc2d586a719bd0252a805f9da17ac19df3dd557f7aa145bde2c2a0e",
        "title": "China, U.S. leaders maintain close communication: Chinese FM",
        "summary": "China, U.S. leaders maintain close communication: Chinese FM",
        "source": "cgtn",
        "date": "2025-09-22T18:27:38+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/China-U-S-leaders-maintain-close-communication-Chinese-FM-1GSm725y360/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "7c8bd0cf76c13f9e2161987ac33ae4caea1c57e4c2bc6144e32a98b2215ee36f",
        "title": "Guardians of the blue planet: Protecting Hainan's marine biodiversity",
        "summary": "Guardians of the blue planet: Protecting Hainan's marine biodiversity",
        "source": "cgtn",
        "date": "2025-09-22T18:04:59+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Guardians-of-the-blue-planet-Protecting-Hainan-s-marine-biodiversity-1GSkpPt3ius/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "69d9315e860da6bd44b27fb18c002edb7db875f0ab92e30b7a6bd9da33e3e288",
        "title": "Ascletis trial shows drug candidate ASC47 boosts semaglutide weight loss effect",
        "summary": "Biotech firm Ascletis Pharma said ASC47, its muscle-preserving weight loss drug candidate, could boost the efficacy of the popular anti-obesity medication semaglutide by 56.2 per cent, as Chinese drug makers eye a growing share of this lucrative market.\nThat finding came from a trial that Ascletis conducted in the US for 28 participants with obesity, which aimed to assess the drug candidate’s safety and ideal dose, according to the company’s statement on Monday. The treatment duration was four...",
        "source": "smcp",
        "date": "2025-09-22T18:00:16+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3326379/ascletis-pharma-trial-shows-drug-candidate-asc47-boosts-weight-loss-effect-semaglutide?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "aebca62cbf3913d81a0cd5505644c29dc09633ac693bf497c85a015827f1e913",
        "title": "China unveils largest known radiation-proof robot for nuclear fusion power plant",
        "summary": "China has built and tested a giant robot that could carry the equivalent of 10 African elephants to perform maintenance work on future fusion reactors, bringing the country closer to its decade-long goal of building an “artificial sun”.\nThe remote handling test platform, which consists of three arms, has passed expert evaluation and acceptance, according to a report on September 15 by the state-owned Science and Technology Daily.\nThe evaluation showed that the giant main arm of the robotic...",
        "source": "smcp",
        "date": "2025-09-22T18:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3326370/china-unveils-largest-known-radiation-proof-robot-nuclear-fusion-power-plant?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3049a853530136ade82597b83252c9cfbb823f49e8912954680b9c2825ff1ee9",
        "title": "Catch the Ball, Reap the Harvest",
        "summary": "The Autumn Equinox, or Qiu Fen, marks the harvest season across China. As day and night meet in balance, handball unites speed, strength, and strategy. Players leap, break through, release — the ball hits the net. This November, the men's handball competition of the 15th National Games will ignite at Kai Tak Sports Park in Hong Kong SAR. Every goal reflects skill, teamwork, and the relentless spirit of chasing dreams.",
        "source": "cgtn",
        "date": "2025-09-22T17:08:09+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Catch-the-Ball-Reap-the-Harvest-1GRZ9lRoxgI/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "96c4278454da1c12db3e411f749cd12fc49f4829d73cc1d3db2bc4b0542c56a6",
        "title": "Fuzhou Yantai Hill Park",
        "summary": "Shaded by lush green trees, Fuzhou Yantai Hill Park features pavilions, terraces, and towers pleasingly scattered around, displaying the park’s subtle and tranquil beauty.",
        "source": "cgtn",
        "date": "2025-09-22T17:03:04+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Fuzhou-Yantai-Hill-Park-1GSd26Z4JXi/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "9129fe7827ff05b3adc5fd439a88fa49254d37abe3b9bf88a880907fb51c2680",
        "title": "Audience praise highlights cultural role of SRIFF",
        "summary": "The Fuzhou Silk Road International Film Festival drew large crowds with its special screenings, which featured a number of local and international films.",
        "source": "cgtn",
        "date": "2025-09-22T17:02:14+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Audience-praise-highlights-cultural-role-of-SRIFF-1GS4pqKZiMw/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "eb424c147d40209ff0325ef3afb033356b235fdbb53ae7a3f798c959735ff4c7",
        "title": "Israeli lawmaker’s Taiwan visits repeatedly violate one-China policy: Beijing",
        "summary": "Beijing has strongly condemned an Israeli lawmaker’s visit to Taiwan, calling the politician a troublemaker and accusing him of undermining bilateral relations.\nIn Taipei last Tuesday, Knesset member Boaz Toporovsky met Taiwanese leader William Lai Ching-te, who thanked the Israeli parliament for “staunchly backing Taiwan’s international participation”, according to Lai’s office.\nIn response, Beijing’s embassy in Tel Aviv said on Sunday that Toporovsky, from the liberal Zionist Yesh Atid party,...",
        "source": "smcp",
        "date": "2025-09-22T17:00:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326366/israeli-lawmakers-taiwan-visits-repeatedly-violate-one-china-policy-beijing?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5549289bf4e63a0f17ee18d8c3f268f7fa0ace41e59ac4f4139e6155d147f6ab",
        "title": "UNESCO STEM education institute established in Shanghai",
        "summary": "The United Nation's Education, Scientific and Cultural Organization (UNESCO) officially inaugurated an international institute for STEM education in east China's Shanghai on Sunday.",
        "source": "cgtn",
        "date": "2025-09-22T16:59:42+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/UNESCO-STEM-education-institute-established-in-Shanghai-1GSdvedE1he/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "34024320074e899f66d79714af7de19d5e2965ff96c685a425bf2747bee47897",
        "title": "Inside Chinese farmers' harvest festival: Why it matters",
        "summary": "At first glance, Chinese farmers' harvest festival, launched in 2018, might look like just another festival: the parades, performances, and festive buzz you'd expect from any celebration. But look closer, and a bigger story emerges.",
        "source": "cgtn",
        "date": "2025-09-22T16:39:41+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Inside-Chinese-farmers-harvest-festival-Why-it-matters-1GS3xc7W5oY/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "2df140081ddbccdaf1e202ba2d8058a3610f69674d16269c674028275ad50eb0",
        "title": "12th Silk Road International Film Festival opens in Fuzhou, SE China",
        "summary": "The 12th Silk Road International Film Festival opened on Monday in the coastal city of Fuzhou.",
        "source": "cgtn",
        "date": "2025-09-22T16:08:10+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/12th-Silk-Road-International-Film-Festival-opens-in-Fuzhou-SE-China-1GS5FXkRVuw/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "25f2d071008f9f95e47b725998cdff627167d8d3601590b5d51bf8f785ebbd53",
        "title": "Chinese lab unveils moon brick maker for lunar facility construction",
        "summary": "Chinese lab unveils moon brick maker for lunar facility construction",
        "source": "cgtn",
        "date": "2025-09-22T16:06:11+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Chinese-lab-unveils-moon-brick-maker-for-lunar-facility-construction-1GScWqPp5PG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "3b920337829e99ae5ffec5c633e7486d5efbb13e4811aae4785bb8f1a29d46fb",
        "title": "China’s SCIO holds presser on financial sector’s progress during 14th FYP period",
        "summary": "China’s SCIO holds presser on financial sector’s progress during 14th FYP period",
        "source": "cgtn",
        "date": "2025-09-22T16:01:19+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/China-s-SCIO-holds-presser-on-financial-sector-s-progress-during-14th-FYP-period-1GRPhS3UUzS/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "59efb16441ab0527637ae695c22d341384241ac76e29a8b1de7537713ec7b077",
        "title": "Super Typhoon Ragasa: Shenzhen to evacuate 400,000; Guangdong suspends trains",
        "summary": "Cities in China’s southern provinces are bracing for Ragasa, the strongest typhoon to hit the country this year, with Shenzhen warning of “disastrous calamities” ahead and preparing to relocate hundreds of thousands of people.\nThe National Meteorological Centre said on Sunday that Ragasa, the 18th typhoon this year, had intensified into a super typhoon on Sunday morning and was expected to bring strong winds and heavy rainfall to wide areas of the country’s southern and eastern regions.\nIt is...",
        "source": "smcp",
        "date": "2025-09-22T15:19:55+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3326357/super-typhoon-ragasa-china-braces-disaster-shenzhen-set-evacuate-400000?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4ce59360f8b58f6023bed4f9e577fc6f72029fd2b8006e8d49a7c6c85dc761ae",
        "title": "Wu Yibing battles back to upset Daniil Medvedev at ATP Hangzhou Open",
        "summary": "Wu Yibing battles back to upset Daniil Medvedev at ATP Hangzhou Open",
        "source": "cgtn",
        "date": "2025-09-22T15:17:27+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Wu-Yibing-battles-back-to-upset-Daniil-Medvedev-at-ATP-Hangzhou-Open-1GRYuYMhzsQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d2b87cae3344356f53384aa3f78fbb2faff2332dc90b6d1c7b186ccc6a67f6c3",
        "title": "Leonardo's hat-trick drops Guoan further behind Port in CSL title race",
        "summary": "Leonardo's hat-trick drops Guoan further behind Port in CSL title race",
        "source": "cgtn",
        "date": "2025-09-22T15:15:04+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Leonardo-s-hat-trick-drops-Guoan-further-behind-Port-in-CSL-title-race-1GRWP4ANp3G/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "5c7a8c4c6cd4dcd9141aa20a4c74db09a806d4409f780789165530da3a035ff6",
        "title": "Xi Jinping extends greetings ahead of farmers' harvest festival",
        "summary": "Xi Jinping extends greetings ahead of farmers' harvest festival",
        "source": "cgtn",
        "date": "2025-09-22T14:52:11+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Xi-Jinping-extends-greetings-ahead-of-farmers-harvest-festival-1GS7nzRYimk/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "cab72de8f2211699fc5ada645ce1d132caf443ed5bd41a0de70a4fcac9f48a85",
        "title": "Super Typhoon Ragasa approaches China, triggering emergency responses",
        "summary": "Super Typhoon Ragasa, the 18th typhoon of the year, continues to approach China, bringing strong winds and heavy rainfall to parts of the country's southern and eastern regions.",
        "source": "cgtn",
        "date": "2025-09-22T14:27:13+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Super-Typhoon-Ragasa-approaches-China-triggering-emergency-responses-1GS4FzTDS1i/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "51a084470700c428ed808542dd35f704635d038d5e5667487ead09c00a82e357",
        "title": "Talk Xinjiang｜Meeting the Man Who Met Xuanzang",
        "summary": "He met Master Xuanzang over 1,400 years ago. In a sense, he was Xuanzang's sworn brother. Without him, Xuanzang's journey would have been much more difficult. But thanks to his achievements in the ancient Gaochang Kingdom (Turpan in Xinjiang, China), after four arduous months, Xuanzang was about to embark on a well-funded phase of his journey.",
        "source": "cgtn",
        "date": "2025-09-22T13:05:37+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Talk-Xinjiang-Meeting-the-Man-Who-Met-Xuanzang-1GRYI4hKR5m/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "6a06b9f8839a4d5ccc5581df106dad4808a094e811bb028c02b17642d6268d1a",
        "title": "China is killing the race for critical minerals with the largest antenna on Earth",
        "summary": "Hidden within the granite wilderness of central China lies an antenna so vast it dwarfs New York City five times over – a 500-kilowatt electromagnetic leviathan originally built to whisper to submarines.\nNow, it is broadcasting China’s dominance in the global scramble for critical minerals.\nAs nations race to secure lithium, cobalt and rare earths for green tech supremacy, Chinese geologists are deploying this monster – and its cousins – to detect ore and energy resources buried kilometres...",
        "source": "smcp",
        "date": "2025-09-22T13:00:11+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3325178/china-killing-race-critical-minerals-largest-antenna-earth?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d13005484bbe7838a8c12f97c4c5fcec08be3594220243676dcbf128f0059b44",
        "title": "What is China’s five-year plan, and why is it so important?",
        "summary": "As next month’s fourth plenary session of the Communist Party’s Central Committee approaches, global attention is turning to China’s next five-year plan, which will be discussed at the gathering and will offer insights into how Beijing plans to navigate uncertainties amid rising tensions with the US.\nChina has used five-year plans – a strategy and time frame similar to that of the former Soviet Union – in the more than seven decades since the establishment of the People’s Republic. In that time,...",
        "source": "smcp",
        "date": "2025-09-22T12:30:13+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3326329/what-chinas-five-year-plan-and-why-it-so-important?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0ee8b9eb942bf100e1f6964c28b5c727f50e2a0c084d64384d9edf344f872a8c",
        "title": "Silk Road Spell: Step into an immersive digital dreamscape",
        "summary": "Silk Road Spell: Step into an immersive digital dreamscape",
        "source": "cgtn",
        "date": "2025-09-22T12:19:58+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Silk-Road-Spell-Step-into-an-immersive-digital-dreamscape-1GRWIcipCDu/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "216c8405fd43e39b0f26c11cb8c02fead664dbcf12fc6c05637b091fd6a6dc6c",
        "title": "Why the Global Governance Initiative is timely and necessary",
        "summary": "Chinese President Xi Jinping's Global Governance Initiative (GGI) has drawn widespread attention. Many leaders and experts say it is timely, reaffirms the UN's founding spirit, amplifies the voices of the Global South and offers practical solutions to today's pressing challenges.",
        "source": "cgtn",
        "date": "2025-09-22T11:42:02+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Why-the-Global-Governance-Initiative-is-timely-and-necessary-1GR1NydakAU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "725ebbb47ac833604269529964f3b5417b9f2a596bf6d6ca759eeeed83d4a435",
        "title": "How China’s GJ-11 UAV is poised for crucial roles in intelligent warfare",
        "summary": "As China’s Victory Day parade got under way in Beijing on September 3, some of the world’s most advanced military hardware began to file through Tiananmen Square with an unmanned aerial vehicle (UAV) – the GJ-11 “Sharp Sword” – leading the way.\nThe drone, with the number 21 displayed on its fuselage, represented one of the most advanced uncrewed systems in service in the People’s Liberation Army (PLA).\nA closer look at the aircraft’s wings showed visible folding hinges, a change from the debut...",
        "source": "smcp",
        "date": "2025-09-22T11:00:48+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3325565/chinas-gj-11-sharp-sword-uav-poised-crucial-roles-intelligent-warfare?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fc88107eccc708fc4db9239b29a349acd0c2ff779dde01d5e975d13ce950cc82",
        "title": "HSBC opens first Middle East wealth hub in Dubai to tap booming UAE market",
        "summary": "HSBC has opened its first wealth management centre in the Middle East in the UAE – its biggest investment in two decades in its premier banking business – to tap the growing investment appetite of affluent investors globally, according to a top banker.\nThe bank’s 24,000 sq ft wealth centre started operations in Dubai on Tuesday, where some 90 relationship managers will cater to the investment needs of high-net-worth individuals in the United Arab Emirates. The country is one of the world’s top...",
        "source": "smcp",
        "date": "2025-09-22T08:30:15+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3326294/hsbc-opens-first-middle-east-wealth-hub-dubai-tap-booming-uae-investment-market?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d89a4a018ae1740e89595d135e5891304e5819a56577aad5f364c0b3e11f1ac2",
        "title": "Blue Helmets, No Borders | Interview with Zhou Bo on Peacekeeping",
        "summary": "CGTN speaks with Zhou Bo from the Center for International Security and Strategy at Tsinghua University.",
        "source": "cgtn",
        "date": "2025-09-22T07:42:57+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Blue-Helmets-No-Borders-Interview-with-Zhou-Bo-on-Peacekeeping-1GQlekth1Kg/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "3b4af47b5ee83d37f2babeccc93c5fcdc85f05ef19235696d196475759f49c53",
        "title": "Blue Helmets, No Borders | Thank You to CHNBATT",
        "summary": "CGTN's documentary \"Blue Helmets, No Borders\" also tells the stories of peacekeepers who work alongside China's.",
        "source": "cgtn",
        "date": "2025-09-22T07:42:14+09:00",
        "url": "https://news.cgtn.com/news/2025-09-22/Blue-Helmets-No-Borders-Thank-You-to-CHNBATT-1GQlrIX22re/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "5aadcc1020ffb88ed68262303a0a67a8e8248eb95797f2ac3b966cee45c6f802",
        "title": "Beijing could build research lab at Scarborough Shoal, South China Sea expert says",
        "summary": "China might build a science laboratory at the disputed Scarborough Shoal and invite international experts to conduct coral reef and fisheries research, a leading South China Sea analyst said.\nHe also called for further measures like boarding inspections, penalties for illegal fishing and barring rival claimants from the area.\nBeijing announced on September 10 that it had approved the creation of a nature reserve spanning around 35 sq km (13.5 square miles) at the shoal, which Beijing calls...",
        "source": "smcp",
        "date": "2025-09-22T07:00:17+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3326313/beijing-could-build-research-lab-scarborough-shoal-top-south-china-sea-expert-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3bb51a29e07f3da0c6c38af85837f916d6fddb9f2da459ca7d6ac9bf9b6e51db",
        "title": "Dong Yu on why ‘every chapter’ of China’s 5-year plans boils down to income",
        "summary": "Dong Yu has been executive vice-president of the China Institute for Development Planning at Tsinghua University since 2019. Before joining academia, he held senior positions in several of China’s major economic decision-making bodies, including the National Development and Reform Commission and the Office of the Central Financial and Economic Affairs Commission.\nHe has been part of the teams that drafted several of the country’s economic blueprint documents, including the 11th, 12th and 13th...",
        "source": "smcp",
        "date": "2025-09-22T07:00:12+09:00",
        "url": "https://www.scmp.com/economy/policy/article/3326101/dong-yu-why-every-chapter-chinas-five-year-plans-boils-down-income?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "da7d94a338ad78eaa1933cefda0cc8c59187650bb2c5e000ff6a52621caa44b8",
        "title": "No missing bolts: a glimpse into China’s C919 smart factory",
        "summary": "Following several high-profile aeronautical production quality lapses in recent years, including a door falling off mid-flight and tooling left inside aircraft, the last thing any plane manufacturer wants is a missing bolt or any oversight that slips through manual checks.\nEnter the futuristic assembly line of C919, China’s first domestically developed large passenger jet.\nLeveraging a groundbreaking 5G-enabled industrial network system, the C919 smart mega factory in Shanghai is setting a new...",
        "source": "smcp",
        "date": "2025-09-22T01:00:14+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3326054/no-missing-bolts-glimpse-chinas-c919-smart-factory?utm_source=rss_feed",
        "reportUrl": ""
    }
]