[
    {
        "id": "c243fd938b6f958b04a124a4e4008a8e9393defaa0191b34c5cbc673fbf47ca9",
        "title": "How China can help Africa build human capital",
        "summary": "Whereas then US president Joe Biden intially missed the group photo at the annual Group of 20 summit in Rio de Janeiro last year, requiring a reshoot, his successor did not even bother showing up for this year’s meeting in Johannesburg. US President Donald Trump boycotted the summit due to alleged mistreatment of whites in post-apartheid South Africa.\nYet, even in the absence of the US, the G20 managed to make a leaders’ declaration at the start of the summit, which usually comes at the end.\nAs...",
        "source": "smcp",
        "date": "2025-12-09T17:35:14+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3335374/how-china-can-help-africa-build-human-capital?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8232552f843b43d4f2ea2a86c65dc3f0c606a43138c7970982ff8c6db4840f75",
        "title": "Former chief of China’s food and drug watchdog ousted from Communist Party",
        "summary": "Bi Jingquan, China’s former top food and drug regulator who received an international accolade for promoting innovation, has been expelled from the Communist Party and removed from public office on corruption charges.\nAn investigation found that Bi had accepted gifts, money, trips and banquets and borrowed vehicles from private business owners, a statement from the Central Commission for Discipline Inspection (CCDI) said on Monday.\nThe statement also said Bi had “allowed others to pay for him,...",
        "source": "smcp",
        "date": "2025-12-09T17:00:15+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335712/former-chief-chinas-food-and-drug-watchdog-ousted-communist-party?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b023d9ed3efd774a3da02d7b03b3637d11562521d85610b23d33524d86cff775",
        "title": "Tokyo ‘closely monitoring’ backlash from China, Japanese PM tells lawmakers",
        "summary": "One month after the Taiwan contingency remarks that set off the diplomatic firestorm with China, Japanese Prime Minister Sanae Takaichi said Japan would “closely monitor” the situation and respond appropriately.\nTakaichi delivered these remarks during a session of the Diet, Japan’s parliament, on Tuesday morning. She was addressing a draft supplementary budget aimed at funding a comprehensive economic package which her administration hopes to pass.\nAsked to address concerns on economic...",
        "source": "smcp",
        "date": "2025-12-09T15:14:24+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335713/tokyo-closely-monitoring-backlash-china-japanese-pm-tells-lawmakers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "809e0afe9d31a430a87a9d223e9027df0e2720edcbf8b7bff3b4aff87fa93be6",
        "title": "Why is China piling on the pressure with increasing naval operations near Japan?",
        "summary": "Chinese naval vessels have ramped up pass-through operations as tensions between Beijing and Tokyo continue to rise.\nOn Monday, a Chinese naval Type 054 destroyer sailed southeastward between Okinawa Island and Miyako Island, heading towards the Pacific Ocean, while another travelled eastward through the Osumi Strait, Japan’s defence ministry said on Tuesday.\nThe operations came shortly after the Chinese aircraft carrier Liaoning charted an unusual course towards Japan’s home islands following...",
        "source": "smcp",
        "date": "2025-12-09T14:23:37+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3335703/why-chinas-liaoning-carrier-unique-route-amid-beijing-tokyo-tensions?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "91d29e0fd9a9d8295be30a7f5923db4030a5a0b2b6567cf15cfc15172301e825",
        "title": "China tests super wireless rail convoy that could carry 3 Eiffel Towers",
        "summary": "China has tested a rail system that links multiple freight trains through a wireless system rather than physical coupling.\nOn Monday, a test conducted on the Baoshen Railway in Inner Mongolia saw seven freight trains with a combined cargo capacity of 35,000 tonnes – 3½ times the weight of the Eiffel Tower – running together much more closely than would be usually required when they travel as single units.\nThe technology could increase China’s railway freight transport capacity by more than 50...",
        "source": "smcp",
        "date": "2025-12-09T13:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3335646/china-tests-super-wireless-rail-convoy-could-carry-three-eiffel-towers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "346574d4861f0ff00f9127d5b3e9eaf0ec16243bc6e54da70eef42ce0fc3e09b",
        "title": "Hong Kong launches HKEX Tech 100 Index in pivot towards innovation-driven growth",
        "summary": "Hong Kong Exchanges and Clearing has launched its first equity index tracking Hong Kong-listed technology companies, underscoring the city’s ongoing shift from a market long dominated by property and finance towards innovation-driven growth.\nUnveiled on Tuesday, the HKEX Tech 100 Index tracks 100 large-cap and mid-cap companies spanning artificial intelligence, biotech and pharmaceuticals, electric vehicles and smart driving, information technology, internet and robotics, according to the HKEX...",
        "source": "smcp",
        "date": "2025-12-09T12:33:10+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3335684/hong-kong-launches-hkex-tech-100-index-pivot-towards-innovation-driven-growth?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d70c12021d83f79df85f44c27e3b9eed14c051e9a6e0fa4313160d05aeac1004",
        "title": "Hitting China with tariffs should be ‘last resort’, German foreign minister says",
        "summary": "German Foreign Minister Johann Wadephul has warned that Europe must be “extremely cautious” about slapping tariffs on China, as it could prompt Beijing to take countermeasures that could turn into a “spiral”.\nThe remarks came after French President Emmanuel Macron said he had told Beijing during his visit to China last week that Europe would be forced to take “strong measures” against Chinese goods if the trade imbalance was not addressed.\n“I told them that if they do not react, we Europeans...",
        "source": "smcp",
        "date": "2025-12-09T11:43:59+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335679/hitting-china-tariffs-should-be-last-resort-german-foreign-minister-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7a6a19ebc548b66c555f8713dbc6be0c4536dd6da50b01ad54e61a7cb09935eb",
        "title": "How Hong Kong can distinguish itself as a climate finance hub",
        "summary": "For decades, New York and London have defined the flow of global capital. But while markets still chase short-term returns in US equities, the next great wave of productive investment is taking shape in East Asia, led by China’s financing, manufacturing and export of the clean technologies that are remaking the global economy.\nThat contrast has only widened. As the United States retreats from climate leadership, China has doubled down. A day after US President Donald Trump called climate change...",
        "source": "smcp",
        "date": "2025-12-09T10:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3334872/how-hong-kong-can-distinguish-itself-climate-finance-hub?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9c17083ab9a9bab81c180a42bf4474fa5c66452cdc890bc9f20e2ade803d7f82",
        "title": "Taiwan RedNote ban backfires, driving mainland Chinese app’s top download rise",
        "summary": "Taiwan’s ban on mainland Chinese social media app RedNote has sparked fierce pushback on the island, making the platform a top download as users rush to access it through workarounds.\nThe island’s interior ministry announced on Thursday it had ordered local telecoms and internet providers to block access to the app, also known as Xiaohongshu, for one year over “rising online fraud cases”. Authorities also cited a “lack of cooperation from its operator in Shanghai”.\nBut the move has unleashed a...",
        "source": "smcp",
        "date": "2025-12-09T10:00:17+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335652/taiwans-ban-mainland-china-app-rednote-makes-it-top-download-amid-fierce-pushback?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c007f5b8e0bee431998add3f61c09275507d8418f42d81069b30bc75a893ee62",
        "title": "‘A slap in the face’: some US farmers unhappy with Trump’s US$12 billion bailout",
        "summary": "US President Donald Trump has announced a long-anticipated US$12 billion farm aid package to assist farmers caught in US-China trade tensions, crediting his tariff strategy for making the bailout possible and asserting that his negotiations with China had led to the resumption of massive soybean sales.\nBut the announcement has not pleased all farmers, particularly those still struggling with low prices and lost markets. Some said it was too little, too late, and that a bailout wouldn’t be...",
        "source": "smcp",
        "date": "2025-12-09T07:48:49+09:00",
        "url": "https://www.scmp.com/news/us/economy-trade-business/article/3335671/slap-face-not-all-us-farmers-happy-trumps-12-billion-aid-package?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4b8d1df8f02b2103b70263b48adf26547669da832754483c5b4cef5509105574",
        "title": "US Congress unveils bill with curbs on China tech investment and biotech ties",
        "summary": "The US Congress is readying votes on a sprawling bill that would restrict US outbound investment to China in sensitive sectors as well as federal government contracting with Chinese biotechnology companies, two controversial measures that were left out of similar legislation last year.\nThe provisions were included in a compromise defence bill released on Sunday after months of negotiation.\nVotes on the annual bill, known as the National Defence Authorisation Act (NDAA), could happen this week....",
        "source": "smcp",
        "date": "2025-12-09T07:14:05+09:00",
        "url": "https://www.scmp.com/news/us/article/3335668/us-congress-unveils-defence-bill-curbs-china-tech-investment-biotech-ties?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "027eb09b8c96cf8b52a0351f5bd68ca81cdda4cdc6090cef6fba33f148a394d1",
        "title": "Are US, EU and Japan banking on defence spending for an economic boost?",
        "summary": "More than six decades after British historian AJP Taylor termed war the “mother of invention”, economies around the world appear to be ramping up their military spending, at least in part, to reinvigorate industrial production.\nTaylor was referring to the genesis of the tank, the aeroplane and poison gas in World War I, and that of radar, the jet engine and the atomic bomb in World War II. More modern examples, such as satellite-based navigation systems and the internet, were the products of the...",
        "source": "smcp",
        "date": "2025-12-09T07:00:16+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335612/us-eu-and-japan-boost-defence-spending-stimulus-their-true-intention?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7f00748bcbcdf5da7c55018e56af22d6e49f7637e4fa1a6a23599801aa7e81d9",
        "title": "Rubio and Hegseth discuss Indo-Pacific security with Australian counterparts",
        "summary": "US Secretary of State Marco Rubio and Defence Secretary Pete Hegseth met their Australian counterparts on Monday in Washington for annual talks focused on Indo-Pacific security and countering mainland China’s increasing assertiveness in the region, including in the South China Sea and directed at Taiwan.\nRubio, Hegseth, Australian Foreign Minister Penny Wong and Defence Minister Richard Marles gathered at the State Department, with many eyes also on the Russia-Ukraine war, a fragile ceasefire in...",
        "source": "smcp",
        "date": "2025-12-09T05:23:01+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3335667/rubio-and-hegseth-discuss-indo-pacific-security-australian-counterparts-washington?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "81679c8e591f830a5919fad5379ed2020e4e8d1128423650969261e76046e14c",
        "title": "Federal communications agency may bar Chinese telecoms firms from US networks",
        "summary": "The US Federal Communications Commission (FCC) said on Monday it may bar three major Chinese telecoms companies from connecting to US networks over efforts to prevent robocalls, the latest in a series of actions Washington has taken against Beijing.\nThe FCC issued orders saying China Mobile, China Telecom and China Unicom must address issues with their certifications in the agency’s robocall mitigation database, and raised concerns about their presence in the database.\nIf the FCC removes them,...",
        "source": "smcp",
        "date": "2025-12-09T04:28:56+09:00",
        "url": "https://www.scmp.com/news/world/united-states-canada/article/3335666/federal-communications-agency-may-bar-chinese-telecoms-firms-us-networks?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d47619c27873a4f18d587d2c396e24f97abb8bb230a91f118fba223cb2bfb276",
        "title": "Ant International signs WNBA star Sabrina Ionescu as brand ambassador",
        "summary": "Ant International, the Singapore-based affiliate of Chinese fintech giant Ant Group, has named US basketball star Sabrina Ionescu as its global brand ambassador in a fresh partnership between sports and tech.\nThe four-time all-star in the US Women’s National Basketball Association (WNBA) was chosen as part of an effort to expand access to financial tools via innovative technology, the digital payments provider said on Tuesday.\nThe 28-year-old point guard – an Olympic gold medallist and the top...",
        "source": "smcp",
        "date": "2025-12-09T01:01:07+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3335649/ant-international-signs-wnba-star-sabrina-ionescu-brand-ambassador?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "af6b4c92596bf67594d3a0f0727863be774394fa1bbad8a627941a0244ab2904",
        "title": "Chinese court orders Malaysia Airlines to pay families of 8 MH370 victims",
        "summary": "A Chinese court has ordered Malaysia Airlines to pay over 2.9 million yuan (US$410,240) per victim to family members who filed suit over missing flight MH370, 11 years after it disappeared over the Indian Ocean, state broadcaster CCTV said on Monday.\nThe order, issued on Friday by the Chaoyang District People’s Court in Beijing, covers eight missing passengers. It is the first formal compensation ruling by a Chinese court on flight MH370.\nIt includes death compensation, funeral expenses and...",
        "source": "smcp",
        "date": "2025-12-08T23:19:12+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335653/chinese-court-orders-malaysia-airlines-pay-families-8-missing-mh370-victims?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4e797c4a0467f7f1bc1edfcb112e7d56107be546b78906829ace05c99cb19fb4",
        "title": "Chinese team reports way to extract hypersonic weapon fuel boron from seawater",
        "summary": "Scientists from Northwest A&amp;F University in China have developed an innovative technology to extract and collect boron from seawater.\nBoron is a lightweight element used as solid fuel in scramjet engines on some advanced Chinese hypersonic weapons.\nNeodymium-iron-boron rare earth magnets – used extensively in industrial and military applications – have drawn particular attention amid ongoing trade tensions over critical minerals. These high-performance rare-earth magnets not only rely on...",
        "source": "smcp",
        "date": "2025-12-08T23:00:12+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3335618/chinese-scientists-report-way-extract-hypersonic-weapon-fuel-boron-seawater?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "edc27085e63d47589844eb1b23c25ab93020189a7e9393fac17aa221e8028c5f",
        "title": "DeepSeek founder Liang Wenfeng cleans up on chip firm Moore Threads’ IPO",
        "summary": "Chinese entrepreneur Liang Wenfeng, the founder and CEO of DeepSeek, appears to have made a big score from the initial public offering of chip designer Moore Threads Technology, whose shares surged more than fivefold in its trading debut in Shanghai.\nHigh-Flyer Quantitative Fund, a hedge fund co-founded by Liang, had subscribed to a total of 82,244 shares of Moore Threads, at 114.28 yuan per share, via two entities: Zhejiang High-Flyer Asset Management and Ningbo High-Flyer Quant Investment...",
        "source": "smcp",
        "date": "2025-12-08T22:00:21+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3335645/deepseek-founder-liang-wenfeng-cleans-chip-firm-moore-threads-shanghai-ipo?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "70fcc54619df481e33dd4e5d6cbc651ed10f16fcbf9a72efdea18c5aeb9692fe",
        "title": "China leans on German carmakers to help break Brussels tariff deadlock",
        "summary": "Beijing pressed German carmakers to help resolve disputes over the European Union’s anti-subsidy tariffs on Chinese electric vehicles and the Nexperia semiconductor saga, in separate video meetings on Monday.\nVice-Minister of Commerce Ling Ji made the appeal to German industry leaders, seeking to leverage their influence in Brussels.\nLing spoke with Hildegard Mueller, president of the German Association of the Automotive Industry (VDA), and Ola Kallenius, president of the European Automobile...",
        "source": "smcp",
        "date": "2025-12-08T21:58:33+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3335644/china-leans-german-carmakers-help-break-brussels-tariff-deadlock-fix-nexperia-mess?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d3e869299aafbd0b7fe06e3fb77a36338858c33679a6e08cb098c7eefa59b0bf",
        "title": "German foreign minister calls for end to ‘uncertainty’ on Chinese rare earths, chips",
        "summary": "China’s deliveries of rare earths, semiconductors and other commodities to Germany dominated the talks between German Foreign Minister Johann Wadephul and Chinese Commerce Minister Wang Wentao on Monday.\n“In all of these areas, there has been uncertainty, and that needs to be eliminated,” Wadephul said as he began a trip to China aimed at addressing Berlin’s trade and geopolitical concerns.\nAccording to Reuters, Beijing was far from being persuaded to grant general export licences for rare earth...",
        "source": "smcp",
        "date": "2025-12-08T21:50:36+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335643/german-foreign-minister-calls-end-uncertainty-chinese-rare-earths-chips?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b80a8ca2575dbf7214f05e87e9977eecdbdfac056acc7fc5bf2d989c27478a3e",
        "title": "In reaching out to China, European states can’t keep acting alone",
        "summary": "Few leaders travel to China seeking gravitas and return with only a couple of pandas, but French President Emmanuel Macron managed to do just that.\nAfter surrendering sovereignty to US President Donald Trump, Macron visited China seeking a validation that his citizens no longer grant. His authority at home has been eroded through cabinet implosions, collapsing support, stalled budgets and demands for his resignation. China could see that before he even stepped off the plane.\nBeijing handled a...",
        "source": "smcp",
        "date": "2025-12-08T21:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3335556/macrons-trip-exposes-europes-fractured-china-policy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e7246bef16f925abf69edc9cfb575e1023a7e36564b9664fc5b1ce96e79f17b6",
        "title": "China warns internet platforms not to shift tax burden onto gig workers",
        "summary": "China’s tax authorities have told internet platforms to avoid passing tax obligations onto gig workers, tightening industry oversight while stepping up a crackdown on tax-dodging internet influencers.\n“Platforms should not disguise additional fees during tax withholding and remittance processes, nor should they use such processes to shift tax obligations and increase gig workers’ burdens,” officials from the State Taxation Administration said at a press conference on Monday.\nAs regulation of the...",
        "source": "smcp",
        "date": "2025-12-08T20:30:16+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335634/china-warns-internet-platforms-not-shift-tax-burden-gig-workers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8a39b907f5f58aa3b7099264cd72f9a9a92e358bee174b9614e7636ea655b4da",
        "title": "China AI chipmaker MetaX draws more IPO investors than Moore Threads",
        "summary": "Shanghai-based chip firm MetaX Integrated Circuits has emerged as the latest star in mainland China’s stock market, with the graphics processing unit (GPU) maker proving to be even more popular among retail investors than peer Moore Threads ahead of its trading debut.\nMetaX attracted 5.17 million retail investors for its online subscription, giving it a final allotment rate of 0.033 per cent, according to a stock exchange filing on Monday. Beijing-based Moore Threads drew 4.82 million retail...",
        "source": "smcp",
        "date": "2025-12-08T20:30:08+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3335630/chinas-fever-ai-chip-stocks-persists-metax-draws-more-investors-moore-threads?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a925840bfba10af2473bcb1a2c0643003809e8b47a5e7fa93134ca64e7d79e35",
        "title": "China-Japan ferry halts service as tensions over Takaichi remarks flare",
        "summary": "A passenger ferry named after an ancient monk seen as a symbol of Sino-Japanese cultural exchange has suspended its service as Beijing continues its retaliation for Japanese Prime Minister Sanae Takaichi’s remarks on Taiwan.\nThe Jian Zhen Hao ferry from Shanghai to Japan’s Osaka and Kobe had been suspended since Saturday “due to a request from the Chinese side”, trip operator Japan-China International Ferry said in a statement on Monday.\nThe Japanese company said the request was over concerns...",
        "source": "smcp",
        "date": "2025-12-08T20:00:28+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335626/china-japan-ferry-halts-service-tensions-over-takaichi-remarks-flare?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "287e981c7927806386b8a7eb7111e1117354c0f6fd35a2507a301906c19ed24d",
        "title": "New China guidelines to base asset managers’ pay on the performance of funds",
        "summary": "China’s securities regulator has called on the country’s 160 mutual fund houses to establish a performance-based salary mechanism, as part of efforts to uproot elitism from the industry.\nThe China Securities Regulatory Commission (CSRC) has drawn up guidelines governing asset managers’ pay perks, suggesting that the performance of the funds they run should factor up to 80 per cent in determining their annual salaries, according to a report on Monday by the official Securities Times.\nThe...",
        "source": "smcp",
        "date": "2025-12-08T20:00:27+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3335635/new-china-guidelines-base-asset-managers-pay-performance-funds-they-run?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9809dd8cf591d3055f220fea1af223b5e81775c89812fb3f103d5ac387dc2123",
        "title": "Chinese minister calls for more opening-up as key planning meeting looms",
        "summary": "China’s commerce minister has urged the country to push forward with opening-up policies over the next five years to reshape China’s role in the global economy while bolstering domestic consumption, as Beijing gears up for one of its most important economic planning meetings of the year.\nCommerce Minister Wang Wentao highlighted China’s commitment to open markets and multilateral trade in an article published in the Communist Party’s flagship newspaper, People’s Daily, on Monday.\nHis remarks...",
        "source": "smcp",
        "date": "2025-12-08T19:30:08+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335608/chinese-minister-calls-more-opening-key-planning-meeting-looms?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8f3a6404eb640d2075b90aac8c712e623dc9893006ff7b1dc94caac35518be5d",
        "title": "China’s security chief hints at US decline, says tech theft is a major concern",
        "summary": "China’s top espionage official has identified crushing Taiwan independence forces, technology theft, subversion and the defence of strategically important sea lanes as top priorities for the next five years.\nState Security Minister Chen Yixin identified the issues in an article published in Study Times, the mouthpiece of the Central Party School, which gives ideological and administrative training.\nIn his assessment of international affairs, Chen noted the decline of a “unipolar hegemony”, an...",
        "source": "smcp",
        "date": "2025-12-08T19:14:18+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335625/chinas-state-security-chief-hints-us-decline-and-says-tech-theft-major-concern?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "10abdb0a4975119fce1ba016babcc9a079825f199127b3736d3990c92caed1ac",
        "title": "US defence chief touts ‘flexible realism’ with China ahead of strategy document",
        "summary": "US Defence Secretary Pete Hegseth sent out a message of peace, dialogue and “flexible realism” with China in a weekend speech that offered a brief preview of the forthcoming national defence strategy.\nIn his keynote address at the annual Reagan National Defence Forum on Saturday, Hegseth said Washington was committed to putting “America first” and avoiding involvement in foreign entanglements as it prioritised domestic security.\nYet, in drawing comparisons between the Trump administration’s...",
        "source": "smcp",
        "date": "2025-12-08T19:01:00+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3335615/us-defence-chief-touts-flexible-realism-china-ahead-strategy-documents-release?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "73fd5a0613d2a4881bf368737a9d6c653e1be254c0875eb1e636cc905553d5cc",
        "title": "Macron’s trade ultimatum to China goes public: fix surplus or face tariffs",
        "summary": "Emmanuel Macron has warned Beijing that Europe would be forced to retaliate with “strong measures” against Chinese goods – including punitive tariffs modelled after US policy – if a trade imbalance between the two sides remains unaddressed well into 2026.\nBack in Paris, fresh from a diplomatic visit to China that ended on Friday, the French president told business newspaper Les Echos that China was “effectively killing their own customers” by running unsustainable surpluses while curbing...",
        "source": "smcp",
        "date": "2025-12-08T19:00:33+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3335620/macrons-trade-ultimatum-china-goes-private-public-fix-surplus-or-face-tariffs?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b9442bad004a27382cb3f23bf11453604e8f927563ef7929f7a897c6790d8e99",
        "title": "China’s lab fungus produces low-cost, meat-like protein to replace chicken farms",
        "summary": "Chinese scientists have genetically modified a fungus commonly used in the production of meat substitutes to make it an even more environmentally friendly source of protein than chicken – one of the farmed animals that has the least impact on the environment.\nThe team used CRISPR-based gene editing to modify Fusarium venenatum, improving its production efficiency and reducing its environmental impact without introducing foreign DNA, according to a paper published in the peer-reviewed Trends in...",
        "source": "smcp",
        "date": "2025-12-08T16:59:27+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3335590/chinas-lab-fungus-produces-low-cost-meat-protein-replace-chicken-farms?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d415ad4b59c694a1b53a1fdffa4d61246fe920fc32299b9f601f1629bfe40e6f",
        "title": "Japan keeps tabs on 4 Chinese navy ships near Okinawa after weekend stand-off",
        "summary": "China’s Liaoning carrier strike group continued military drills in waters near Japan’s Okinawa on Sunday, Tokyo said, a day after a rare stand-off between Chinese and Japanese fighter jets in the area.\nThe PLA Navy aircraft carrier and three guided missile destroyers were sailing northeast between Okinawa and Minami-Daito islands, and in waters around 190km (118 miles) east of Kikai Island, Japan’s defence ministry said on Sunday night.\nAround 50 take-offs and landings by carrier-based fighter...",
        "source": "smcp",
        "date": "2025-12-08T15:00:00+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3335566/japan-keeps-tabs-4-chinese-navy-ships-near-okinawa-after-military-stand?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "14ab31ec0e1df6396784825caf1b269c75e47c8d90fd8caad233150a146fc269",
        "title": "China’s Politburo pledges action to tackle trade ‘struggles’ in 2026",
        "summary": "China has pledged to better coordinate its domestic economic work to account for international trade turbulence next year, with a high-level decision-making body calling for the promotion of “effective qualitative improvement and reasonable quantitative growth” in the country’s economy.\nAfter a meeting of the ruling Communist Party’s Politburo on Monday, the 24-member body said China would “seek progress while maintaining stability” in next year’s economic work, and continue to exert a “more...",
        "source": "smcp",
        "date": "2025-12-08T14:34:14+09:00",
        "url": "https://www.scmp.com/economy/policy/article/3335563/chinas-politburo-says-more-proactive-fiscal-policy-come-2026?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bd6a503e94d6f91f8e6d0a50b9f094cbb1ec9a42c25b06c1fbedd87ad1f58f61",
        "title": "Why Chinese firms are taking operational risks on African projects",
        "summary": "China’s big money is returning to African infrastructure as its state-owned firms evolve from mere builders into long-term financiers and operators.\nThis is so they have enough “skin in the game”, according to one analyst, as Beijing seeks lasting influence over key transport routes and critical mineral supply chains in Africa.\nAcross the continent, these companies are increasingly financing, building and operating key infrastructure under public-private partnerships (PPP). This financing model...",
        "source": "smcp",
        "date": "2025-12-08T13:00:14+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335506/skin-game-china-pivots-operating-african-railways-ports-funding-shift?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5556d44a37675ec6cb465461955e4935317e25b46e3623642aeffe1933eccd71",
        "title": "China’s trade surplus tops record US$1 trillion, defying trade war uncertainty",
        "summary": "China has reached a new trade surplus milestone, surpassing last year’s record to hit an all-time high of US$1.076 trillion in the first 11 months of the year – driven by extensive efforts to diversify export markets and supply chains amid uncertainties from US President Donald Trump’s tariff war.\nThe trade surplus from January to November was higher than the previous full-year record of US$992.2 billion in 2024. Meanwhile, the trade surplus for the first 10 months of this year totalled US$964.8...",
        "source": "smcp",
        "date": "2025-12-08T12:23:40+09:00",
        "url": "https://www.scmp.com/economy/economic-indicators/article/3335551/chinas-exports-rebound-november-after-trade-war-thaw?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "edd57807e2680a1973576c9efe8200a0dacd9242fa5d9fadc4953a44383a8e96",
        "title": "Mid-air military stand-off triggers duelling protests in China-Japan row latest",
        "summary": "Beijing has lodged “counter-protests” against Japanese complaints over a weekend mid-air stand-off northeast of Taiwan near the Miyako Strait, accusing Tokyo of “purely ill-intentioned” rhetoric and “ulterior motives”.\n“Japan is deliberately spreading and hyping up false information regarding military and security matters, thereby stoking tensions,” Chinese foreign ministry spokesman Guo Jiakun said on Monday.\n“Such actions are entirely driven by ulterior motives,” he added.\nOn Sunday, the...",
        "source": "smcp",
        "date": "2025-12-08T11:01:16+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335547/mid-air-military-stand-triggers-duelling-protests-china-japan-row-latest?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6a09e3b37d39c0c1a1ee9f3a3b4fda6058884b414de545fcb23f649a65ca3c89",
        "title": "China trials unmanned trucks on world’s highest mine, 5,600m from sea level",
        "summary": "China is building the world’s highest unmanned mine at a forbidding altitude of 5,600 metres (18,372 feet), higher than the world’s highest known inhabited settlement.\nAt the Huoshaoyun lead-zinc mine in Hotan county, Xinjiang, domestically developed unmanned mining trucks have successfully completed ore loading and transport testing, according to the state-owned Science and Technology Daily.\nThese machines can operate round the clock, eliminating the risk to workers of exposure to the...",
        "source": "smcp",
        "date": "2025-12-08T11:00:17+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3335307/china-trials-unmanned-trucks-worlds-highest-mine-5600-metres-sea-level?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "393efe6bd813b8602ec6967e1c8d63598f688623821f77eee68ebda1f5fe9069",
        "title": "Chinese coastguard conducts first drill in Taiwan Strait’s key choke point",
        "summary": "Mainland China’s coastguard has carried out its first-ever search and rescue exercise in a key section of the Taiwan Strait – one of the world’s most strategically vital and busiest waterways.\nThe large-scale drills on Saturday centred around the Taiwan Shoal – a shallow, hazardous stretch in the southern end of the strait. The location underscored Beijing’s first operational presence in the vital choke point where global trade, military strategy and cross-strait politics converge.\nThe Fujian...",
        "source": "smcp",
        "date": "2025-12-08T09:00:18+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335527/chinese-coastguard-conducts-first-rescue-drill-taiwan-straits-strategic-choke-point?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5bcc1d94ba6e295de3e1ea8518b0c9c7ad55a33cb6f8e1b5c3ae39a4f4e02084",
        "title": "Economist Huang Yiping on why China’s AI push must be ‘job-oriented’",
        "summary": "Huang Yiping is the dean of Peking University’s National School of Development and a member of the Monetary Policy Committee of the People’s Bank of China, the country’s central bank. He also sits on the Hong Kong stock exchange’s Mainland China Advisory Group.\nIn his second Open Questions interview, Huang shares his thoughts on the need for caution in adopting new technologies like stablecoins and artificial intelligence, China’s next five-year plan and whether its tariff ceasefire with the US...",
        "source": "smcp",
        "date": "2025-12-08T07:00:31+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335355/economist-huang-yiping-why-chinas-ai-push-must-be-job-oriented?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8410c415fc41f15b1478865ceb41cd66cf81ff340c348b8a727b0d7e5edef9ec",
        "title": "China desalination tech makes fresh water cheaper than tap water – plus hydrogen",
        "summary": "China has launched a revolutionary facility in the eastern province of Shandong that produces fresh water from seawater for just two yuan (US$0.28) per cubic metre, generating green hydrogen as a by-product in a breakthrough that could redefine global water and energy systems.\nThis small but world-first installation in the city of Rizhao is powered entirely by seawater and low-grade waste heat from nearby steel and petrochemical plants, official provincial news outlet Dazhong reported on...",
        "source": "smcp",
        "date": "2025-12-08T01:00:11+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3335518/chinese-desalination-plant-makes-fresh-water-cheaper-tap-water-plus-green-hydrogen?utm_source=rss_feed",
        "reportUrl": ""
    }
]