[
    {
        "id": "2f04e5cfd3c23fe23fd6a3031bb95d3bee90e53776e8a369b5e7e03e19f20b6a",
        "title": "Why America has always needed an enemy, even as a young republic",
        "summary": "It’s rare to find an opinion piece that embodies nearly all the false premises and presuppositions that underpin the American empire, now in undeniable retreat. But Rahm Emanuel, former White House chief of staff to Barack Obama, mayor of Chicago and until recently US ambassador to Japan, has managed to do just that.\nWriting in The Wall Street Journal on August 31, Emanuel claims that the question today for Americans is: “Can China be the external threat that restores internal cohesion to our...",
        "source": "smcp",
        "date": "2025-09-08T10:00:14+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3324679/why-america-has-always-needed-enemy-even-young-republic?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6459356373959522d3d84da821cb994b5b912aae100354ce51fabdf13d7ead32",
        "title": "Global investors shift from US stocks drawn by Asia’s AI boom, Fed policy: BoFA",
        "summary": "Investors are looking beyond US equities for the first time in a decade amid a weakening US dollar and likely easing of US monetary policy, moving capital into Asia as they chase the artificial intelligence boom in the region, according to the head of global research at Bank of America (BofA).\nAhead of the three-day BofA Securities Asia Pacific Conference starting on Monday, Candace Browning said that US equities had been exceptional from the first half of 2020 to the end of 2024, attracting...",
        "source": "smcp",
        "date": "2025-09-08T08:30:10+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3324511/global-investors-shift-us-equities-drawn-asias-ai-boom-looser-fed-policy-bofa?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3bc3924185c382fc0acc8005a328ff5a5e7cf996b1d412250306f7e2c92f75c9",
        "title": "‘Blood Moon’ rises during total lunar eclipse",
        "summary": "Stargazers enjoyed a “Blood Moon” on Sunday night during a total lunar eclipse visible across Asia and swathes of Europe and Africa.\nWhen the sun, Earth and moon line up, the shadow cast by the planet on its satellite makes it appear an eerie, deep red colour that has astounded humans for millennia.\nPeople in Asia, including India and China, were best placed to see Sunday’s total eclipse, which was also visible on the eastern edge of Africa as well as in western Australia.\nStargazers in Europe...",
        "source": "smcp",
        "date": "2025-09-08T08:13:39+09:00",
        "url": "https://www.scmp.com/news/asia/australasia/article/3324678/blood-moon-rises-during-total-lunar-eclipse-has-astounded-humans-millennia?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f6841fd0bfccde678418f39e4d33536b42186252eab0b1f8bdde688171761767",
        "title": "Oxford’s Ian Goldin on why globalisation is ‘alive and well’ in Asia",
        "summary": "Ian Goldin is a professor of globalisation and development at the University of Oxford. Before his time in academia, he worked at several development lenders, including the World Bank, where he served as director of development policy and vice-president. His latest book, The Shortest History of Migration, was published in July 2024.\nThis interview first appeared in SCMP Plus. For other interviews in the Open Questions series, click here.\nWhere do you think globalisation is heading? Is...",
        "source": "smcp",
        "date": "2025-09-08T07:00:12+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3324320/oxfords-ian-goldin-why-globalisation-alive-and-well-asia?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "525fe60dff4e96b321145fb2f96af20d05e16c375f5edd34a4b49816e25c67d5",
        "title": "Hong Kong is back. Now it must quickly cement its international status",
        "summary": "The familiar signs of hustle and bustle in Hong Kong are back. Mainland tourists are thronging major attractions, from the Tsim Sha Tsui promenade to Disneyland Resort. Foreign tourists are returning in noticeable numbers, adding a cosmopolitan flair. Overseas business travellers are back in droves, too, as evidenced by the back-to-back exhibitions at the Hong Kong Convention and Exhibition Centre, which is booked solid until next July.\nWalking by recently, I was struck by the diversity on...",
        "source": "smcp",
        "date": "2025-09-08T06:30:07+09:00",
        "url": "https://www.scmp.com/opinion/hong-kong-opinion/article/3324237/hong-kong-back-now-it-must-quickly-cement-its-international-status?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "57096c82733c8dde346b95661ddc8d5e78e103608955ad2067c04ed2c314fa90",
        "title": "US investigating malware email targeting trade talks with China: report",
        "summary": "US authorities are investigating a bogus email from a Republican lawmaker that contained malware apparently aimed at giving China insights into the Trump administration’s trade talks with Beijing, The Wall Street Journal reported on Sunday.\nThe malware in the email purportedly sent by congressman John Moolenaar in July to US trade groups, law firms and government agencies was traced by cyber analysts to a hacker group – APT41 – believed to be working for Chinese intelligence, the newspaper...",
        "source": "smcp",
        "date": "2025-09-08T02:15:16+09:00",
        "url": "https://www.scmp.com/news/world/united-states-canada/article/3324670/us-investigating-malware-email-targeting-trade-talks-china-reports?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "64770b4b75461d81471140a0b1e096e92b36a3ee870afeaee555931be60ce508",
        "title": "How China’s military surged ahead by firing up competition among suppliers",
        "summary": "The futuristic drones, intercontinental missiles and laser and microwave systems that rolled through central Beijing on Wednesday reflect not only the intensity of China’s military modernisation drive but also advances in the research and manufacturing ecosystem that has sprung up to develop it.\nAt least five nuclear-capable missile types made their debut during the military parade – three can reportedly reach the continental United States; one is a submarine-launched ballistic missile; and the...",
        "source": "smcp",
        "date": "2025-09-07T23:00:11+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3324640/how-chinas-military-surged-ahead-tech-firing-competition-among-suppliers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9bce0168170761244103842c5c6f663507a844b310195aacf1179c5f2604e42c",
        "title": "China's remarkable global achievement in air pollution control",
        "summary": "China's remarkable global achievement in air pollution control",
        "source": "cgtn",
        "date": "2025-09-07T21:35:03+09:00",
        "url": "https://news.cgtn.com/news/2025-09-07/China-s-remarkable-global-achievement-in-air-pollution-control-1GtI6NZsWgE/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "94a59a871c34198f065fb8a24fbee2480f72c4d65beacbeb88abca8aa4bf7c0b",
        "title": "Why it makes sense for green-tech exporter China to ramp up coal power",
        "summary": "China switched on 21 gigawatts of new coal power capacity in the first half of this year, the highest since 2016, according to a recent energy report. This came after electricity demand hit a historic high in July, driven by extreme heatwaves. Hydropower faltered, and coal plants were fired up to meet the load.\nAt first glance, this looks like a step backwards for climate policy. But China’s clean-energy engine is still accelerating, adding 212GW of solar power capacity in the first six months,...",
        "source": "smcp",
        "date": "2025-09-07T21:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3324092/why-it-makes-sense-green-tech-exporter-china-ramp-coal-power?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b06b6930f54c3c29817429e0602d2daade5fe93f149083d86ff289f36a101da2",
        "title": "Is Trump’s new-found love for Chinese students superficial? Experts think so",
        "summary": "Amid growing anger from his political base, US President Donald Trump has defended his proposal to admit 600,000 Chinese students over two years, but analysts warn that the policy reversal may not ease the pathway to American colleges.\nReaction to last month’s announcement prompted the administration, which previously “aggressively revoked” visas for Chinese students, to clarify that the plan would be implemented over two years, bringing the total to just above the existing annual enrolment...",
        "source": "smcp",
        "date": "2025-09-07T21:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3324481/trumps-new-found-love-chinese-students-superficial-experts-think-so?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c89dc569c628d8e862c224dbecdf78d8711aaa0e80ab586f831031145d9c0c4e",
        "title": "Xi to attend BRICS leaders' meeting via video link on September 8",
        "summary": "Xi to attend BRICS leaders' meeting via video link on September 8",
        "source": "cgtn",
        "date": "2025-09-07T20:47:48+09:00",
        "url": "https://news.cgtn.com/news/2025-09-07/Xi-to-attend-BRICS-leaders-meeting-via-video-link-on-September-8-1GtDGAz2QiQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f18e14f6ce26fb6da1c26c8480e639193c6d23928111a233f89d7457c1d60a13",
        "title": "Why homeward shift by Pentagon may signal US decline in ‘bad news’ for Taiwan",
        "summary": "The Pentagon’s reported plans to focus on domestic and regional threats over countering China signals an “inevitable” waning of Washington’s global power, according to a retired People’s Liberation Army (PLA) officer.\nThe shift might be bad news for Taiwan, he warned.\nUS news outlet Politico reported on Friday that Pentagon officials had urged the Department of Defence to prioritise protecting the homeland and western hemisphere, marking a shift in its focus on its adversaries including China...",
        "source": "smcp",
        "date": "2025-09-07T20:11:30+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3324659/why-pentagons-homeward-shift-may-signal-us-power-decline-bad-news-taiwan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7cb160b43df743c1235f28abdf55841e88172f3bd408bc286ace08672b43366f",
        "title": "China Weekly News Quiz: September 1-7, 2025",
        "summary": "Do you know what happened in China last week? Take our weekly news quiz to test your knowledge and get up to speed on the latest developments in case you missed something.",
        "source": "cgtn",
        "date": "2025-09-07T19:57:19+09:00",
        "url": "https://news.cgtn.com/news/2025-09-07/China-Weekly-News-Quiz-September-1-7-2025-1GtzgRQZzTG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "94a82e19a77e8b1a17382b3a24fc3f78243ccc3745d43908eff43148e848bc5b",
        "title": "Severe winds and rains expected as typhoon Tapah approaches",
        "summary": "Severe winds and rains expected as typhoon Tapah approaches",
        "source": "cgtn",
        "date": "2025-09-07T19:57:01+09:00",
        "url": "https://news.cgtn.com/news/2025-09-07/Severe-winds-and-rains-expected-as-typhoon-Tapah-approaches-1GtxWx2j9ny/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "6402e1aaf2f9d38c8c5ef4d83c07fbc5cc1a5bf8967fb545a65d7a2526b1c1c0",
        "title": "China’s Xin Zhilei creates history with Venice Film Festival best actress gong",
        "summary": "China’s Xin Zhilei has won the Best Actress award at the Venice Film Festival, becoming the first Chinese woman to receive the honour in 14 years.\nThe 39-year-old brought the Golden Lion trophy home on Saturday for her role in The Sun Rises on Us All, directed by Cai Shangjun.\nThe film sees Xin play the harassed owner of a fashion retail business who is trying to reconcile with her former lover, who served time in prison for a crime she had committed.\n“I feel like I am dreaming,” Xin said in her...",
        "source": "smcp",
        "date": "2025-09-07T19:08:53+09:00",
        "url": "https://www.scmp.com/news/china/article/3324656/chinas-xin-zhilei-creates-history-best-actress-award-venice-film-festival?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "acbd2c58a9734860390541d3a84b34a2a2db2d3d2a4a22a2e9480063d9b34ae8",
        "title": "Harvard’s top mathematician Liu Jun leaves US for China",
        "summary": "Liu Jun, one of the world’s leading statisticians and a long-time professor at Harvard, has returned to China full-time, accepting a prestigious chair at Tsinghua University last month.\nThe move marks the homecoming of an academic whose career has spanned research in data science, biostatistics and artificial intelligence – and whose early life reflected the complex interplay between intellectual pursuit and political engagement.\nIn 1988, Liu Jun transferred from Rutgers University in New Jersey...",
        "source": "smcp",
        "date": "2025-09-07T19:00:12+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3324637/top-harvard-mathematician-liu-jun-leaves-us-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bb591325ac2641a30bededd0e0e1bd073fe53dbeb077b55b18cd004fed2851a7",
        "title": "China sends Y-20s on quake aid mission to Afghanistan",
        "summary": "Two Chinese military aircraft have arrived in Kabul to deliver humanitarian aid to earthquake-hit Afghanistan, highlighting strategic trust between the two countries.\nEarly on Sunday, two People’s Liberation Army Air Force Y-20 heavy-lift transporters touched down with the first batch of earthquake relief cargo promised by Beijing after a devastating tremor struck eastern Afghanistan last weekend, according to state broadcaster CCTV.\n\nThe supplies are mainly tents and blankets and more aid will...",
        "source": "smcp",
        "date": "2025-09-07T18:00:08+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3324648/china-sends-y-20s-quake-aid-mission-afghanistan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "25b2f826225237c6222e28a7df32b84638911e59b0a2fe023f15ccd34e38a8bf",
        "title": "Herdsmen drive livestock to winter pastures in Xinjiang",
        "summary": "Herdsmen were spotted driving their livestock to winter pastures on September 6 in Altay, Xinjiang.",
        "source": "cgtn",
        "date": "2025-09-07T17:27:30+09:00",
        "url": "https://news.cgtn.com/news/2025-09-07/Herdsmen-drive-livestock-to-winter-pastures-in-Xinjiang-1Gtoe3ToHw4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d5d4598b1897892e9e7f922835602dbdc50f34a2b7ec852eb8c8ca21be35e97c",
        "title": "Could Taiwan’s ‘high-low’ attack drone plan overwhelm PLA defences?",
        "summary": "Taiwan is moving swiftly to expand its long-range strike abilities with a new class of low-cost unmanned aerial vehicles (UAVs).\nThis comes as military planners seek affordable alternatives to expensive cruise missiles and Washington deepens cooperation with Taipei on drones and emerging technologies.\nThe urgency has grown since Beijing showcased cutting-edge uncrewed systems during its Victory Day parade at Tiananmen Square on Wednesday – platforms that analysts said mirrored or even surpassed...",
        "source": "smcp",
        "date": "2025-09-07T15:00:15+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3324528/could-taiwans-new-high-low-attack-drone-strategy-counter-mainland-chinas-arsenal?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b6ed08c79a346abc09bfd27b69ff1a83d4a8637e719524b32bddade4ed374381",
        "title": "China's first batch of aid arrives in quake-hit Afghanistan",
        "summary": "China's first batch of aid arrives in quake-hit Afghanistan",
        "source": "cgtn",
        "date": "2025-09-07T14:35:41+09:00",
        "url": "https://news.cgtn.com/news/2025-09-07/China-s-first-batch-of-aid-arrives-in-quake-hit-Afghanistan--1Gtfi9N455C/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "4058db4f9991653e72b85b47f0aa16fa212decaf6830000bac879bc023ef5e1a",
        "title": "Love in the East: Dating AI",
        "summary": "Love in the East: Dating AI",
        "source": "cgtn",
        "date": "2025-09-07T13:54:27+09:00",
        "url": "https://news.cgtn.com/news/2025-09-07/Love-in-the-East-Dating-AI-1Gt5iQK1ZVC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "40b48a1069a537ae4dc116477472cbbf1cbf5dcfa7c80d424a2984c5fea0b361",
        "title": "US-China team harnesses bubble-popping energy for robot launch",
        "summary": "Scientists in China and the US have harnessed the energy released by collapsing bubbles to create a robot launching system which the researchers say could be used for targeted drug delivery or exploring hard-to-reach spaces.\nThe method works by rapidly heating light-absorbing materials with a laser, causing water droplets on the surface around the material to boil, triggering the formation of vapour bubbles.\nOnce these bubbles grow to a certain point, they suddenly collapse – rapidly releasing...",
        "source": "smcp",
        "date": "2025-09-07T12:00:08+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3324287/us-china-team-harnesses-bubble-popping-energy-robot-launch?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "00e42d272c4c4ff7f08013f07d384f443dcb59e0ddfa5dbc29a531f5eefbe485",
        "title": "China launches new remote sensing satellites",
        "summary": "China launched a new group of remote sensing satellites from the Taiyuan Satellite Launch Center in northern Shanxi Province on Sunday.",
        "source": "cgtn",
        "date": "2025-09-07T11:15:22+09:00",
        "url": "https://news.cgtn.com/news/2025-09-07/China-launches-new-remote-sensing-satellites-1GsYb47fGi4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "660f0229251beda02ada372f0dfafc5a8cc9cce57e0f67498456a137aece3bd5",
        "title": "Experts: World expects more Chinese films to present modern China",
        "summary": "Audiences worldwide are eager to see more films from China at international film festivals, where they can experience contemporary Chinese culture and stories, experts said during the 82nd Venice International Film Festival.",
        "source": "cgtn",
        "date": "2025-09-07T11:08:34+09:00",
        "url": "https://news.cgtn.com/news/2025-09-07/Experts-World-expects-more-Chinese-films-to-present-modern-China-1GsXBhEpNFS/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "46bf71b8cf51d582dd3c453b4d41d465a5ee8df3423ded1a1e8d5e2f8270864e",
        "title": "‘Homestay’ heartache hits China as operators lament lack of business",
        "summary": "After four years leasing out private holiday accommodation beside the sea in the west of Guangdong province, a downturn in demand has led Chen Mei to regret getting involved in the industry.\n“I thought domestic demand would rebound quickly after the [Covid-19] pandemic, but price wars have actually intensified across the industry, squeezing profits year by year,” she said. “I’ve begun scaling back operations. If I could choose again, I wouldn’t have invested in the industry.”\nChen’s downbeat...",
        "source": "smcp",
        "date": "2025-09-07T11:00:12+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3324500/homestay-heartache-hits-china-operators-lament-business-downturn?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "054c27f607b641dc5f1ad5fbd225c3cc913f4e3a5efbcde470c139bd54dc1ac7",
        "title": "UK to send largest-ever delegation to China investment fair",
        "summary": "UK to send largest-ever delegation to China investment fair",
        "source": "cgtn",
        "date": "2025-09-07T10:58:50+09:00",
        "url": "https://news.cgtn.com/news/2025-09-07/UK-to-send-largest-ever-delegation-to-China-investment-fair-1GsUHJ8hTGw/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "4747941920737864745581d532450343bed383ebaf885ca3b84ff36168c062ab",
        "title": "In a summit full of symbolism, China lays out vision for multipolar order",
        "summary": "The two-day Shanghai Cooperation Organisation (SCO) summit that concluded in Tianjin on September 1 was a significant diplomatic triumph for President Xi Jinping and Beijing. The forum sought to burnish China’s geopolitical profile as a reliable interlocutor and an alternative voice for stability in global governance.\nSCO summits tend to be low-key and do not garner much notice. This time, though, China used the opportunity to signal it had arrived at the global high table at a time when US...",
        "source": "smcp",
        "date": "2025-09-07T10:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3324348/summit-full-symbolism-china-lays-out-vision-multipolar-order?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9dccd2de39edb827af6a2d051ec6dd54bd7c6a78d4f9134a313b5cef35c46265",
        "title": "Xin Zhilei wins best actress at Venice International Film Festival",
        "summary": "Chinese actress Xin Zhilei won the Best Actress award Saturday night at the 82nd Venice International Film Festival for her role in The Sun Rises on Us All.",
        "source": "cgtn",
        "date": "2025-09-07T10:19:19+09:00",
        "url": "https://news.cgtn.com/news/2025-09-07/Xin-Zhilei-wins-best-actress-at-Venice-International-Film-Festival-1GsV1XtHGPC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b56a7a909d6e1d6e8f5eaa782a2bae1dec796ecf9fd6538664715cf428b13020",
        "title": "Kai Tak's Bailu: Flowing and striking like lightning...",
        "summary": "As White Dew or \"Bailu\" arrives, the air turns crisp and cool, echoing the rhythms of the world and your spirit. Martial arts routines focus on balancing attack and defense, movement and stillness, strength and subtlety, finding harmony in opposites and order in constant change.",
        "source": "cgtn",
        "date": "2025-09-07T09:53:32+09:00",
        "url": "https://news.cgtn.com/news/2025-09-07/Kai-Tak-s-Bailu-Flowing-and-striking-like-lightning--1GsLeNqdHSE/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "1443aa7b745e56b4bc2706e6bead814098c323204fd081c72b0f415531f5515e",
        "title": "Anthropic’s Claude restrictions put overseas AI tools backed by China in limbo",
        "summary": "An abrupt decision by American artificial intelligence firm Anthropic to restrict service to Chinese-owned entities anywhere in the world has cast uncertainty over some Claude-dependent overseas tools backed by China’s tech giants.\nAfter Anthropic’s notice on Friday that it would upgrade access restrictions to entities “more than 50 per cent owned … by companies headquartered in unsupported regions” such as China, regardless of where they are, Chinese users have fretted over whether they could...",
        "source": "smcp",
        "date": "2025-09-07T08:00:14+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3324583/tech-war-anthropics-claude-restrictions-put-overseas-ai-tools-backed-china-limbo?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7b2d248fb41ebb6ea6351954a496d6a775f3631de9e1dc8835212982bcb7833f",
        "title": "Splendor of Jiangsu Showcases Chinese Fashion and Art in DC",
        "summary": "The Chinese Embassy in the United States welcomed guests from across the nation’s cultural, business, media, and academic communities on Friday, Sep. 5 for the “Embroidered Elegance: The Artistic Rhythm of Jiangsu\" event.",
        "source": "cgtn",
        "date": "2025-09-07T07:10:07+09:00",
        "url": "https://newsus.cgtn.com/news/2025-09-07/Splendor-of-Jiangsu-Showcases-Chinese-Fashion-and-Art-in-DC-1GsJorXUAYo/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "474a60d599da0d2133c38dc617e779eae6b9d944a7467100569e561f192d2d9c",
        "title": "What did 3 new PLA units at WWII parade say about China’s hi-tech war plans?",
        "summary": "China’s grand military parade highlighting new space, cyber and information warfare branches underscored the country’s push to weave advanced technologies into its combat strategy, according to analysts.\nIn a show of military strength and modernisation, Wednesday’s parade in Beijing marking the 80th anniversary of Japan’s defeat in World War II unveiled the People’s Liberation Army’s most advanced weaponry and its latest command structure reforms.\nThe spectacle featured formations not just from...",
        "source": "smcp",
        "date": "2025-09-07T07:00:11+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3324524/what-did-chinas-victory-parade-reveal-about-pla-space-cyber-information-war-plans?utm_source=rss_feed",
        "reportUrl": ""
    }
]