[
    {
        "id": "c5f4d5bedb3f76e9ec363c81ea0924265e27a4faf6e6b2d26379c2e67a5bd92f",
        "title": "As Nobel laureates show, the US can’t take tech lead over China for granted",
        "summary": "China and the United States are locked in a contest for technological supremacy. While it’s impossible to predict the ultimate winner and loser, this year’s Nobel Prize winners in economics may serve as a useful guide to where the two rivals are heading.\nThe US is currently still ahead when it comes to science and technology. But when it comes to STEM (science, technology, engineering and mathematics) education, China has a clear edge, which is likely to grow even larger in the coming...",
        "source": "smcp",
        "date": "2025-10-22T10:30:09+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3329729/nobel-laureates-show-us-cant-take-tech-lead-over-china-granted?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a9978fc4cfd03fb5163bbf6b84fd63dcf96c17753db96835374003c54228c0ee",
        "title": "Can Trump’s pragmatism override China hawks to keep ties from rupture?",
        "summary": "China’s rocky trade relationship with the United States was on full display this month as US President Donald Trump threatened to impose additional tariffs on Chinese imports.\nSeparately, US Treasury Secretary Scott Bessent denounced China’s move to expand curbs on rare earth exports, calling it “a sign of how weak their economy is”. He also described Li Chenggang, one of China’s trade negotiators, as “pretty unhinged and very aggressive”.\nTrade ties between the rival powers remain fraught, even...",
        "source": "smcp",
        "date": "2025-10-22T07:00:10+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329223/how-paramount-leader-donald-trump-could-prove-be-guard-rail-us-china-ties?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5318b314501e397f3c9d2cfc7b11c49de458bb8c294188dedc732fbb1a241733",
        "title": "Can Donald Trump’s gut instinct win over Xi Jinping at Apec summit?",
        "summary": "US President Donald Trump is expected to approach his coming summit with Xi Jinping by relying on personal chemistry and his “gut”, but his ability to charm the Chinese leader will be limited at best, analysts and former government officials in Washington said on Tuesday.\nThe first meeting in six years between the heads of the world’s two largest economies is expected to take place shortly before the October 31-November 1 Asia-Pacific Economic Cooperation meeting in South Korea. Among the topics...",
        "source": "smcp",
        "date": "2025-10-22T06:40:54+09:00",
        "url": "https://www.scmp.com/news/china/article/3329858/can-trumps-gut-instinct-win-over-xi-jinping?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c5773513bb41b44f4d54388496c966a2c3fda371126dd71b24d60a557192b452",
        "title": "China agrees to crisis talks in Brussels to discuss rare earths compromise",
        "summary": "China’s commerce minister has accepted an “urgent” invitation to Brussels, the EU’s trade chief Maros Sefcovic said on Tuesday, as the bloc looks to unpick Beijing’s restrictions on rare earth mineral exports and defuse a row over Dutch-based chipmaker Nexperia.\nThe EU is seeking China to relax export licensing requirements for rare earth elements and magnets, which are crucial to manufacturing hi-tech goods, from fighter jets to electric vehicles, and which were broadened earlier this month.\nIt...",
        "source": "smcp",
        "date": "2025-10-22T02:55:06+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329855/china-agrees-crisis-talks-brussels-rare-earth-and-nexperia-sagas-boil-over?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "64a3799aabea95e10dcfd3c55c84c0e69bd6298a3db3043c71d6492d1eb07d99",
        "title": "China eyes currency swap with Japan and South Korea amid trade tensions: source",
        "summary": "China is in talks with Japan and South Korea – both US allies – about a possible trilateral currency swap to bolster the region’s financial safety net and deepen economic cooperation amid US President Donald Trump’s trade war, according to a source familiar with the issue.\nPan Gongsheng, governor of the People’s Bank of China (PBOC), touched on the issue with his South Korean and Japanese counterparts, Rhee Chang-yong and Kazuo Ueda, on the sidelines of the IMF-World Bank annual meetings in...",
        "source": "smcp",
        "date": "2025-10-22T01:23:46+09:00",
        "url": "https://www.scmp.com/news/china/money-wealth/article/3329849/china-eyes-3-way-currency-swap-japan-and-south-korea-amid-trumps-tariff-war-source?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "567f5affa7aca190d0d6c7e27bc6a910ba9159544fdf3388d12ff0abc1e01a69",
        "title": "China’s analogue AI chip could work 1,000 times faster than Nvidia GPU: study",
        "summary": "Chinese scientists have created a superfast analogue chip that can solve complex maths problems for advanced scientific tasks and artificial intelligence (AI) while using less power than conventional computing, according to a paper published this month.\nThe analogue device designed by researchers from Peking University uses memory chips made of resistive materials. With future improvements, it could perform calculations at a processing rate 1,000 times faster than top digital processors, such as...",
        "source": "smcp",
        "date": "2025-10-22T00:00:15+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329820/chinas-analogue-ai-chip-could-work-1000-times-faster-nvidia-gpu-study?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4820962ec777805e385423cf077769831232834434625983e7cd6a67bf6eb5b6",
        "title": "Can US-Australia rare earth deal loosen China’s grip on critical minerals trade?",
        "summary": "A critical minerals framework deal valued at US$8.5 billion between the United States and Australia will allow American buyers to rely less on Chinese rare earth metals, but developing a secure, independent supply chain may take the US 10 to 20 years, according to analysts.\n“Deals like this go a long way – this is a good start,” said Pini Althaus, CEO of US-based rare earth metal investor and developer Cove Capital, adding that Beijing would likely grow “more concerned” as the deal matures and...",
        "source": "smcp",
        "date": "2025-10-21T23:00:10+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3329803/how-us-australia-rare-earth-deal-aims-loosen-chinas-grip-critical-minerals-market?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a778c101feaf9f988689ebb830856ba9c79778c46aaa50de7d095f1419437efb",
        "title": "Trump-Albanese meeting, China patrols disputed waters: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Trump downplays Beijing threat to Taiwan as Australia touts rare earths deal\nWhile Trump celebrated a multibillion-dollar minerals deal with Canberra aimed at curbing China’s leverage in trade talks, he also dominated the encounter by opining that Beijing had no plans to invade Taiwan and posed no real threat in the Indo-Pacific.\n2. How a single rule change...",
        "source": "smcp",
        "date": "2025-10-21T22:15:08+09:00",
        "url": "https://www.scmp.com/news/china/article/3329826/ck-hutchison-panama-deal-hope-new-theory-wests-view-china-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "09027e1d087981312c9199a6c696aac4b5457bfbdb2a6bb176b2d1d564748c52",
        "title": "Taiwan defence chief warns of delays on key US F-16V fighter jet deal",
        "summary": "Completing the delivery of all 66 F-16V fighter jets ordered from the United States by the end of next year will be “challenging”, Taiwan’s defence minister has conceded, with the island yet to receive any of the aircraft.\nThe admission from Defence Minister Wellington Koo Li-hsiung highlights growing concerns in Taiwan over delays to one of its most important arms deals with Washington – a programme regarded as essential to bolstering air power as Beijing steps up military pressure on the...",
        "source": "smcp",
        "date": "2025-10-21T22:02:13+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3329841/time-delivery-us-f-16v-fighter-jets-looks-challenging-taiwan-defence-chief-warns?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7c20bcaca8652f875c42f18e60bce0713ec27ac947b631b6515637c80c3b4c4f",
        "title": "China’s Unitree builds course for students to learn how to train robot dogs",
        "summary": "Unitree Robotics has launched an education platform for students to train robot dogs and understand how they operate based on the start-up’s Go2 system, as adoption of these quadruped machines expands from enthusiasts to mainstream consumers.\nAccording to its social media post on Tuesday, Unitree has developed an in-person training course with ready-to-use tools that would enable students to learn the operation, maintenance and applications of a quadruped robot – specifically, the company’s...",
        "source": "smcp",
        "date": "2025-10-21T22:00:12+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3329835/chinas-unitree-builds-course-students-learn-how-train-understand-robot-dogs?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "da2890ad7b3ba184394208dfe383593ab71842a79c24f038cb37e8ba594e0512",
        "title": "A ‘fantastic deal’ or more tariffs? Why US-China trade talks face uncertainty",
        "summary": "As US President Donald Trump talked up meetings with President Xi Jinping and vowed on Monday to reach a deal with China, analysts said a comprehensive trade agreement was still unlikely in the near term despite the latest in a series of conciliatory signals from the US side.\n“When we finish our meetings in South Korea,” Trump said, referring to a planned summit with Xi before or during the Asia-Pacific Economic Cooperation (Apec) forum this month, “China and I will have a really fair and really...",
        "source": "smcp",
        "date": "2025-10-21T21:04:34+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3329833/fantastic-deal-or-more-tariffs-why-us-china-trade-negotiations-still-face-uncertainty?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "272f948e7e2e2b041de4ce50691dcb231d531f9b8fafdf5c5422a9aa4ff7ceb2",
        "title": "Call for ‘Pacific Eyes’ intelligence body to offset China’s growing presence",
        "summary": "Australia should lead the creation of a formal Five Eyes-style intelligence club in the Pacific amid China’s growing presence in the region, a prominent foreign policy think tank has suggested.\nDubbed “Pacific Eyes”, the proposed intelligence-sharing alliance could help to plug institutional gaps that “external powers” – particularly Beijing – were eager to exploit, the Sydney-based Lowy Institute said in a report released on Tuesday.\nIt recommended that the dedicated framework initially consist...",
        "source": "smcp",
        "date": "2025-10-21T20:30:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329818/pacific-eyes-intelligence-body-would-offset-chinas-growing-presence-region-report?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "61b36c6832efc6638e74ad38386918cac76e49aaee57322a5a57c6b234e05522",
        "title": "China says US visa threats to Central America show ‘lack of basic respect’",
        "summary": "China has accused the United States of showing “a lack of basic respect” for Central America following its threat to ban officials and others from the region with ties to the Communist Party from entering the country.\nThe State Department said last month that it would “restrict US visas for Central American nationals … intentionally acting on behalf of the Chinese Communist Party” and who “knowingly direct, authorise, fund, provide significant support to, or carry out activities that undermine...",
        "source": "smcp",
        "date": "2025-10-21T20:11:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329829/china-says-us-visa-threats-central-america-show-lack-basic-respect?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7b5c6fba4f4a92eece068755194dd6e3918305f6197646940ddcd0d5e9c1572f",
        "title": "Trump isn’t serious about deterring Beijing from attacking Taiwan: poll",
        "summary": "Most people in Taiwan do not see US President Donald Trump as serious about deterring Beijing from a possible attack on the self-ruled island, according to the results of a recent poll released on Tuesday.\nAsked whether Trump was willing to prevent mainland China from attacking the island, nearly 45 per cent of the 1,070 respondents said no, while more than 34 per cent said yes.\nThe poll was conducted by the Taiwanese Public Opinion Foundation between October 13 and 15.\nOn whether the US leader...",
        "source": "smcp",
        "date": "2025-10-21T19:41:08+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3329823/donald-trump-isnt-serious-about-deterring-beijing-attacking-taiwan-poll?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0414e0b851b99bd0bcd0930a4fd3d3dec80cddf987bc7c126333ffb067736fb9",
        "title": "Chipmaker CXMT eyes US$42 billion Shanghai listing, sources say",
        "summary": "Chinese memory chipmaker ChangXin Memory Technologies (CXMT) plans an initial public offering (IPO) in Shanghai as soon as the first quarter of next year, eyeing a valuation of up to 300 billion yuan ($42.12 billion), according to two sources briefed on the matter.\nFounded in 2016 with government backing, CXMT leads China’s strategic push to build a foothold in a global DRAM market long dominated by companies from Japan, South Korea and the United States.\nChina’s leading manufacturer of dynamic...",
        "source": "smcp",
        "date": "2025-10-21T18:08:08+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3329798/chipmaker-cxmt-eyes-us42-billion-shanghai-listing-sources-say?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "089abd5fc370241fabf0fbf7279377c1bcbca17df0562a3a53d3b73f2e592816",
        "title": "Why top Chinese scientist warned public against ‘hubris’ over country’s advances",
        "summary": "The Chinese people have been urged to stay “calm and objective” about the country’s advances in cutting-edge weapons by a veteran rocket scientist, who warned that “a lot of effort” was still needed.\nAn array of advanced rockets, including intercontinental ballistic missiles, featured in last month’s Victory Day parade in Beijing along with other hi-tech weapons. The spectacle generated considerable public enthusiasm.\nIn an interview for a popular video account, Zhao Ruian, 84, a former...",
        "source": "smcp",
        "date": "2025-10-21T18:00:16+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3329774/why-leading-chinese-scientist-warned-public-against-hubris-over-countrys-advances?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "17ce105c6d46387f2806ac2878637ad4a425cd3455a81560cc86a4598102d76e",
        "title": "Can Scott Bessent see China’s trade counterstrike with clear eyes?",
        "summary": "After a video call last Saturday, US Treasury Secretary Scott Bessent and Chinese Vice-Premier He Lifeng are expected to meet in Malaysia this week to hopefully ease tensions before US President Donald Trump and President Xi Jinping potentially meet on the sidelines of this year’s Apec summit. The meeting was in doubt when Trump threatened to impose an additional 100 per cent tariff on China, despite later relenting that it might not be sustainable.\nWashington blamed Beijing for the escalation,...",
        "source": "smcp",
        "date": "2025-10-21T17:30:10+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3329654/can-scott-bessent-see-chinas-trade-counterstrike-clear-eyes?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d678e49b2a977a9bf75710e8edef38fd3d20ab8b5ce490b09ce594e4e2f00e1a",
        "title": "Overseas banks raise China GDP forecasts, say Beijing ‘on track’ for 2025 target",
        "summary": "Several major banks forecast stronger economic growth for China this year, buoyed by third-quarter data showing slightly better-than-expected expansion despite domestic and external headwinds.\nInvestment bank Goldman Sachs raised its full-year gross domestic product forecast for 2025 from 4.8 per cent to 4.9 per cent, noting that the government’s target of “around 5 per cent” remains “largely on track”.\nThe bank also revised its estimate for 2026, up slightly from 4.2 per cent to 4.3 per cent,...",
        "source": "smcp",
        "date": "2025-10-21T17:01:45+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3329776/foreign-banks-raise-china-gdp-forecast-goldman-sachs-says-annual-target-largely-track?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "65d42a054431dbf071c16d896a6a49404a32011456cfb7467432f05fca1d24a8",
        "title": "China-Australia team reports cell weakness that may help fight prostate cancer",
        "summary": "An international team from China and Australia has discovered a new vulnerability in prostate cancer cells – a previously unknown mechanism that scientists say could help combat one of the most common cancers affecting men.\nAn estimated 1.5 million men worldwide are diagnosed with prostate cancer each year, according to the American Cancer Society, and established risk factors for the disease are older age, family history and genetic susceptibility.\nProminent individuals affected include...",
        "source": "smcp",
        "date": "2025-10-21T15:00:17+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329746/china-australia-team-reports-cell-weakness-may-help-beat-prostate-cancer?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "868b7356d90329df42d841a96a6f6a50502f76c7fcf0622fc2c13b39d2aa362f",
        "title": "At China’s Canton Fair, exporters sense a warming trend in yuan settlements",
        "summary": "At the ongoing autumn edition of the Canton Fair in Guangzhou – China’s oldest and largest trade exhibition – Chinese exporters are noticing a quietly spreading shift: an increasing number of overseas clients, particularly from emerging markets such as Southeast Asia, Central Asia and Africa, are proactively proposing to settle trade orders in yuan.\nWang Lilin, sales director at diesel generator manufacturer Keypower, said the company had seen a clear rise in yuan settlements over the past two...",
        "source": "smcp",
        "date": "2025-10-21T14:29:43+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3329752/chinas-canton-fair-exporters-sense-warming-trend-yuan-settlements?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b5a9c8e2b42289f5d2d16f63f945f6776a6b8bf084fabefa2e51be0234fd0bb5",
        "title": "What is ‘winology’, the new theory about unfair Western views of China?",
        "summary": "China’s economic and technological advances are being unfairly dismissed in the United States and other parts of the West as a result of hierarchical thinking, according to a theory dubbed “winology” that is taking hold among some online commentators.\nThe term winology was coined by Chinese academics and refers to ways in which countries can both become a global leader in certain areas and be recognised as such.\nHowever, the theory argues that the West relegates China to the lowest tier of a...",
        "source": "smcp",
        "date": "2025-10-21T12:00:07+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3329673/what-winology-theory-about-unfair-western-views-china-sweeping-social-media?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "626e5373be85913a985bdb02d5143541dc45f8049eb5192d93c4bfb5590ac2b6",
        "title": "Chinese coastguard patrols reefs controlled by Vietnam in South China Sea",
        "summary": "The Chinese coastguard patrolled around disputed sites controlled by Vietnam in the South China Sea last week, vessel tracking information shows.\nThree patrol ships left a Chinese base on Mischief Reef in the Spratly Islands on Thursday and circled around a series of land features – some of which Vietnam has built facilities on – before returning to the reef on Saturday, according to Automatic Identification System data.\nThe purpose of the patrol by the coastguard vessels – identified by the...",
        "source": "smcp",
        "date": "2025-10-21T11:17:31+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3329731/chinese-coastguard-patrols-disputed-reefs-controlled-vietnam-south-china-sea?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0b103c82b22f426999267f271ab8cf5b24fa45db8d72ea2bf475ee0afe5a49a5",
        "title": "How a single rule change sparked a major flare-up in US-China tensions",
        "summary": "When Beijing expanded its rare earth export controls earlier this month, it appeared to mark a fresh escalation in the US-China trade war. But for many observers, the dispute actually began over a week earlier – and its trigger was not a Chinese action, but an American one.\nThough it drew little fanfare at the time, the decision by the US Bureau of Industry and Security (BIS) to widen its trade blacklists in late September has had far-reaching effects. It not only pushed Beijing to take...",
        "source": "smcp",
        "date": "2025-10-21T09:00:14+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3329680/how-single-rule-change-sparked-major-flare-us-china-tensions?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "32232db49b6fe13610906ae6b77b607e211a7fe969fb77b9498785d0cc385fb5",
        "title": "CK Hutchison gets encouraging signs of a deal with Panama government",
        "summary": "A senior Panamanian official said on Monday that Panama will remain flexible and potentially reach an agreement with CK Hutchison as the Latin American country navigates the geopolitical rivalry between the United States and China.\n“We are working on a plan in case that [Panama’s Supreme Court] ruling goes against the extension of the contract” for CK Hutchison, said Jose Ramon Icaza, Panama’s minister of canal affairs.\n“In that case, we have to step in as the Panama Maritime Authority to take...",
        "source": "smcp",
        "date": "2025-10-21T07:39:00+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3329723/panama-ports-deal-ck-hutchison-gets-encouraging-signs-panamanian-government?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "de1cb4fd26dc88d56d5574bd15ac668fe718c970c46999bd88bfb79b8ba30d92",
        "title": "China AI plan offers hope for robot companions and kids by 2035",
        "summary": "When the Chinese government launched the “AI+” initiative in August, it was widely perceived as a new economic stimulus. However, observers may have underestimated Beijing’s true ambition.\nOn October 10, senior officials and experts published a series of analyses in the official journal E-Government, offering the public its first comprehensive look at the initiative’s deeper strategic intent.\nFar from being merely an economic policy, “AI+” is a decade-long national blueprint designed to propel...",
        "source": "smcp",
        "date": "2025-10-21T07:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329377/chinas-ai-plan-offers-citizens-infinite-hope-robot-companions-and-kids-2035?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "adcbb9b22f6ec5abdcb331cb460bd67d534abb2955db78ebb3cf4077a3b8ac61",
        "title": "To avert war, the West must shatter the mirror by which it views China",
        "summary": "In the shadow of escalating tensions between the United States and China, Graham Allison’s concept of the Thucydides Trap has become a staple of geopolitical discourse. Coined by the Harvard scholar, the term evokes the ancient Greek historian Thucydides’ observation that “it was the rise of Athens and the fear that this instilled in Sparta that made war inevitable”.\nAllison’s study of 16 historical cases, where a rising power challenged a ruling one, found war in 12 instances. He warns that...",
        "source": "smcp",
        "date": "2025-10-21T06:30:13+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3329612/avert-war-west-must-shatter-mirror-which-it-views-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7d9f3fc16c2cc3aa2877ce6d2267c6c687c2d88b2659e354fefefd0e94e43991",
        "title": "Trump downplays Beijing threat to Taiwan as Australia touts rare earths deal",
        "summary": "After nearly a year waiting to meet US President Donald Trump, Australian Prime Minister Anthony Albanese sought to argue his country’s strategic value Monday – only for the “America first” leader to dominate the encounter by opining that Beijing had no plans to invade Taiwan and posed no real threat in the Indo-Pacific.\n“China doesn’t want to do that,” he insisted on Taiwan, during a press gaggle alongside Albanese, later stating that the island will be one of the topics of discussion when he...",
        "source": "smcp",
        "date": "2025-10-21T03:01:12+09:00",
        "url": "https://www.scmp.com/news/china/article/3329717/trump-downplays-beijing-threat-taiwan-australia-touts-rare-earths-deal?utm_source=rss_feed",
        "reportUrl": ""
    }
]