[
    {
        "id": "6c39b22791dc44151e6c7bd30752eaaa3649460b3ab441e7387b6db88c31279f",
        "title": "Michael Sandel on Donald Trump’s rise, meritocracy and the US-China rivalry",
        "summary": "Michael Sandel is a political philosopher and the Anne T. and Robert M. Bass Professor of Government at Harvard University. His course on justice was the first at Harvard to be made freely available online and has been viewed by tens of millions of people. Sandel recently received the 2025 Berggruen Prize for Philosophy and Culture, which some have described as the Nobel Prize for philosophy. In this interview, Sandel discusses the roots of Donald Trump’s rise to power, the crisis in American...",
        "source": "smcp",
        "date": "2025-11-03T07:00:19+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3331224/michael-sandel-donald-trumps-rise-meritocracy-and-us-china-rivalry?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fd71370a6d29754a00f5d5261f58eb36a9f645cbdcbe115115c3874436f335ff",
        "title": "Hong Kong must do more to empower women in the workforce",
        "summary": "More than 200 C-suite women senior executives, including global chief executives and chief financial officers, are gathering in the epicentre of Hong Kong’s financial district for the city’s first ever Women Chief Executives summit today. The conference is symbolic as much as it is significant. Women in this city have progressed by leaps and bounds over the past decade.\nA recent report by one of the summit’s organisers, the Women Chief Executive Network, as well as KPMG and the Women’s...",
        "source": "smcp",
        "date": "2025-11-03T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/hong-kong-opinion/article/3331112/hong-kong-must-do-more-empower-women-workforce?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f5a1457978eb235becae675d35958ed2988c06d03b4975fc010abeda00cc3565",
        "title": "Trump says Xi understands ‘consequences’ if China invades Taiwan",
        "summary": "US President Donald Trump said Xi Jinping understands the consequences if China invades Taiwan, while refusing to specifically say the United States would defend the island, according to an extract of a CBS News interview broadcast on Sunday.\nTrump said Taiwan “never even came up as a subject” when he met the Chinese president in South Korea on Thursday for their first face-to-face meeting in six years.\nAsked on CBS’ 60 Minutes whether he would order US forces into action if China moved...",
        "source": "smcp",
        "date": "2025-11-03T02:06:23+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3331252/trump-says-xi-understands-consequences-if-china-invades-taiwan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "611fcc8bcee17d95487708e2f45397a9e00d977b21793a9a514aa773494948df",
        "title": "China’s updated 6th-generation fighter jets put US on notice for air supremacy",
        "summary": "Notable changes have been observed in both of China’s sixth-generation fighter programmes, with updated prototypes seen flying just 10 months after their first public appearance, indicating rapid progress as the country vies with the US for air supremacy.\nPhotos circulating on Chinese social media since Tuesday showed what appeared to be Chengdu Aircraft Corporation’s sixth-generation fighter, bearing a tailless and three-engine design, conducting a test flight.\nUnofficially referred to as the...",
        "source": "smcp",
        "date": "2025-11-02T23:00:17+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3331234/chinas-updated-6th-generation-fighter-jets-put-us-notice-air-supremacy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d83097bbfc0b530e4e7816bce362eda91ec400479c95b56d5e5ab466f52e7bab",
        "title": "AIIB confirms plan for Hong Kong office, with opening expected next year",
        "summary": "The Beijing-headquartered Asian Infrastructure Investment Bank (AIIB) has confirmed that it will open a hub office in Hong Kong – a move that will enhance its offshore financing capabilities and the city’s role as a global financial centre.\nPreparatory work is in the pipeline and progressing well, the Post has learned from the bank. A formal announcement is expected to be made by AIIB President Jin Liqun, who is scheduled to address Hong Kong FinTech Week on Monday.\nThe AIIB’s second office...",
        "source": "smcp",
        "date": "2025-11-02T23:00:13+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3331013/asian-infrastructure-investment-bank-confirms-plan-hong-kong-office-next-year?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "11e8ff4ff86e71b33bb6e0c6794d1e19579b35f10cd4cbf3f8dd65ad78cf1094",
        "title": "China’s atomic quantum computer reports first sales with orders worth US$5.6 million",
        "summary": "China’s first atomic quantum computer has passed a major commercial milestone, making its first sales to domestic and overseas customers, according to state media.\nHubei Daily, the official newspaper of Hubei province, reported on Friday that the first commercial Hanyuan-1 unit had been delivered to a subsidiary of telecoms provider China Mobile while Pakistan had also placed an order. The sales were valued at more than 40 million yuan (US$5.6 million).\nThe Hanyuan-1 was one of the few machines...",
        "source": "smcp",
        "date": "2025-11-02T22:00:50+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3331241/chinas-atomic-quantum-computer-reports-first-sales-orders-worth-us56-million?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9c48ac4f2d8f218da33eefa961fadd068bd61c3a045b10943066a31ccf9b1ae4",
        "title": "AI scientists fail to impress human experts at one-of-a-kind online conference",
        "summary": "As artificial intelligence (AI) becomes increasingly involved in scientific research, especially in the fierce competition between China and the US, a unique gathering of AI “scientists” has revealed that the technology still faces fundamental weaknesses.\nEach paper presented at last week’s Agents4Science 2025 conference listed large language models as primary authors and reviewers, while scholars from around the world shared how they used AI bots in scientific work and the challenges...",
        "source": "smcp",
        "date": "2025-11-02T21:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3331218/why-ai-scientists-fail-impress-human-experts-one-kind-online-conference?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "700bb7d1bd3da66519d2f27dfb1439f0f7796d20db7d753f4127f81fa4157797",
        "title": "China, US to revive military channels but more steps deemed essential for trust",
        "summary": "Beijing and Washington may be set to revive dormant military communication channels, but it is just a first step and the two sides are still some way from genuine trust, an observer has cautioned.\nThe assessment followed US Defence Secretary Pete Hegseth’s announcement on social media on Sunday that the two countries had “agreed that we should set up military-to-military channels to deconflict and de-escalate any problems that arise”.\nHegseth met his Chinese counterpart Dong Jun on the sidelines...",
        "source": "smcp",
        "date": "2025-11-02T20:00:11+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3331226/china-us-set-revive-military-channels-more-steps-needed-build-trust-expert-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "34997751c2f565ab359db063cf8ddafc18f625316ed208b648de5a0e87e65c58",
        "title": "Can China’s low-cost Feilong-300D suicide drone deter rivals and impress buyers?",
        "summary": "A Chinese military journal has revealed the surprising cost-effectiveness of China’s mass-produced suicide drones, positioning them as a major threat in modern warfare and an especially appealing acquisition for potential customers such as Pakistan.\nThe latest issue of Ordnance Industry Science Technology has revealed that the Feilong-300D reconnaissance and attack drone, which debuted at the Zhuhai air show last year, could be priced as low as US$10,000 per unit. The report provided the first...",
        "source": "smcp",
        "date": "2025-11-02T19:00:12+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3331052/low-cost-killer-can-chinas-feilong-300d-suicide-drone-deter-rivals-and-impress-buyers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "779172208145962a81c6ed14b5ae30694c68935ca530346e55561a5537c39db3",
        "title": "Beijing criticises new Japanese PM Takaichi for meeting Taiwanese official",
        "summary": "Beijing has protested to Tokyo over Japanese Prime Minister Sanae Takaichi’s contact with a former senior Taiwanese politician on the sidelines of the Apec summit in South Korea, describing the action as “egregious”.\nTakaichi posted photos of herself meeting Lin Hsin-i on social media on Friday and Saturday, referring to him as “senior adviser to the Presidential Office of Taiwan”.\nIn the comments she said she hoped the “practical cooperation between Japan and Taiwan will deepen”.\nIn a statement...",
        "source": "smcp",
        "date": "2025-11-02T16:01:07+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3331214/egregious-beijing-criticises-new-japanese-pm-takaichi-meeting-taiwanese-official?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f21a8b7c51b70d992c0c0fc35b835b347566c2ce40cd7768a3e0c621b596a0e3",
        "title": "Nexperia China vows business as usual after Dutch wafer supply halt",
        "summary": "Nexperia China moved to reassure customers that production will continue uninterrupted, saying it has secured new wafer suppliers and can meet client demand through to the end of the year and beyond.\nThe Chinese division of the semiconductor maker said it had “multiple contingency plans” in place, according to a bilingual statement published early Sunday.\nThe announcement underscored Nexperia China’s efforts to operate independently after Dutch authorities took control of its Netherlands parent...",
        "source": "smcp",
        "date": "2025-11-02T15:48:39+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3331212/nexperia-china-vows-business-usual-after-dutch-wafer-supply-halt?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "41f3891c58cda3375eaa6f7f989831b9e4d20f720b52e7cc72c234188b7ceb87",
        "title": "Will China-Iran ties help foster a ‘new Asia’? Envoy sees rebalance in region",
        "summary": "China and Iran should strengthen “wise and balanced” cooperation to jointly counter modern challenges and shape a new world against unilateralism and hegemony, according to Tehran’s top envoy in Beijing.\nDescribing ties with China as “decisive” to regional peace, Abdolreza Rahmani Fazli told a gathering of students and researchers that the strategic partnership between the two countries had gone beyond a bilateral level and could improve the roles of Asian countries in global...",
        "source": "smcp",
        "date": "2025-11-02T15:02:57+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3331063/iran-calls-close-ties-china-boosting-asias-role-global-decision-making?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "69c174a1ab5b5f14dddb5ab3e3883a632edbeef1feb7e300ae0d5cfd26877c17",
        "title": "‘New women but no new men’: feminist evolution unfinished in China, scholar says",
        "summary": "More than a century ago, the world of Chinese women was a private one. Bound by a rigid patriarchal order and Confucian codes of propriety, hierarchy and submission, they were confined to the inner chambers of the home to be virtuous wives, self-sacrificing mothers and dutiful daughters, while men ruled the outer world.\nThat began to change in the May Fourth era early in the 20th century, which marked a period of unprecedented intellectual and cultural awakening in modern China.\nReformers sought...",
        "source": "smcp",
        "date": "2025-11-02T13:01:55+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3331206/we-have-new-women-no-new-men-feminist-evolution-unfinished-china-scholar-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9b113c056696de79dca66731549446c11d931780e2883d178e3e039f826419e0",
        "title": "Reporter’s notebook: how China helps Vietnamese durian farmer reap a profit",
        "summary": "There’s a new gold rush in Southeast Asia, but the prize is not quite so shiny – think green and spiky.\nA retired police chief is chasing it. Someone else just built a flashy new house with the income earned from it. Cashew and coffee plantations are being flattened to make space. Sorting and processing sheds dot the roadsides.\nWe’re talking about Vietnam’s production of durians for China’s voracious consumer market – and the risks that come with it.\nTo get a closer look, take a road trip with...",
        "source": "smcp",
        "date": "2025-11-02T12:00:11+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3331088/reporters-notebook-how-china-helps-vietnamese-durian-farmer-earn-us30000-hectare?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5a48ee8850ecc6295380a0459c61d8ff36559b8faf3df3b6a259705d9b084f46",
        "title": "China will find its own modernisation path, not on US terms",
        "summary": "Much to the relief of markets, US President Donald Trump and Chinese President Xi Jinping finally met on the sidelines of the Asia-Pacific Economic Cooperation summit in South Korea. The friendly meeting indicates both sides prefer a mode of “controlled” confrontation.\nThe bilateral relationship remains confrontational, nonetheless. Some give and take on trade certainly helps to de-escalate tensions, but China has no illusions about the US’ fundamental hostility.\nTrump prides himself on his...",
        "source": "smcp",
        "date": "2025-11-02T10:30:10+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3330915/china-will-find-its-own-modernisation-path-not-us-terms?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "61dd4f08ca774e3934dfae86d9b48726a565828b686f7ec7c65fb1f627e5fc67",
        "title": "Alibaba boosts instant commerce drive with US$281 million convenience store plan",
        "summary": "Alibaba Group Holding on Friday unveiled a 2 billion yuan (US$281 million) investment as part of a programme that will see a network of Taobao-branded convenience stores across China support the operations of the firm’s instant commerce and on-demand delivery business.\nRather than establishing Taobao Shangou’s own bricks-and-mortar shops, the programme would primarily provide existing convenience stores with a tech facelift, leveraging Alibaba’s digital infrastructure, according to Hu Qiugen,...",
        "source": "smcp",
        "date": "2025-11-02T10:00:18+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3331175/alibaba-expands-instant-commerce-efforts-us281-million-taobao-convenience-store-push?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6faf146970dc58747336ac1bea90f7aec0cf7b65d739a44e08771cd0869cb233",
        "title": "How did Chen-ning Yang miss out on a second Nobel Prize in physics?",
        "summary": "Since the Nobel Prize began recognising exceptional achievements in science, literature and peace in 1901, only five scientists from Europe and the United States have been double recipients of this prestigious award.\nCould a Chinese scientist have joined their ranks?\nChen-ning Yang, who died in October aged 103, shared the Nobel for physics with Tsung-Dao Lee, nearly seven decades ago.\nYang’s long-time friend Chen Fong-ching, an honorary professor at the physics department of the Chinese...",
        "source": "smcp",
        "date": "2025-11-02T07:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330856/how-did-chen-ning-yang-miss-out-second-nobel-prize-physics?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a47d440d898456d9a3e6989222a3fe9db7a1fdf3b68bd6bd2611361d564b7df7",
        "title": "To survive the AI age, humans must hold on to our humanity",
        "summary": "The adoption of artificial intelligence (AI) as a practical tool is far outweighed by overinflated hype around it. The trending topic of AI is being driven by pundits with seemingly minute-by-minute hot takes, advice and products to sell.\nHowever, as the AI bandwagon picks up pace, there is an urgent need for a more thoughtful, independent conversation about preparing for a new reality.\nThe Microsoft/LinkedIn 2024 Annual Work Trend Index trumpets aggressive conclusions such as “Employees want AI...",
        "source": "smcp",
        "date": "2025-11-02T06:30:09+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3331016/survive-ai-age-humans-must-hold-our-humanity?utm_source=rss_feed",
        "reportUrl": ""
    }
]