[
    {
        "id": "ed2ea8669228f193850d3fa1f347372e6fc5006e5dd5475a11cdde14350571b5",
        "title": "Why weak links in China’s unrivalled supply chains may not exist in 5 years",
        "summary": "As China drafts its 15th five-year plan – the next entry in a line of expansive blueprints that have set the tone for the country’s development over more than seven decades – we examine how these documents inform and reflect high-level policy priorities, what to expect in the coming iteration and how fine-tuning supply chains would work to China’s advantage.\nFor more stories in this ongoing series, click here.\nOn paper, when Apple unveiled its latest flagship smartphone earlier this month, all...",
        "source": "smcp",
        "date": "2025-09-26T07:00:10+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3326808/chinas-unrivalled-supply-chains-still-have-weak-links-why-5-years-could-fix-them?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7e4600fa059b964eddb736a0a4604bd7cedceb8e9d61f1a614357e352cc5e0f4",
        "title": "Critics are missing the big picture on China’s economic transition",
        "summary": "As China transitions from the 14th to the 15th five-year plan, its economic trajectory is once again under scrutiny. External commentary often focuses on the short-term headwinds from a cooling property market and commensurately lowered growth, but these challenges obscure a more important story.\nBeneath the surface, China has a vibrant backbone made strong by the synergistic effects of infrastructure, human capital, technology and an unparalleled commitment to a green transition. These...",
        "source": "smcp",
        "date": "2025-09-26T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3326515/critics-are-missing-big-picture-chinas-economic-transition?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cbe35312d4042de1e630b3c0a35bc7d124cea054f178af9c1937922c0c22c506",
        "title": "Trump signs order saying TikTok sale meets US requirements",
        "summary": "US President Donald Trump on Thursday declared that a deal for TikTok satisfied the requirements of the US’ sale-or-ban law for the Chinese-owned short-video app, punctuating months of deliberations and years of angst in Washington over the app’s security implications.\n“I have determined that the proposed divestiture would allow the millions of Americans who enjoy TikTok every day to continue using it while also protecting national security,” Trump wrote in an executive order issued on...",
        "source": "smcp",
        "date": "2025-09-26T06:04:16+09:00",
        "url": "https://www.scmp.com/news/china/article/3326902/trump-signs-order-saying-tiktok-sale-meets-us-requirements?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "290eb1242b012c613a0ede1a9c7e9a75c32a1726c51e41967f3a0d4ddfc38c6d",
        "title": "China’s Li Qiang urges US business leaders to help improve trade relations",
        "summary": "Chinese Premier Li Qiang met with US business, academic and civic leaders on Thursday in New York, urging them to use their influence to help improve troubled relations between the two economic giants.\nSpeaking on the sidelines of the UN General Assembly at a private meeting, Li said bilateral ties needed to be actively fostered.\nTheir “steady development requires our two governments to work in the same direction,” said Li, addressing representatives from the National Committee on US-China...",
        "source": "smcp",
        "date": "2025-09-26T04:51:42+09:00",
        "url": "https://www.scmp.com/news/china/article/3326898/li-qiang-urges-us-business-leaders-help-ease-troubled-trade-relations?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d30c2a7586a4088a8902703b49640d16d8442d76c0edc3e941be208316ad4c48",
        "title": "Trump administration ties Argentina support to rollback of China credit line",
        "summary": "The Trump administration pressed Argentina on Wednesday to dismantle its currency swap arrangement with China, tying future financial support to President Javier Milei’s willingness to distance his government from Beijing during a week of high-stakes diplomacy at the United Nations General Assembly.\nThe demand, first reported by the local newspaper Clarin and confirmed by the Post on Thursday, was delivered in meetings between the two delegations in New York, where senior US officials made clear...",
        "source": "smcp",
        "date": "2025-09-26T02:42:03+09:00",
        "url": "https://www.scmp.com/news/china/article/3326895/trump-administration-ties-argentina-support-rollback-china-credit-line?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "497db8c4a88866f844583895844a91feb338613d89db6eb13adcd13401e99d8d",
        "title": "From Intel to lithium, Trump borrows Beijing’s industry playbook in US-China race",
        "summary": "From funding Intel to eyeing a potential stake in Lithium Americas, the United States is increasingly wielding the government’s “visible hand” in its once-celebrated free market – a strategy long associated with China.\nAnalysts said Washington’s recent embrace of industrial policy – though limited to certain strategic sectors, such as semiconductors and critical minerals – reflects growing concern over the vulnerability of global supply chains amid rising US-China competition.\n“I believe the US...",
        "source": "smcp",
        "date": "2025-09-25T23:00:10+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3326869/intel-lithium-trump-borrows-beijings-industrial-playbook-us-china-race?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9a5d8fbab890efcbd5323916814876db91664fdbc0e3440da6b2a151c0aaa79b",
        "title": "China sanctions 6 US firms, Guangdong’s Ragasa recovery: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Southern China cleans up after lashing from Super Typhoon Ragasa\n\nRagasa made landfall at Yangjiang, in western Guangdong, at around 5pm on Wednesday, bringing heavy rain and strong winds that caused flooding and disrupted transport in cities across the province. On Thursday, provincial officials said damage assessments were continuing and the priority was...",
        "source": "smcp",
        "date": "2025-09-25T22:15:09+09:00",
        "url": "https://www.scmp.com/news/china/article/3326880/guangdong-tackles-ragasa-damage-china-sanctions-6-us-firms-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7d9ceef2c7d12d70430eceef72a6472c40ab03d5dca2227d4178594299a4f65c",
        "title": "Xiaomi unveils 17-series smartphones, ramps up efforts in premium handset market",
        "summary": "Xiaomi on Thursday launched its new 17-series smartphones, about two weeks after Apple introduced its iPhone 17 models, as the Beijing-based company ramped up its efforts in the premium handset market.\nThe models unveiled at an event in Beijing were the standard Xiaomi 17 and flagship models, the Xiaomi 17 Pro and Pro Max – all of which run Qualcomm’s Snapdragon 8 Elite Gen 5 processor.\nAt the launch, Xiaomi founder, chairman and CEO Lei Jun touted the new 17-series models’ thin design and a new...",
        "source": "smcp",
        "date": "2025-09-25T22:06:41+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3326887/xiaomi-unveils-17-series-smartphones-ramps-efforts-premium-handset-market?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b23a41e76340f7c28d6f17765ea76a7f44d31d9946637da7203cf0de04b57f4e",
        "title": "Hydride ion battery breakthrough: Chinese team hits 6x capacity of lithium ion",
        "summary": "Chinese scientists have created a new type of battery that uses hydrogen ions to store and release energy, which could offer a safer alternative to conventional lithium-based batteries.\nThe rechargeable, room-temperature stable battery was made possible using a rare-earth-based battery electrolyte that harnesses hydride ions, or negatively charged hydrogen ions.\nExperimental data shows that the battery’s specific capacity – or the amount of electrical charge it can store per unit of mass or...",
        "source": "smcp",
        "date": "2025-09-25T22:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3326844/hydride-ion-battery-breakthrough-chinese-team-claims-6-times-capacity-lithium-ion?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e9e26a762c5d0f7c288186859045305610b27366144da74958aaafe6ea3be0aa",
        "title": "Taiwan races to find Ragasa victims as ‘utterly vile’ political firestorm erupts",
        "summary": "As rescuers raced to find people still missing after catastrophic floods in eastern Taiwan, attention shifted to responsibility and recrimination, turning the disaster zone into a partisan battleground.\nAt least 14 people have been confirmed dead after a landslide dam on the Mataian River burst during Super Typhoon Ragasa, submerging much of Guangfu township in Hualien county and destroying homes and farms.\nWhile emergency workers waded through knee-high mud in search of the 22 people still...",
        "source": "smcp",
        "date": "2025-09-25T21:38:44+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3326879/taiwan-political-firestorm-erupts-amid-race-find-ragasa-survivors-utterly-vile?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "15c29a1463f034a6cf8f22bc6fec398a6d718f26fb4e4ec34d542b70a9e3f595",
        "title": "For soybeans’ sake, cancel tariffs, China urges US as farmers grow desperate",
        "summary": "China has called on the United States to lift its unilateral tariff measures so the two sides can restore normal trade flows of soybeans – a focal point of ongoing negotiations as many US farmers grow increasingly desperate for a bilateral deal to secure exports.\nWashington could take decisive action to ease tensions and bring trading of the crop – a critically important export for America’s agricultural industry – back to normalcy, Ministry of Commerce spokesman He Yadong said during a press...",
        "source": "smcp",
        "date": "2025-09-25T20:09:47+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3326873/soybeans-sake-cancel-tariffs-china-urges-us-farmers-grow-desperate-harvest?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8ffad6a36b52ed8c21cc01477f32126291d0dea379aaccdc91eba72c4e715e3f",
        "title": "China’s ethnic affairs chief hails Xinjiang policies in Xi’s ‘new era’",
        "summary": "China’s top official overseeing ethnic and religious affairs has saluted Beijing’s approach to Xinjiang over the past decade, bookending a landmark trip by President Xi Jinping to the region to mark its founding.\nAddressing a major event in Urumqi on Thursday for the 70th anniversary of the Xinjiang Uygur autonomous region, Wang Huning said that over the decades, especially since “the new era” – the period after Xi took power in 2012 – people of all ethnic groups in Xinjiang had “continuously...",
        "source": "smcp",
        "date": "2025-09-25T20:01:57+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3326872/completely-correct-chinas-ethnic-affairs-chief-hails-xinjiang-policies-xis-new-era?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6d9d0a5bd54ec1f7a5d9f1f3a227bc2e628f822267e0e537f9e6b2780e4de9af",
        "title": "North Korean envoy due in China soon after Seoul sought help with Pyongyang",
        "summary": "North Korean Foreign Minister Choe Son-hui will begin a four-day visit to China on Saturday, days after South Korea urged China to help broker inter-Korean talks.\nChoe would meet Chinese Foreign Minister Wang Yi in Beijing, state news agency Xinhua and Pyongyang’s Korean Central News Agency (KCNA) said on Thursday.\nHer trip closely follows leader Kim Jong-un’s appearance at China’s Victory Day parade on September 3 and his meeting with President Xi Jinping this month – his first since 2019. Choe...",
        "source": "smcp",
        "date": "2025-09-25T19:42:59+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326867/days-after-seoul-seeks-chinas-help-pyongyang-north-korean-envoy-will-visit-beijing?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "eae793cf11dc13455552db49fb1cacc88904d2d1adce3aba041ef45b635df514",
        "title": "China’s banks face their ‘Japanification moment’, S&P report warns",
        "summary": "China’s banks are edging towards their “Japanification moment”, as years of yielding margins to support the economy have “left the system thin on profitability and more exposed to credit shocks”, according to a new report by S&amp;P Global Ratings.\nJapanification is characterised by a prolonged period of low growth and weak profitability, similar to the state of Japan's economy after the country's asset bubble burst in the early 1990s.\nWhile other banking systems had weathered ultra-low rates by...",
        "source": "smcp",
        "date": "2025-09-25T18:30:12+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3326841/chinas-banks-face-their-japanification-moment-sp-report-warns?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "edea7b18ab79ea72f6f87ae5c7a70a99b0442f459ec625334c64a5ce30ffcac7",
        "title": "Southern China cleans up after lashing from Super Typhoon Ragasa",
        "summary": "The southern Chinese province of Guangdong was mopping up on Thursday after a battering from Ragasa, a super typhoon that has since weakened into a tropical storm.\nRagasa made landfall at Yangjiang, in western Guangdong, at around 5pm on Wednesday, bringing heavy rain and strong winds that caused flooding and disrupted transport in cities across the province.\nDespite the storm’s record strength – it became the world’s strongest typhoon so far this year with sustained wind speeds of up to 265km/h...",
        "source": "smcp",
        "date": "2025-09-25T18:19:55+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3326846/southern-china-cleans-after-lashing-super-typhoon-ragasa?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "092ba24e0efaebb180e31b32900b3ad8aa459be8b5f8ee36bd4ef27984d6e085",
        "title": "Beijing vows to protect Chinese firms in US and boost bilateral ties amid talks",
        "summary": "China has pledged to safeguard the legitimate rights of its companies operating in the United States and work to stabilise economic and trade relations, as Beijing and Washington seek progress in ongoing trade negotiations.\nMinister of Commerce Wang Wentao convened a round-table meeting in New York on Tuesday with executives from more than a dozen Chinese companies operating in the US, joined by the head of the China General Chamber of Commerce in the US.\nWang warned that the global trade...",
        "source": "smcp",
        "date": "2025-09-25T18:05:02+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3326839/beijing-vows-protect-chinese-firms-us-boost-bilateral-ties-amid-negotiation-process?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4f0293c5e87f5dc0cdc9783f48b384ae0f311855d6fb8bee3a9f39bd6271f1cb",
        "title": "China sanctions 6 US firms as tensions boil over trade, TikTok sale",
        "summary": "China announced trade sanctions for six American companies on Thursday, another flare-up in its wide-ranging rivalry with the United States as the two countries prepare for a hotly anticipated meeting between their leaders.\nAccording to a statement from Beijing’s Ministry of Commerce, three US companies were added to the “unreliable entity list”, effectively banning them from trade and investment in China.\nThe affected enterprises – unmanned vehicle firm Saronic Technologies, satellite company...",
        "source": "smcp",
        "date": "2025-09-25T17:42:55+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3326830/beijing-hits-6-us-companies-trade-restrictions-over-taiwan-arms-sales?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "37679688e697043147604189cc20f0c668cec1de9e8a44b4e3cc2a5393f344c9",
        "title": "Boundary ‘legacy’ should not define ties, China envoy to India says",
        "summary": "Beijing and New Delhi should maintain a long-term strategic vision and make sure their border row does not define relations or hinder cooperation, China’s top envoy to India said at an event marking the 76th anniversary of the founding of the People’s Republic of China.\n“As two major ancient civilisations and developing countries, the relationship between China and India has long transcended the bilateral scope, bearing global and strategic significance,” ambassador Xu Feihong said on Wednesday,...",
        "source": "smcp",
        "date": "2025-09-25T17:33:30+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326818/china-india-boundary-legacy-should-not-define-relations-beijing-envoy-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b4e9644055c56519f053fa6e151b1ad3a00ad52e389a8186ece216f013d95b6c",
        "title": "Tributes for China’s ‘sponge city’ architect Yu Kongjian, dead in Brazil crash",
        "summary": "Tributes have flooded in from around the world to Yu Kongjian, the distinguished Chinese landscape architect and urbanist who died in a plane crash in Brazil’s Pantanal wetlands near the town of Aquidauana late on Tuesday.\nThree others on board the single-engine four-seater Cessna aircraft – Brazilian filmmakers Luiz Ferraz and Rubens Crispim Junior, as well as Marcelo Pereira de Barros, a pilot – were also killed.\nYu, 62, who was dean and professor at Peking University’s College of Architecture...",
        "source": "smcp",
        "date": "2025-09-25T15:44:04+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3326795/world-mourns-chinas-sponge-city-architect-yu-kongjian-lost-brazil-crash?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "093f981357ba13c479c9ebfd8048a84d9865e6875fc2481bd55e32fcf31aa60b",
        "title": "China’s state buyers buttress stock run with US$553 billion in holdings",
        "summary": "China’s state buyers have emerged as one of the biggest groups of investors in the nation’s US$12 trillion stock market, underscoring how government support underpins the market’s bull run.\nDubbed the national team and led by Central Huijin Investment, state buyers held a combined 3.94 trillion yuan (US$553.1 billion) of yuan-denominated stocks as of the end of June, surpassing the 3.07 trillion yuan held by foreign investors, according to data compiled by Huaxi Securities. State buyers’...",
        "source": "smcp",
        "date": "2025-09-25T15:00:36+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3326791/chinas-state-buyers-hold-us553-billion-stocks-buttressing-bull-run?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8530727dc352c60993dcd28b8205d5a7feda00c75e56a02fff88a712b74ba010",
        "title": "China vows faster global roll-out of BeiDou, its GPS rival, to expand ‘friends’",
        "summary": "Beijing has pledged to accelerate the global adoption of its home-grown BeiDou satellite navigation system, an alternative to the US-run Global Positioning System (GPS) that already dominates China’s domestic market.\nAt a summit on Wednesday, Vice-Premier Ding Xuexiang said the country was “enlarging its circle of international friends” after 31 years of developing the technology, which now accounts for over 70 per cent of the domestic consumer market share.\nBeiDou is increasingly integrated...",
        "source": "smcp",
        "date": "2025-09-25T15:00:11+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3326790/china-vows-speed-global-roll-out-beidou-its-home-grown-gps-rival?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "969d452063f2b02824ee853f7a8a8a85936cdf04462b2acf38f18445bef297b6",
        "title": "China’s Hengrui gets boost from fifth drug-licensing deal of year",
        "summary": "Shares in Jiangsu Hengrui Pharmaceuticals, China’s largest drug maker by market value, got a boost on Thursday after it announced its fifth licensing deal of the year, widening its access to the key emerging market of India.\nThe Shanghai-listed company, which went public in Hong Kong in May and raised HK$9.9 billion (US$1.26 billion), struck a deal with Glenmark Specialty of Mumbai-based Glenmark Pharmaceuticals, it said in a stock exchange filing late on Wednesday.\nThe agreement was part of an...",
        "source": "smcp",
        "date": "2025-09-25T13:48:31+09:00",
        "url": "https://www.scmp.com/business/article/3326777/chinas-hengrui-gets-boost-fifth-drug-licensing-deal-year-adds-india-partner?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d2882303c543f2abe26942e0f461158ada070f57f52f0bd3dcf8be32d154a4e6",
        "title": "Lula says Zelensky ‘more willing to talk’ as he revives Brazil-China peace plan",
        "summary": "Brazilian President Luiz Inácio Lula da Silva on Wednesday said he saw new signs that both Kyiv and Moscow may be edging towards negotiations to end the three-year war in Ukraine, reviving his joint peace push with China and urging the United Nations to take a central role.\nSpeaking to reporters at the UN headquarters after meeting Ukrainian President Volodymyr Zelensky, Lula said he believed both sides now understood the limits of their battlefield ambitions.\n“I felt Zelensky was much more...",
        "source": "smcp",
        "date": "2025-09-25T13:00:10+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326753/lula-says-zelensky-more-willing-talk-he-revives-brazil-china-peace-plan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "12275467522a1f4e3ca479615d6c34aa10f366a9fb7e95505a96df1054e695c5",
        "title": "Chinese solar panels rewire Africa for the future at record pace as costs fall",
        "summary": "African solar energy use is surging, with Chinese-made panels a common sight across the continent, on rooftops and in the massive renewable energy plants being built in countries such as Algeria and South Africa by companies from China.\nAn Oxford Economics study released on Monday showed the continent welcomed a record 9,516 megawatts worth of Chinese-made solar panels in the first seven months of this year, from just 6,625MW in the same period last year.\nThe trend reflects how Africa is...",
        "source": "smcp",
        "date": "2025-09-25T11:00:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326649/chinese-solar-panels-rewire-africa-future-record-pace-costs-fall?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "011c6dc74ebf286cb51c97a4757b12fd5a5b19fdb96250e11cc9139188ed0019",
        "title": "China announces plan to cut its greenhouse emissions by 7-10%",
        "summary": "China, currently the world’s largest emitter of greenhouse gases, has announced it aims to cut its emissions by 7 to 10 per cent by 2035, a cautious target analysts said left room for flexibility on future economic policy.\nIn a video address to United Nations climate talks on Wednesday – held during the annual UN General Assembly meeting – President Xi Jinping told his fellow leaders that China would finally reduce its emissions.\n“Green and low-carbon energy and development transition are the...",
        "source": "smcp",
        "date": "2025-09-25T08:15:46+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326747/china-pledges-cut-its-climate-emissions-7-10?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "31482ed588eab2e9224801fb5eb56d684f306767a0405756ec907dee01a24fbd",
        "title": "US reaffirms India as China counterweight despite trade rifts, Pakistan concerns",
        "summary": "India remains a democratic counterweight to China in the Indo-Pacific region, a senior US State Department official said on Wednesday, dismissing any suggestion that sharp bilateral disputes over trade had fundamentally changed that position for US President Donald Trump’s administration.\n“Absolutely still see India as a critical partner in the Indo-Pacific,” the official said, suggesting India is the “indo” in Indo-Pacific and adding that ties with New Delhi remain strong.\nThe official noted...",
        "source": "smcp",
        "date": "2025-09-25T07:24:28+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326745/us-reaffirms-india-counterweight-china-despite-trade-rifts-pakistan-concerns?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3dd66fdfb30303f7d647abe95cb1f71d058c3c84b4bc6db3d38a17e2c217bcf5",
        "title": "Can China’s next 5-year plan restore consumption confidence?",
        "summary": "As China drafts its 15th five-year plan – the next entry in a line of expansive blueprints that have set the tone for the country’s development over more than seven decades – we examine how these documents inform and reflect high-level policy priorities, what to expect in the coming iteration and whether it will expand on existing initiatives to boost domestic consumption.\nFor more stories in this ongoing series, click here.\nFive years ago, Joe Zhang was a high-flying analyst at a Beijing-based...",
        "source": "smcp",
        "date": "2025-09-25T07:00:42+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3326644/eating-old-savings-can-chinas-15th-5-year-plan-be-panacea-spending-woes?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2728a7abe143e77c7e1d2a668719027b25525c825d424ea1af7029f56eed983b",
        "title": "What China seeks to achieve with the Global Governance Initiative",
        "summary": "Eighty years ago, the people of the world won a great victory in the war against fascism. In its wake, the United Nations was born, to “save succeeding generations from the scourge of war, which twice in our lifetime has brought untold sorrow to mankind”, opening a new chapter in global governance.\nToday, though the historical trends of peace, development, cooperation and mutual benefit remain unchanged, a Cold War mentality, hegemonism and protectionism continue to haunt the world. With new...",
        "source": "smcp",
        "date": "2025-09-25T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3326404/what-china-seeks-achieve-global-governance-initiative?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "21891ab94849e8426e272201686456d0a99eb860bf4b865c3e43d47d94b0a394",
        "title": "Von der Leyen softens tone as EU seeks China’s help on Ukraine war, climate",
        "summary": "Despite frictions on trade and geopolitics that hang over their bilateral ties, leaders from the European Union and China vowed to work together to tackle global challenges on Wednesday, a day after US President Donald Trump ridiculed the “green scam” of climate change.\nEurope wants to work more with China on climate and biodiversity, even as it called on Beijing to help “stop the killing in Ukraine”, said European Commission President Ursula von der Leyen following a meeting with Chinese...",
        "source": "smcp",
        "date": "2025-09-25T03:48:55+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326741/von-der-leyen-softens-tone-eu-seeks-chinas-help-russia-and-climate?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "39d331c74008f8308bc3c94b92eec7da9ace05bf548c4146e41c3ae6c877369b",
        "title": "India and China vie for Global South leadership at UN gatherings",
        "summary": "India and China, recently seen moving towards rapprochement after years of strained ties, held separate meetings with Global South countries on the sidelines of the United Nations General Assembly in New York this week, highlighting a quiet rivalry for leadership of the developing world.\nThe world’s two most-populous countries had been expected to present a united front as global trade and multilateralism face increasing headwinds under US President Donald Trump’s second term. Instead, their...",
        "source": "smcp",
        "date": "2025-09-25T02:11:23+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326737/india-and-china-vie-global-south-leadership-un-gatherings?utm_source=rss_feed",
        "reportUrl": ""
    }
]