[
    {
        "id": "807972a77fb83fb78557f099e0204e9bfaa44cb5b83ce7ed408395b927e70fd7",
        "title": "Young Chinese fans fear losing access to Japanese culture amid diplomatic row",
        "summary": "The Japanese comedy Cells at Work! was expected to be released in Chinese cinemas on Saturday.\nThe live-action movie is adapted from a popular manga series and follows the slapstick adventures of cells inside the body of a Japanese teenager.\nHowever, the movie’s launch date in China has been pushed back. Also postponed is the release of Crayon Shinchan the Movie: Super Hot! The Spicy Kasukabe Dancers, an animated film that was scheduled to hit Chinese screens in early December.\nThe delays come...",
        "source": "smcp",
        "date": "2025-11-20T09:04:21+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333439/young-chinese-fans-fear-losing-access-japanese-pop-culture-amid-diplomatic-row?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "abde28c2a5460c85bbba509dcd11867db32bfbaa5936fb0ebb0233d62c2f1323",
        "title": "China’s clinical trial capacity matches US, attracts more global pharma firms",
        "summary": "China’s growing pipeline of novel drug candidates is expected to draw increased attention from global pharmaceutical companies and investors scouting for licensing opportunities, as the country’s clinical trial capacity has expanded to match those in the US.\nThat assessment was made by Shanghai-based Helen Chen, Greater China managing partner at L.E.K. Consulting, one of the most respected analysts in the mainland’s life sciences industry.\n“There is increased interest from multinational...",
        "source": "smcp",
        "date": "2025-11-20T08:30:16+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3333438/chinas-clinical-trial-capacity-matches-us-attracts-more-global-pharma-firms-investors?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4884cf1a5b71a0ade09268b73759fa129d1592e94e740e6cc1f8669ad2db63fe",
        "title": "US lawmakers press for new tactics to challenge China’s grip on rare earths",
        "summary": "US lawmakers on Wednesday called for a change in Washington’s strategy to evade China’s chokehold on rare earth mineral supplies, arguing that new approaches are needed in parallel with President Donald Trump’s efforts to speed up domestic production.\nProposals to dismantle the chokepoint – including new technologies and development of components that do not require the critical minerals as inputs – were presented during a hearing of the US House Select Committee on China.\nThe suggestions came...",
        "source": "smcp",
        "date": "2025-11-20T07:33:24+09:00",
        "url": "https://www.scmp.com/news/us/article/3333462/us-lawmakers-press-new-tactics-challenge-chinas-grip-rare-earths?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f59875113f18975af75a311d0a34ad4decdbbb0861f344a7239afa96d3b39fdd",
        "title": "China’s soybean revolution: how it reshaped trade and tested food security",
        "summary": "Soybeans are more than just a crop – they have become a litmus test of Beijing’s evolving food security strategy and sit at the heart of the US-China trade war.\nAs a crucial source of animal feed and cooking oil, soybeans have remained a flashpoint throughout the ebbs and flows of the two nations’ trade disputes, from the tariff war during US President Donald Trump’s first term to the current one.\nLess well known is China’s transformation from soybean exporter to the world’s leading importer....",
        "source": "smcp",
        "date": "2025-11-20T07:00:10+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3333382/chinas-soybean-revolution-change-rewrote-global-trade-and-tested-food-security?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "37a3fe284c7114a2a4d518386f6d748e8c57a182a2af6272f4294c8348951362",
        "title": "Top Democrat demands US probe into Chinese firms potentially supplying Nexperia",
        "summary": "A senior US Democrat is urging the Commerce Department to investigate four Chinese semiconductor firms potentially tied to Dutch chipmaker Nexperia, warning they could threaten the safety and reliability of components used in cars across the US and its allies.\nThe request marks the latest twist in the turmoil surrounding the Chinese-owned firm, which has become a flashpoint in broader disputes involving China, Europe, and the US, following months of internal conflicts, regulatory intervention...",
        "source": "smcp",
        "date": "2025-11-20T01:27:17+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3333456/top-democrat-demands-us-probe-4-chinese-firms-potentially-supplying-nexperia?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "da31e23213166de4ede17e2aa0215a2116d2bb1c14fc3ef76e4e89abd545bb40",
        "title": "China overtakes US in medical research in science power shift: top publisher",
        "summary": "The days when Silicon Valley and leading American universities led the way in shaping the future of science may be ending, as China overtakes the United States not only in research output but in some cutting-edge fields, according to one of the world’s leading academic publishers.\n“When I looked into data from Digital Science’s Dimensions database, I can see a widening gap between China and the United States in research output.\n“By 2024, Chinese researchers had published 1.1 million articles,...",
        "source": "smcp",
        "date": "2025-11-19T23:00:11+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3333395/china-overtakes-us-medical-research-amid-science-balance-power-shift-top-publisher?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5d9f26c5e0e3a165ebdab4750df89ddfd309aea7d68997beccc64ceeb2eddd93",
        "title": "China-Japan feud, EU to probe Chinese lawnmowers: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Beijing warns Tokyo of ‘further action’ if Takaichi doesn’t budge on Taiwan stand\nChina will take “further measures” against Japan unless its prime minister retracts her controversial comments on Taiwan, the foreign ministry said as Beijing reportedly reimposed a ban on Japanese seafood imports.\n2. Dutch government suspends invoking Goods Availability Act...",
        "source": "smcp",
        "date": "2025-11-19T22:15:08+09:00",
        "url": "https://www.scmp.com/news/china/article/3333432/china-japan-feud-escalates-dutch-goodwill-measure-nexperia-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6b3954107b0535ac2cf7ce498fe5c9df7cef332f36806854b3a7d6cf0b23e525",
        "title": "UBTech’s 2026 humanoid robots production to grow 10-fold to 5,000",
        "summary": "UBTech Robotics says it plans to expand its assembly of humanoid robots 10-fold next year to as many as 5,000 units and double that to 10,000 in 2027, as the scale economics of China’s advanced manufacturing prowess shaves a fifth off production costs every year.\nThe Shenzhen-based company was on track to deliver 500 humanoid robots for industrial use by the end of this year, scaling up since delivering the first 10 droids last year, UBTech’s chief branding officer Michael Tam said during an...",
        "source": "smcp",
        "date": "2025-11-19T22:00:17+09:00",
        "url": "https://www.scmp.com/tech/article/3333427/ubtechs-2026-humanoid-robot-output-grow-10-fold-costs-plunge-scale-economics?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c0fb7895ccbf3340c8d8b2dca18cbc300d616641bd35e895fbca41babd19f4ca",
        "title": "China’s US Treasury holdings edge up as long-term sell-off continues",
        "summary": "China slightly increased its US Treasury holdings in August and September – though the uptick did little to offset an overall downward trend – as persistent worries over US debt sustainability and the Federal Reserve’s independence deepened doubts about the safety of assets backed by the US dollar.\nThe country’s stockpile rose to US$701 billion in August, up from July’s multi-year low of US$696.9 billion, but it again trimmed the total to US$700.5 billion in September, according to data from the...",
        "source": "smcp",
        "date": "2025-11-19T22:00:10+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3333405/chinas-us-treasury-holdings-edge-long-term-sell-continues?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "350bc853e79b298c9b80e569d2173c6306d77bacdfdc5aa28d444c6c19b49b73",
        "title": "China’s euro bond sale sees record demand, signals strong investor confidence",
        "summary": "China’s €4 billion (US$4.6 billion) euro-denominated bond sale has drawn record demand, highlighting robust investor confidence in its sovereign assets amid a global shift towards diversification.\nInternational and regional investors placed €100.1 billion in orders for the offering – 25 times the fundraising target – China’s Ministry of Finance said in a statement on Wednesday. The seven-year tranche, issued alongside an equal-sized four-year tranche, attracted demand 26.5 times its allocation,...",
        "source": "smcp",
        "date": "2025-11-19T21:53:25+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3333441/chinas-euro-bond-sale-sees-record-demand-signals-strong-investor-confidence?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "61f54f064562ee16528a3c7b249ad8a265a97ca0e806b0c00a978dfeb2121760",
        "title": "US-China rivalry is moving beyond guns and growth",
        "summary": "The US-China rivalry has long been cast as a contest between two superpowers, with one rising and the other defending its primacy. This competition has been largely measured in GDP growth, military spending and the number of aircraft carriers and alliances each side could marshal. The central criteria is “who holds power” or “who has more power”.\nYet today, the rivalry can no longer be understood by these conventional metrics. Rather, it is taking place within a complex web of technology,...",
        "source": "smcp",
        "date": "2025-11-19T21:32:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3333143/us-china-rivalry-moving-beyond-guns-and-growth?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "054c89afd5b8842ea13dd9fab4a737a94ea99c5761466f7d92a9f09b1562a7c9",
        "title": "Chinese crypto founders shelve US$500 million ether digital asset treasury plan",
        "summary": "Some of China’s cryptocurrency heavyweights have called off a US$500 million ether digital asset treasury (DAT) project, as the broader crypto market remains in a slump, according to people familiar with the matter.\nThe project was initiated earlier this year by Huobi founder Leon Li Lin, HashKey Group chairman and CEO Xiao Feng, Meitu co-founder Mike Cai Wensheng and Fenbushi Capital founder Bo Shen, who aimed to raise US$500 million to launch a DAT firm that would invest in the world’s...",
        "source": "smcp",
        "date": "2025-11-19T21:00:10+09:00",
        "url": "https://www.scmp.com/tech/blockchain/article/3333429/chinese-crypto-founders-shelve-us500-million-ether-digital-asset-treasury-project?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6c1fe33ed8e3cc0d7ff10fb3915cebf99f01886305ba7e6d8a53117b154b5d36",
        "title": "Lightning start: China’s Juno ‘ghost particle’ detector delivers record results",
        "summary": "The world’s largest “ghost particle” detector, located in southern China’s Guangdong province, has shattered expectations in just two months.\nInitial results from the vast new Jiangmen Underground Neutrino Observatory (Juno) have shown a record level of precision, surpassing decades of cumulative data from other global experiments on neutrinos.\nThe immediate success has confirmed that the detector is ready to tackle fundamental questions, potentially uncovering new laws of physics and solving...",
        "source": "smcp",
        "date": "2025-11-19T20:54:44+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3333431/chinas-juno-ghost-particle-detector-delivers-record-results-opening-new-era-physics?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f04d630d24de8a17e7f468614f222755ba507b1db8f96a6f1af58e285c652005",
        "title": "Chinese SOEs ask workers to cancel their Japan holidays amid diplomatic row",
        "summary": "Amid a heated diplomatic row between Beijing and Tokyo which has shown no signs of cooling off, several employees of China’s state-owned enterprises have been advised to scrap their immediate travel plans to Japan, they told the Post on condition of anonymity.\nOne of them, an engineer at a state-owned firm in the central Chinese city of Wuhan, received an unexpected phone call on Tuesday. It was his company’s administrative office, urging him to cancel his coming holiday.\nLike employees at many...",
        "source": "smcp",
        "date": "2025-11-19T20:00:11+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3333417/chinese-soes-ask-workers-cancel-their-japan-holidays-amid-diplomatic-row?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0528839bb712e6da65d77e8df9822daff7efc8438bf824463dd0fb577223bb84",
        "title": "China solves Japanese spy cases, vows counter-intelligence crackdown",
        "summary": "China’s top anti-espionage agency said it had solved several infiltration and espionage cases involving Japanese spy agencies in recent years and vowed to step up counter-intelligence work amid serious diplomatic tensions between Beijing and Tokyo.\nOn Wednesday, the Ministry of State Security said in a social media article that it had “cracked a series of espionage cases involving Japanese intelligence agencies infiltrating and stealing secrets from China”.\nIt added that this had “effectively...",
        "source": "smcp",
        "date": "2025-11-19T19:21:04+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3333425/china-solves-japanese-spy-cases-vows-counter-intelligence-crackdown?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "833ec06284272dcad1b68e3277b1746215960edf2910ed224ca48f567ca05413",
        "title": "Alibaba founder Jack Ma visits Ant Group as fintech giant ramps up AI efforts",
        "summary": "Alibaba Group Holding founder Jack Ma on Tuesday made a low-key visit to the Hangzhou campus of Ant Group that coincided with the Chinese fintech giant’s launch of LingGuang, a next-generation multimodal artificial intelligence assistant.\nMa, who had relinquished his control of the fintech company and resigned from all corporate roles at Alibaba, was seen accompanied by Ant Group chairman Eric Jing Xiandong and CEO Cyril Han Xinyi during his tour of the campus. Ant Group is an affiliate of...",
        "source": "smcp",
        "date": "2025-11-19T19:00:50+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3333403/alibaba-founder-jack-ma-visits-ant-group-campus-fintech-giant-ramps-ai-efforts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3892593cf149536fde3f07d8643a26c201a3bf498906d4b33e0528d74a30be71",
        "title": "Top NZ diplomat visiting China for US$337 million ferries contract",
        "summary": "New Zealand’s top diplomat is set to visit China next week as a state‑owned Chinese shipbuilder embarks on a multimillion-dollar interisland ferry upgrade for the Pacific nation.\nNew Zealand Foreign Minister Winston Peters confirmed his trip on Wednesday, a month after Wellington said it had sealed a deal to buy two new ferries from Guangzhou Shipyard International to connect the country’s two main islands.\nPeters said he would travel to Guangzhou to “acknowledge” the NZ$596 million (US$337.2...",
        "source": "smcp",
        "date": "2025-11-19T18:26:40+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333412/top-new-zealand-diplomat-visiting-china-next-week-mark-us337-million-ferries-contract?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "eda36ed262246c519bf7e83041e299785e31426c2579ecf16fb46622dcc6b334",
        "title": "‘Show of goodwill’: Netherlands suspends Cold War-era act tied to Nexperia crisis",
        "summary": "The Dutch government has suspended its invocation of the Goods Availability Act, a Cold War-era law it used to effectively seize the European operations of Chinese-owned chipmaker Nexperia.\nIn a statement on Wednesday, the Dutch economy minister said the government had held “constructive meetings with the Chinese authorities” in recent days and he was “positive about the measures already taken by the Chinese authorities to ensure the supply of chips to Europe and the rest of the world”.\n“We see...",
        "source": "smcp",
        "date": "2025-11-19T18:14:20+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333407/show-goodwill-dutch-government-suspends-invoking-goods-availability-act-nexperia?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2bd4bbc08022bfe3d763fd801d9d3ef00cc19b7f66692949675677434dae7c40",
        "title": "Hong Kong, Singapore, Dubai: the rise of the ‘family office triangle’",
        "summary": "Family offices in Hong Kong, Singapore and Dubai are redrawing the global map of private capital. Each hub combines favourable tax and regulatory regimes with strong local networks of banks, advisers and deal makers. Together, they now rival Western centres in deploying private equity across the Global South.\nDrawing inspiration from family offices in the United States – where private equity has represented a major share of assets – these Asian hubs are scaling rapidly, positioning themselves as...",
        "source": "smcp",
        "date": "2025-11-19T17:30:09+09:00",
        "url": "https://www.scmp.com/opinion/hong-kong-opinion/article/3333112/hong-kong-singapore-dubai-rise-family-office-triangle?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7d2747b4cee1a494dcc7fe0b37d2ee6429c55ebcc71fb1f9d73207742fc2daf9",
        "title": "EU set to probe Chinese robotic lawnmowers in escalating trade dispute: sources",
        "summary": "The European Commission has launched an anti-dumping investigation into Chinese robotic lawnmowers, confirming an exclusive Post report, while also marking another potential escalation of China-EU trade tensions.\nChina has been selling more robotic lawnmowers to Europe, and at higher prices.\nMore than 40 per cent of China’s robotic-lawnmower exports, by volume, are shipped to the 27-member bloc, according to Chinese customs data. And in the first nine months of 2025, the export volume increased...",
        "source": "smcp",
        "date": "2025-11-19T16:32:27+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3333385/china-eu-trade-dispute-touch-grass-robotic-lawnmower-probe-tipped-amid-tensions?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3226ddde04808bf8122d12d4cd17938ab5f8c641f8ec1d187b77484fe7b7036c",
        "title": "Stranded astronauts return, university ranking ridiculed: 7 science highlights",
        "summary": "We have put together stories from our coverage on science from the past two weeks to help you stay informed. If you would like to see more of our reporting, please consider subscribing.\n1. Mathematician Qian Hong, son of top scientific clan, leaves US for China\n\nA renowned mathematician who is also part of China’s Qian clan – a surname linked in the annals of Chinese scientific history to national pioneers in science and engineering – has become the latest US-based scientist to return to...",
        "source": "smcp",
        "date": "2025-11-19T16:30:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3333364/shenzhou-20-astronauts-return-home-qian-hong-leaves-us-china-7-science-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3e809cb4f3ceb11443041d585e835a10bdb5d7c97f1d09789d5a9cbf6feb1a82",
        "title": "Railway deal and a toxic spill to top agenda as Chinese premier visits Zambia",
        "summary": "Chinese Premier Li Qiang will arrive in the Zambian capital Lusaka on Wednesday, with a US$1.4 billion railway modernisation deal high on his agenda.\nBut Li could also face political fallout from a toxic spill at a copper mine in the country’s north. Two Chinese mining firms have been sued over the incident that has been described as an “ecological catastrophe” by farmers.\nIt will be the first visit to Zambia by a top Chinese leader since 2007, and Li’s first trip to sub-Saharan Africa. He will...",
        "source": "smcp",
        "date": "2025-11-19T16:00:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333373/railway-deal-and-toxic-spill-likely-top-agenda-chinese-premier-visits-zambia?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "34c3db3de8d534c15285dc697109d272b664b09ef4acc04761f684a8ebf1d97f",
        "title": "Drop in Chinese tourists could cost Japan US$9.59 billion: economist",
        "summary": "The Japanese economy could lose about 1.49 trillion yen (US$9.59 billion) over the next year if travellers from mainland China continue to avoid Japan over a row that has derailed the growth in arrivals seen earlier this year, an economist at the Tokyo-based Nomura Research Institute has projected.\nTakahide Kiuchi, the institute’s executive economist, made the calculation after Beijing told Chinese citizens last week to refrain from travelling to Japan following comments about Taiwan by new...",
        "source": "smcp",
        "date": "2025-11-19T15:17:41+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3333365/steep-drop-chinese-tourists-could-cost-japan-us959-billion-year-economist?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bfe65554c997a46f6f9fa55d078dd8c63123437beea37a2534f3c76308904d92",
        "title": "First Thai king to Beijing in 800 years greeted by Chinese astronauts in orbit",
        "summary": "The king and queen of Thailand have become the first visiting heads of state to greet Chinese astronauts in orbit, in an unprecedented moment for China’s tightly controlled human space flight programme.\nThe 73-year-old King Maha Vajiralongkorn – a trained military pilot and long-time aviation enthusiast – and Queen Suthida smiled and waved at the astronauts, who appeared via a large screen from the Tiangong, or “Heavenly Palace”, space station.\nThe encounter, which took place on Sunday at the...",
        "source": "smcp",
        "date": "2025-11-19T15:00:35+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3333360/astronauts-orbit-greet-first-thai-king-visit-china-mainland-800-years?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "027e9dba98b57138fe6ba6b74ea607f0133e3766f14f215ffcea974f46a67c2a",
        "title": "Japan is ‘unqualified’ for UN Security Council place, Chinese ambassador says",
        "summary": "China’s ambassador to the United Nations said on Tuesday that Japan was “totally unqualified” to become a permanent member of the Security Council – the latest salvo in a row about the new Japanese prime minister’s comments about Taiwan.\nFu Cong, China’s permanent representative to the UN, condemned Prime Minister Sanae Takaichi’s remarks as “highly dangerous” and “extremely mistaken”.\n“In light of Sanae Takaichi’s atrocious behaviour, how can the international community trust that Japan will...",
        "source": "smcp",
        "date": "2025-11-19T14:23:06+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333355/japan-unqualified-permanent-place-un-security-council-chinese-ambassador-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "254c1c0fbb7e2cf50f143405ce85182dca0312c529f64625c733ab642506d385",
        "title": "Beijing warns Tokyo of ‘further action’ if Takaichi doesn’t budge on Taiwan stand",
        "summary": "China will take “further measures” against Japan unless its prime minister retracts her controversial comments on Taiwan, the foreign ministry said as Beijing reportedly reimposed a ban on Japanese seafood imports.\nChinese foreign ministry spokeswoman Mao Ning said on Wednesday that Takaichi’s remarks had undermined the political foundation of China-Japan relations and China “has every reason to respond to such actions”.\n“The Chinese side will be forced to take severe and resolute...",
        "source": "smcp",
        "date": "2025-11-19T14:02:36+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333354/china-tells-tokyo-it-will-suspend-japanese-seafood-imports-kyodo-news?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "53f58ceffc613f09312f95de6a356e1a79fe79171d10c341747f2366b0346529",
        "title": "World first: AI tells humans how to build a high-speed rail tunnel in China",
        "summary": "In Wufeng Tujia autonomous county, Hubei province, the rugged beauty of central China masks the region’s long-standing isolation. Its steep terrain and dense forests have long hindered transport, stifling growth and keeping communities cut off both physically and economically.\nBut a new force is now reshaping the landscape – with dynamite, drilling rigs and lines of code.\nThe Yangcun Tunnel in Wufeng is part of a high-speed rail line designed to bring 350km/h (217mph) trains into one of China’s...",
        "source": "smcp",
        "date": "2025-11-19T13:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3332736/central-china-ai-telling-humans-how-build-high-speed-rail-tunnel?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3ef0cb9c791dcd8b52773cd5f81da6d7864be4ed2b2ab1c7584e5ed352f188ec",
        "title": "Chinese economist calls on Beijing to add consumption target to long-term goals",
        "summary": "China should add a quantitative target for consumption growth as part of its long-term modernisation goals to help sustain growth momentum as the country’s population declines, a prominent Chinese economist said.\n“In addition to setting a gross domestic product growth per capita target through 2035, we should also establish a target for the household final consumption rate – meaning the share of household consumption in GDP should be increased as well,” said Cai Fang, an academician at the...",
        "source": "smcp",
        "date": "2025-11-19T10:00:12+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3333285/chinese-economist-calls-beijing-add-consumption-target-long-term-goals?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "47948f256e98a8f2a4d1ee7d7f8fec5c0869baac1a807a9b75b9dc1bb097309a",
        "title": "Why are tensions between China and Japan running so high now?",
        "summary": "While failing to see eye to eye is hardly new to Beijing and Tokyo, Sino-Japanese relations have been especially strained this month and are at risk of worsening even further.\nThe trigger for the downturn was Japanese Prime Minister Sanae Takaichi’s comments to the Japanese parliament on November 7 that the use of force against Taiwan could be perceived as a “survival-threatening situation”, which would permit Tokyo to deploy the Japan Self-Defence Forces. She has refused to retract her...",
        "source": "smcp",
        "date": "2025-11-19T09:00:16+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333296/why-does-taiwan-issue-touch-nerve-between-beijing-and-tokyo?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c2ab6c6c19b9abfa501b8b6911afb1d5cd7d6d7f48b44aed90dc495547a600f7",
        "title": "Xpeng’s founder headlines SCMP Live’s 2025 Business Awards",
        "summary": "Xpeng’s CEO He Xiaopeng is among three corporate founders who have been shortlisted as finalists in the 2025 Business Awards organised by SCMP Live, in a reimagination of a series of accolades first introduced in 1990.\nA total of 43 nominations were received for the awards in six categories, honouring the most noteworthy business owner, corporate executive, company, small-and-medium-sized enterprise (SME), start-ups and the best globalised brand. A discretionary award honouring lifetime...",
        "source": "smcp",
        "date": "2025-11-19T08:30:08+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3333210/xpengs-founder-headlines-scmp-lives-2025-business-awards?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2f1179bacdda70daeff4ceca185ba912cf51949d0714f697332591e08a8178e1",
        "title": "China leveraged India-Pakistan conflict to test military edge: US panel",
        "summary": "China turned a brief but intense India-Pakistan conflict in May into a live testing ground for its advanced weaponry and intelligence systems, and then aggressively marketed those results to undercut Western arms sales, a US congressional panel said in its annual report on Tuesday.\n“Beijing opportunistically leveraged the conflict to test and advertise the sophistication of its weapons,” a new report from the bipartisan US-China Economic and Security Review Commission stated bluntly.\nIt...",
        "source": "smcp",
        "date": "2025-11-19T07:26:11+09:00",
        "url": "https://www.scmp.com/news/china/article/3333321/china-leveraged-india-pakistan-conflict-trial-and-tout-its-military-strengths-says-us-panel?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f9d59076f55a2c2a713c815e6f4726d51d33d794afcc694e2da434bfd3ac977b",
        "title": "Why US should adopt ‘Chinese approach’ in AI to avoid losing tech race: expert",
        "summary": "Limiting AI use in military applications and ensuring global AI governance could ease collaboration and dialogue between China and the US as they vie for influence over the transformative technology, according to experts at a forum in Hong Kong on Monday.\nTheir remarks came as artificial intelligence is being increasingly adopted in the defence sector, including for weapon-related functions. It raises serious ethical and accountability concerns, further elevates the US-China AI race to a...",
        "source": "smcp",
        "date": "2025-11-19T07:00:10+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333303/chinese-and-us-experts-agree-ai-use-defence-sector-must-be-restricted?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ce0dd0ea620be7ad99f2468504731490135b27a791bc9b8ed5bb4eb5651d9607",
        "title": "Takaichi’s Taiwan rhetoric is a strategic misjudgment",
        "summary": "Japanese Prime Minister Sanae Takaichi’s recent remarks suggesting that Japan could intervene militarily in the Taiwan Strait under the pretext of a “survival-threatening situation” represent a strategic pivot away from Japan’s post-war pacifist ethos.\nThese statements, explicitly condemned by Beijing as “blatant interference in China’s internal affairs”, transcend mere diplomatic indiscretion. They reflect a calculated alignment with containment strategies aimed at curtailing China’s...",
        "source": "smcp",
        "date": "2025-11-19T06:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3333048/taiwan-japans-takaichi-shouldnt-play-fire?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "083f8758433f85990750b1fa07780ba7d554f2f904ab6da61e90655b31b4d407",
        "title": "Brazil approves China’s naval visit while US research ship plans call nearby",
        "summary": "Brazil has cleared a Chinese navy hospital ship to dock in Rio de Janeiro in January, ending a months-long review that drew quiet pushback inside the country’s military, according to local media.\nThe approval, dated November 13 and published Tuesday in the government’s official gazette, allows the Ark Silk Road to remain in Rio from January 8 to January 15 next year. The 178 metre (584 feet) vessel operates under China’s People’s Liberation Army Navy.\nRecords show a United States ship will...",
        "source": "smcp",
        "date": "2025-11-19T06:00:19+09:00",
        "url": "https://www.scmp.com/news/china/article/3333320/brazil-oks-china-naval-visit-while-us-research-ship-plans-call-nearby?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2e6594bfe9fe6b61aab0b1eec5bd7946d1e09b64b5f3a530e43ccfca04dc068b",
        "title": "Bankruptcies, suicides: US farmers detail cost of trade tensions",
        "summary": "Randal Shelby planned carefully and waited years to ditch a career spent in hospitals and medical centres to chase a dream in which he traded antiseptic hallways full of sick patients for the great outdoors.\nHis new life started six years ago, after he secured about US$1.3 million in financing for a Case combine and other equipment, fertilisers, seed and labour needed to produce soybeans and rice, staples that enjoyed strong demand overseas, primarily from China.\nHigh fuel costs, rising interest...",
        "source": "smcp",
        "date": "2025-11-19T00:00:11+09:00",
        "url": "https://www.scmp.com/news/us/economy-trade-business/article/3333207/things-were-already-grim-us-farmers-then-china-tensions-worsened-again?utm_source=rss_feed",
        "reportUrl": ""
    }
]