[
    {
        "id": "223492bd6ecd8fd34ce3404f86a4cbd685c42535ac41448b13416794da895d01",
        "title": "China’s biotech hub Suzhou wants to become the next Boston. Can it succeed?",
        "summary": "Could a city best known for its classical gardens and ancient canals emerge as China’s answer to Boston – the global epicentre of biotechnology innovation?\nFive years ago, the eastern city of Suzhou set forth a bold vision: to transform itself into the “Pharma Valley of China” by 2030, benchmarking its ambitions directly against Greater Boston’s world-leading life sciences ecosystem.\nThe city in Jiangsu province, steeped in history and famous for its ancient water towns and picturesque gardens,...",
        "source": "smcp",
        "date": "2025-08-20T07:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3321794/chinas-biotech-hub-suzhou-thriving-can-it-become-next-boston?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "38c3d2dc327d895f28c7af22530049da4d83aaa92d2c8e57c5c9fde0a4d2369c",
        "title": "China is not inciting anti-Japan hatred. It is simply remembering",
        "summary": "This year, China marks the 80th anniversary of its victory in the War of Resistance against Japanese Aggression – part of the broader victory in the World Anti-Fascist War. Across the country, commemorative exhibitions, television documentaries and a wave of summer blockbuster films have been rolled out to mark the occasion.\nThese films, set in the dark days of the 1930s and 1940s, are not just historical dramas; they are cultural reminders. They show the destruction of war, the brutality of the...",
        "source": "smcp",
        "date": "2025-08-20T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3322220/chinas-wartime-message-can-sit-alongside-love-todays-japan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3bb514bffbc17d0aaf1dc09d0972b4d3fd034d4e4f817f9bd59af5ce0880f252",
        "title": "US sentences Chinese national to 8 years for smuggling arms to North Korea",
        "summary": "The US has sentenced a Chinese national to eight years in prison for illegally exporting firearms, ammunition, and other military items to North Korea via Hong Kong in return for US$2 million in payments from Pyongyang “for his efforts”, the Justice Department said on Tuesday.\nTaking advantage of lax US gun laws, Shenghua Wen, 42, purchased many of the weapons in Texas and drove them to California, where they were shipped out of the Port of Long Beach, according to court documents. At least one...",
        "source": "smcp",
        "date": "2025-08-20T06:24:14+09:00",
        "url": "https://www.scmp.com/news/us/article/3322431/us-sentences-chinese-national-eight-years-smuggling-arms-north-korea?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7d634dcaddd863c4bc29137ba7f4c28f5b63cde7e4a9aff7f2accf823bfe763d",
        "title": "Argentina registration by China’s BYD hints at local car production",
        "summary": "Chinese electric vehicle giant BYD registered a local unit as a car manufacturer, a possible hint that the world’s biggest EV maker could soon start producing vehicles in South America’s third-largest auto market.\nThe filing, registered with the country’s Justice Ministry, authorises BYD Auto Argentina SAU not only to import and sell cars but also to manufacture and maintain vehicles, batteries and auto parts. Essentially, the registration allows operations across the EV supply and service...",
        "source": "smcp",
        "date": "2025-08-20T05:43:18+09:00",
        "url": "https://www.scmp.com/news/china/article/3322430/argentina-registration-chinas-byd-hints-local-car-production?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "634a218698bf0753e8a9aab31b2825a8c1276285776abce2df41905a3f1f2892",
        "title": "US names 5 more Chinese industries for enforcement under Uygur labour law",
        "summary": "The US Department of Homeland Security (DHS) announced on Tuesday it is designating five new Chinese industry sectors, including copper, lithium and steel, for “high priority” enforcement under a human rights law restricting imports from China’s Xinjiang Uygur autonomous region.\nTuesday’s updated list also names caustic soda – a chemical used in textiles and detergents – and red dates, bringing the total number of high-priority sectors targeted under the law to 12.\nThe Uygur Forced Labour...",
        "source": "smcp",
        "date": "2025-08-20T04:19:51+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3322427/us-names-five-more-chinese-industries-enforcement-under-uygur-labour-law?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d600ecf16dec29c89cec58990675bade426c41dfa23e4d0a39ff4233644f465d",
        "title": "US soybean farmers urge Trump to make purchase deal with China",
        "summary": "American soybean farmers urged US President Donald Trump in a Tuesday letter to reach a trade deal with China that secures significant soybean purchase agreements, warning of dire long-term economic outcomes if the country continues to shun the US crop.\nChina, the world’s largest soybean buyer, is turning to Brazilian cargoes amid trade tensions with the US and continuing negotiations. The country has not pre-purchased soybeans from the coming US harvest, an unusual delay that has worried...",
        "source": "smcp",
        "date": "2025-08-20T02:18:45+09:00",
        "url": "https://www.scmp.com/news/world/united-states-canada/article/3322424/us-soybean-farmers-urge-trump-make-purchase-deal-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c1f8b6269d9abc6aa1df405db23bb9b28e91e5e802b2e5996563295c5e837a41",
        "title": "Top engineer involved in Boeing 787 and A380 design leaves US for China",
        "summary": "Zhou Ming, renowned as the mastermind behind key industrial software used in planes such as the Boeing 787 and Airbus A380, has left his leadership role at US-based global engineering giant Altair to return to China.\nAn announcement on the website of the College of Engineering at the Eastern Institute of Technology in Ningbo said Zhou had joined as a chair professor and the first dean of the college in June and was already setting up a research team.\nZhou also confirmed the move on his personal...",
        "source": "smcp",
        "date": "2025-08-20T00:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322380/zhou-ming-top-engineer-involved-boeing-787-and-a380-design-leaves-us-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "aab07f847a72505cfc33ae4283d82a173ee3db872c0825fdeda49e788304fa09",
        "title": "Wang Yi: Sound China-India ties serve the two peoples' interests",
        "summary": "Wang Yi: Sound China-India ties serve the two peoples' interests",
        "source": "cgtn",
        "date": "2025-08-19T22:57:35+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/Wang-Yi-Sound-China-India-ties-serve-the-two-peoples-interests-1FYe9ygBc40/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "c6b631ad0b207f887cd38b996883c423f869db6d031f5b281eeb6da894ac9072",
        "title": "China’s exports to Global South surge, Putin taps Brazil: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Trump says he will arrange Putin, Zelensky meeting after speaking with both\n\nUS President Donald Trump said on Monday that he was brokering a meeting between Ukraine’s President Volodymyr Zelensky and their Russian counterpart, Vladimir Putin, to be followed by a trilateral meeting that would include the US leader.\n2. China’s exports, investments to Global...",
        "source": "smcp",
        "date": "2025-08-19T22:15:12+09:00",
        "url": "https://www.scmp.com/news/china/article/3322393/trump-encourages-putin-zelensky-talks-sars-virologists-warning-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "054cfca9a69c6dad2dd0ff03bc50d2d75cefd62aae951373317bc30216ffa83f",
        "title": "China confirms Indian Prime Minister Narendra Modi will visit at end of month",
        "summary": "Chinese Foreign Minister Wang Yi has confirmed that Indian Prime Minister Narendra Modi will visit China at the end of the month for the Shanghai Cooperation Organisation (SCO) summit.\nHis comments, made during talks on the two countries’ border dispute with Indian national security adviser Ajit Doval on Tuesday, came in the wake of a series of reports in Indian media that the visit would go ahead.\nIt will be Modi’s first trip to China in seven years and raises expectations he will meet Chinese...",
        "source": "smcp",
        "date": "2025-08-19T22:09:23+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322411/china-confirms-indian-prime-minister-narendra-modi-will-visit-end-month?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6c308d1e6315c21ff771aff494f49144cb71b5ee3d70923c099159dcc25fddcc",
        "title": "‘Not easy’: how a US firm avoided Trump’s China tariffs by sourcing American",
        "summary": "Denis Gagnon had long wanted to establish a manufacturing firm supplied only by American-made parts, a vision shaped by his experience in the international corporate world and his assessment of business risks offshore.\nHe was an outlier in an era of globalisation when businesspeople, including his US peers, waxed lyrical about outsourcing from Asia to minimise production costs.\nThe Gagnons, including his son William, run a medium-sized company called Excel Dryer in the US state of...",
        "source": "smcp",
        "date": "2025-08-19T22:00:09+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3322375/not-easy-how-us-firm-avoided-trumps-china-tariffs-sourcing-american?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b27bab49657f84459dbbc9d9287df805368d82dafa3abf00c2f22489fe4d3566",
        "title": "Potala Palace through the seasons: Eternal testament of time",
        "summary": "Potala Palace through the seasons: Eternal testament of time",
        "source": "cgtn",
        "date": "2025-08-19T21:40:54+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/Potala-Palace-through-the-seasons-Eternal-testament-of-time-1FXVfizUDRu/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b52a68175896239fce787593dbca0c5c9a131d03d098ca3f84c2c021ad1046f5",
        "title": "How Beijing and other South China Sea claimants can see eye to eye",
        "summary": "Few disputes in Asia are as enduring – and as polarising – as those over the South China Sea. For more than a decade, two sharply opposed narratives have dominated. In one, Beijing is seen as using force, or the threat of force, to change the status quo, undermining peace and stability. In the other, China is portrayed as exercising restraint, acting within its rights and working to safeguard regional stability.\nThese perspectives are not merely different; they are mutually exclusive. One side’s...",
        "source": "smcp",
        "date": "2025-08-19T21:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3322260/how-beijing-and-other-south-china-sea-claimants-can-see-eye-eye?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6f1a674dc2f4beb8c8d4bd304bf654b6944f6d20a7f8ffe62b755e4305d1429e",
        "title": "China launches seven satellites with Lijian-1 rocket",
        "summary": "China launches seven satellites with Lijian-1 rocket",
        "source": "cgtn",
        "date": "2025-08-19T21:24:49+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/China-launches-seven-satellites-with-Lijian-1-rocket-1FY8FTQSxfG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b5c36453219052f419a8f60344f064073b1666012cd160afb57df3942d5beb42",
        "title": "Xizang to inject additional expenditure into livelihood projects",
        "summary": "Southwest China's Xizang Autonomous Region will allocate an additional 2 billion yuan (about $280.4 million) to launch 10 new livelihood initiatives, the regional government has said.",
        "source": "cgtn",
        "date": "2025-08-19T21:22:30+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/Xizang-to-inject-additional-expenditure-into-livelihood-projects-1FXKn9baeBi/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "7026469554bfddc3217de4b5ea0db8f9e03085c1edff881d52e7b0ed34025387",
        "title": "China ready for sci-tech cooperation to aid global growth",
        "summary": "China is prepared to boost exchange and cooperation with different countries to let scientific and technological innovations drive global development and modernization, Chinese Foreign Ministry spokesperson Mao Ning said on Tuesday.",
        "source": "cgtn",
        "date": "2025-08-19T21:22:19+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/China-ready-for-sci-tech-cooperation-to-aid-global-growth-1FY8ytgrcAg/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "5c7790f0db545e4025e37dd328b04fc7e59abcc1fd156750b1889cba10cf28cf",
        "title": "China’s Weibo shuts down social media accounts for ‘inciting gender antagonism’",
        "summary": "The Chinese social media platform Weibo has shut down several accounts for “inciting gender antagonism” and vowed to continue cracking down on such behaviour.\nOn Monday, the social media site announced via its official account that it had permanently closed an account named “Lilian Shuodao” for “continuously stigmatising the opposite sex and posting extreme anti-marriage remarks”. The term “opposite sex” referred to men.\nAs of Tuesday, the banned account, which had 129,000 followers, was no...",
        "source": "smcp",
        "date": "2025-08-19T21:15:38+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3322407/chinas-weibo-shuts-down-social-media-accounts-inciting-gender-antagonism?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c0739161e094e37d0a4a057ce15acbc7f1265be01dd94dfa750775616e2577af",
        "title": "‘Treat drones like bullets’: Taiwan seeks around 50,000 UAVs over 2 years",
        "summary": "Taiwan is moving to buy nearly 50,000 drones over the next two years as it seeks to bolster its asymmetric combat capabilities against mounting military pressure from Beijing.\nThe move comes as the island’s military prepares to classify unmanned aerial vehicles (UAVs) as consumables to accelerate procurement – a policy that mirrors a recent shift by the United States.\nAccording to a recent tender notice published on the Taiwanese government’s procurement website, the defence ministry’s Armaments...",
        "source": "smcp",
        "date": "2025-08-19T21:12:27+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3322406/treat-drones-bullets-taiwan-seeks-50000-new-uavs-over-two-years-boost-defences?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f74397cd00254b67cd3a643863db955acec481a8500b752269070d68295911c4",
        "title": "Labubu phenomenon drives Pop Mart’s record interim sales, earnings",
        "summary": "Pop Mart established itself as the world’s most valuable toy producer and exporter of China’s “soft power” after the global phenomenon of its Labubu plush toys and figurines drove overseas revenue to soar fivefold in the first half.\nOnline and in-store revenue outside mainland China jumped to 5.59 billion yuan (US$778 million) in the first six months, making up about 40 per cent of the Beijing-based group’s total interim sales of 13.88 billion yuan, which beat analysts’ estimates, Pop Mart said...",
        "source": "smcp",
        "date": "2025-08-19T20:11:36+09:00",
        "url": "https://www.scmp.com/business/article/3322400/pop-marts-interim-sales-soar-labubu-craze-fuels-chinese-toymakers-record-earnings?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "96c2f6097d426bbd5156c6376ae99cc1dada937ec8c334024f5f5da5d2cbaf0e",
        "title": "Surprising many, Nobody becomes China’s top 2D animated film at the box office",
        "summary": "There’s a new king atop China’s 2D animated box office, and it’s Nobody.\nShanghai Animation Film Studio’s movie has overtaken Makoto Shinkai’s Suzume as the highest-grossing 2D animated film in Chinese box office history while becoming a dark horse in the nation’s summer movie season.\nWith its success, Nobody has dethroned the dominance of Japanese animated films in China.\nBefore Nobody’s debut on August 2, the all-time top three such movies at the Chinese box office were Suzume, having...",
        "source": "smcp",
        "date": "2025-08-19T19:30:07+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3322376/surprising-many-nobody-becomes-chinas-top-2d-animated-film-box-office?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a6ff1a31502a2191a18edfcc53227ff1805a0ad47b116e7912ad698969bafa8a",
        "title": "Europe breathes sigh of relief, but doubts linger over Trump’s Ukraine pledges",
        "summary": "European leaders left Washington on Monday with a palpable sense of relief, having avoided a breakdown with Donald Trump over Ukraine – but in the cold light of day, doubts are growing over the substance of the “breakthroughs” they claimed.\nAfter meetings with Trump that bordered on the obsequious, eight European leaders – including Ukrainian President Volodymyr Zelensky – trumpeted the trip as a success.\n“This was the best of our meetings,” Zelensky said. “I was able to show many things, even...",
        "source": "smcp",
        "date": "2025-08-19T19:28:43+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322395/european-leaders-breathe-sigh-relief-doubts-linger-over-trumps-pledges-ukraine?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "03862879c1ca57ee9c5fff564acce420e935850ac7c94d7ad2797debf83581c9",
        "title": "China says dialogue only viable way out of Ukraine crisis",
        "summary": "China says dialogue only viable way out of Ukraine crisis",
        "source": "cgtn",
        "date": "2025-08-19T19:21:26+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/China-says-dialogue-only-viable-way-out-of-Ukraine-crisis-1FXVJE1uKqs/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b217810f5f55fe0ced4766c0200c4f01d4e221c4597a23e7635badc260817354",
        "title": "The Front Line: taking stock of China’s military modernisation",
        "summary": "",
        "source": "smcp",
        "date": "2025-08-19T19:03:46+09:00",
        "url": "https://www.scmp.com/news/china/series/3322391/front-line-taking-stock-chinas-military-modernisation?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a4ba69c1354d9b390d5c949c756754f6cee9c7beb4685a7bfe1744e06607127f",
        "title": "The WWII history many Westerners were never taught",
        "summary": "The WWII history many Westerners were never taught",
        "source": "cgtn",
        "date": "2025-08-19T19:02:36+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/The-WWII-history-many-Westerners-were-never-taught-1FXYsmiX3yM/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "e0ad3f7505e5e217546dfc4b21cff9222c8b3d37a2feb5506b28501840c06684",
        "title": "80 years on: marking the end of World War II",
        "summary": "",
        "source": "smcp",
        "date": "2025-08-19T18:43:26+09:00",
        "url": "https://www.scmp.com/news/china/series/3322388/80-years-marking-end-world-war-ii?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bcdd60999d31e7138ec401357e44477f4d30f5ff96f48a1ac229867bee121afe",
        "title": "Animals kept cool during Shanghai heatwave",
        "summary": "Shanghai Zoo has stepped up its efforts to protect its animals from a sweltering heatwave.",
        "source": "cgtn",
        "date": "2025-08-19T18:22:22+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/Animals-kept-cool-during-Shanghai-heatwave-1FXXJ4gGODm/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "bd643fc7cf7bf136bda7e2bdb3f806074f9ad668d5cef1e27831c1e6280178d0",
        "title": "China's trade with other SCO states nears $250 bln in H1 2025",
        "summary": "China's trade with other member states of the Shanghai Cooperation Organization (SCO) reached $247.7 billion in the first half of 2025, as cooperation expands into digital and green sectors, according to the Chinese Ministry of Commerce.",
        "source": "cgtn",
        "date": "2025-08-19T18:11:17+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/China-s-trade-with-other-SCO-states-nears-250-bln-in-H1-2025-1FXUSy77jeo/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "284ce03042a143d9c08275d4b15776f0266b284a6f3b814b76ec4f75a7268d20",
        "title": "China launches plan to improve TV and mini-dramas amid soft power push",
        "summary": "China has called for more mini-dramas, documentaries, animations and foreign programmes to air on television to improve the quality of content.\nThe National Radio and Television Administration (NRTA) has released a set of measures, made public on Monday, launching a “content renewal plan” to improve innovation, the management of television series, content censorship and the promotion of programmes.\nThe document stressed that more support would be given to producing quality documentaries and...",
        "source": "smcp",
        "date": "2025-08-19T18:00:26+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3322368/china-launches-plan-improve-tv-and-mini-dramas-amid-soft-power-push?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7483f6c297774ecd9c3d828e82e9a18eedc03043e15c83e3232bb1cc8ce5fdb2",
        "title": "China-India ties: on Delhi trip, Wang Yi appeals for partnership and opportunity",
        "summary": "China and India should see each other as “partners and opportunities” and offer the world “much-needed certainty and stability”, Chinese Foreign Minister Wang Yi said during his first visit to India in three years amid recovering bilateral ties.\nSpeaking to his Indian counterpart, Subrahmanyam Jaishankar, in New Delhi on Monday, Wang said that both countries should “put each other’s precious resources into development and revitalisation”.\n“China and India should explore the right path of...",
        "source": "smcp",
        "date": "2025-08-19T16:56:23+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322353/chinas-wang-yi-appeals-shared-vision-partnership-and-opportunity-india-trip?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8521827f66204cfa82ca0eec70dc073bec99228e1cc022c3c77ff7c53bdee3bf",
        "title": "Wang Yi to visit Pakistan, hold 6th foreign ministers' dialogue",
        "summary": "Chinese Foreign Minister Wang Yi will visit Pakistan from August 20 to 22, the ministry's spokesperson Mao Ning announced on Tuesday.",
        "source": "cgtn",
        "date": "2025-08-19T16:48:08+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/Chinese-FM-to-visit-Pakistan-hold-6th-round-of-China-Pakistan-Foreign-Ministers-Strategic-Dialogue-1FXRAaTLgs0/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "2102eba602bf1f000f1a7d999f558718ce2c57dbfb98efc577b1fe6df6955732",
        "title": "China’s youth unemployment hits 11-month high as graduates join job hunt",
        "summary": "China’s youth unemployment rate rose to its highest level in 11 months in July, as a record number of graduates enter an already shaky labour market.\nThe urban jobless rate for the 16-24 age group, excluding students, rose to 17.8 per cent last month from 14.5 per cent in June, putting an end to four straight months of decline and marking the metric’s highest level since last August, according to data released by the National Bureau of Statistics on Tuesday.\nThe figures come as a record 12.2...",
        "source": "smcp",
        "date": "2025-08-19T16:06:16+09:00",
        "url": "https://www.scmp.com/economy/economic-indicators/article/3322347/chinas-youth-unemployment-hits-11-month-high-army-graduates-joins-job-hunt?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fb266c12f1dd7129573efe8ae975c84bd78721d9cfeacf25794fe484c14f8627",
        "title": "China-Europe Railway Express from Shenzhen marks 5 years of growth",
        "summary": "The China-Europe Railway Express departing from Shenzhen marked its fifth anniversary on Monday, with a train carrying home appliances, electronics and other goods bound for Russia.",
        "source": "cgtn",
        "date": "2025-08-19T16:03:54+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/China-Europe-Railway-Express-from-Shenzhen-marks-5-years-of-growth-1FXlQ2kxeeI/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a2ff8f19a22cd42b6a32ebeac1f8699a13479d6b61c58dde9318192cb5482222",
        "title": "China, India agree to maintain momentum of bilateral ties",
        "summary": "China and India on Monday agreed to maintain momentum of bilateral ties. The consensus came from talks between visiting Chinese Foreign Minister Wang Yi and his Indian counterpart Subrahmanyam Jaishankar.",
        "source": "cgtn",
        "date": "2025-08-19T16:03:05+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/China-India-agree-to-maintain-momentum-of-bilateral-ties-1FXn1Tae24M/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f635f5eff944c786835de32ffe94cc94d9b1f54cc80f868f3021dc4a5da8fa7d",
        "title": "China activates flood response in Beijing, Tianjin, Hebei",
        "summary": "China activates flood response in Beijing, Tianjin, Hebei",
        "source": "cgtn",
        "date": "2025-08-19T15:58:09+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/China-activates-flood-response-in-Beijing-Tianjin-Hebei-1FXHeTKykNy/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0392f9abccc4bbb76ada1fcf9858cd3a2a45241f44aae26683e56e3dd35dc77f",
        "title": "The third National Park Forum opens in SW China",
        "summary": "The third National Park Forum opens in SW China",
        "source": "cgtn",
        "date": "2025-08-19T15:57:10+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/The-third-National-Park-Forum-opens-in-SW-China-1FXKHz0tZV6/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "cb48e93fd73d5ea32df038f44bfe3c09f1cce77b5bbb6d47a8557f660a38aac9",
        "title": "China's sacrifices in War of Resistance Against Japanese Aggression",
        "summary": "China's sacrifices in War of Resistance Against Japanese Aggression",
        "source": "cgtn",
        "date": "2025-08-19T15:09:02+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/China-s-sacrifices-in-War-of-Resistance-Against-Japanese-Aggression-1FXJhnQQ22Y/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "489ff25b9f5af6df300873ee5bf1efef2689fe56eb3cc901d03b2c992e0e1ff1",
        "title": "China unveils crewed tilt-rotor aircraft but how does it compare with US Osprey?",
        "summary": "A Chinese version of the US military’s Osprey tilt-rotor aircraft has been captured conducting what appears to be its maiden flight in a photograph that began circulating on social media in China on Monday.\nThe picture shows a white prototype tilt-rotor aircraft hovering in front of a residential building with its rotors positioned vertically, indicating that it was in helicopter mode.\n\nThe cockpit design suggests it is crewed, although it is unclear from the photo whether there is a pilot on...",
        "source": "smcp",
        "date": "2025-08-19T15:00:15+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3322304/china-unveils-crewed-tilt-rotor-aircraft-how-does-it-compare-us-osprey?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "daf301beea15ee7395ae67e84e1ec70413ac47c4a0c795f21900bc4984bb5aae",
        "title": "How China's medical tech innovations unlock new possibilities for life",
        "summary": "From brain-computer interfaces to surgical robots, China's medical technology ecosystem is rapidly translating cutting-edge science into clinical reality.",
        "source": "cgtn",
        "date": "2025-08-19T14:37:27+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/How-China-s-medical-tech-innovations-unlock-new-possibilities-for-life-1FXBbMBGxag/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "80512fba838045ccd8c45024411d93fce47456fb8ee2abc00f17a29ec421d8c7",
        "title": "Ronaldo to go for 1st official title with Al Nassr in Saudi Super Cup",
        "summary": "Ronaldo to go for 1st official title with Al Nassr in Saudi Super Cup",
        "source": "cgtn",
        "date": "2025-08-19T14:10:00+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/Ronaldo-to-go-for-1st-official-title-with-Al-Nassr-in-Saudi-Super-Cup-1FXolt5Ypwc/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "604105f21d5123fb6c29726987a689f20f59dd56f6346d11ae1c54548f488542",
        "title": "14 Years of Resistance: China's overlooked role in WWII",
        "summary": "14 Years of Resistance: China's overlooked role in WWII",
        "source": "cgtn",
        "date": "2025-08-19T13:18:05+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/14-Years-of-Resistance-China-s-overlooked-role-in-WWII-1FXvnN3AXss/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "c0ae36d5238a73d7fb466246c4c68113d48b92e2815290c2ff472218a99f36ad",
        "title": "Why are honeybees dying en masse in the United States but thriving in China?",
        "summary": "While the US suffered its largest recorded collapse in its commercial honeybee colonies, China’s bee population has reached a historic high, maintaining the country’s long-standing position as the world’s largest producer of apiary goods.\nAround 62 per cent of managed colonies perished in a devastating wave of losses that swept across the US from June 2024 to January this year, to the alarm of the agricultural sector which relies on bee pollination for about one-third of its crops.\nScientists...",
        "source": "smcp",
        "date": "2025-08-19T13:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322217/why-are-honeybees-dying-massively-united-states-thriving-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ef313f1dc8dcd55e915dad71017123efbbbfcc8b7e933dfcc5fce29f2c913651",
        "title": "Super coastal highway bridge connected in Fujian",
        "summary": "Super coastal highway bridge connected in Fujian",
        "source": "cgtn",
        "date": "2025-08-19T11:28:16+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/Super-coastal-highway-bridge-connected-in-Fujian-1FXtuENy144/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "7b8c0bd94835f5d6f70b57991b1d9f8f36145a111ee27a4ecb20ca9f4c984bad",
        "title": "China sees scattered, extreme rainfall in flood-control period",
        "summary": "China has experienced scattered yet concurrent extreme rainfall events during this year's flood season, which have posed serious disaster risks, the Ministry of Water Resources said on Monday.",
        "source": "cgtn",
        "date": "2025-08-19T11:09:37+09:00",
        "url": "https://news.cgtn.com/news/2025-08-19/China-sees-scattered-extreme-rainfall-in-flood-control-period-1FXoD9G6Fu8/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "89423b1a5db6345dc99451b44a09d2a7d5949e3fb8f006eb01b8d1721d2a2f09",
        "title": "China’s exports, investments to Global South surge in ‘age of tariffs’: report",
        "summary": "China is accelerating its pivot to the Global South to reduce reliance on the United States, potentially creating “a new order of global commerce”, according to a new report.\nChinese exports to the Global South – covering most of the developing world – have doubled since 2015, with growth seeing a notable uptick after the US-China trade war during US President Donald Trump’s first term, S&amp;P analysts said on Tuesday.\nIn the past five years, these exports have risen by 65 per cent – tripling the...",
        "source": "smcp",
        "date": "2025-08-19T11:00:13+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3322225/chinas-exports-investments-global-south-surge-age-tariffs-report?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b1e2bae4189c48e59e9c6ee2194178deeb70ef5fdef7c327391194000cdfb69f",
        "title": "Hong Kong can’t afford to outsource its healthcare to mainland China",
        "summary": "In recent years, Hongkongers have developed a new habit: going north for their medical check-ups. A 2024 survey found nearly one in three residents had sought medical care in mainland China. The reasons are as predictable as they are troubling: shorter queues, cheaper drugs and upfront prices.\nIf this trend sounds like a temporary release valve for a stressed system, think again. What we’re seeing isn’t a convenient side option; it’s an unofficial outsourcing of healthcare. Left unchecked, it...",
        "source": "smcp",
        "date": "2025-08-19T10:30:09+09:00",
        "url": "https://www.scmp.com/opinion/hong-kong-opinion/article/3322178/hong-kong-cant-afford-outsource-its-healthcare-mainland-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cc7542beeb3bb7309ff78c081934c7b83f67729a51203d3791baf61200fa55f9",
        "title": "China’s Type 99A main battle tank sets benchmark for capability, survivability",
        "summary": "China is preparing for a military parade next month to celebrate the 80th anniversary of Japan’s defeat in World War II, with the People’s Liberation Army expected to showcase its latest line-up of land-based weapons systems.\nOne of the systems playing a crucial role in Chinese ground forces is the Type 99A main battle tank (MBT), which incorporates multiple advanced technologies to enhance survivability and firing capability.\nWhile China continues to focus on modernising its navy and air force,...",
        "source": "smcp",
        "date": "2025-08-19T10:00:08+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3320318/type-99a-chinas-most-advanced-tank-delivers-firepower-agility-and-survivability?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "022c2eec174fc4e15a4c068e8c893b845a890557b407024433bdb4c8be749567",
        "title": "Putin taps Brazil in China-linked peace push as Trump hosts Zelensky",
        "summary": "As US President Donald Trump prepared for the arrival of his Ukrainian counterpart Volodymyr Zelensky, Russia’s Vladimir Putin turned to another partner to discuss a possible path out of the war: Brazil.\nThe South American country’s President Luiz Inácio Lula da Silva spoke by phone with Putin on Monday, the Planalto Palace said, as Moscow pressed its case for new diplomatic efforts over the conflict.\nAccording to the official readout, Putin used the 40-minute call to brief Lula on his meeting...",
        "source": "smcp",
        "date": "2025-08-19T09:44:21+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322294/putin-taps-brazil-china-linked-peace-push-trump-hosts-zelensky?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d32d119083bd16aaf31dbda1076786a5541e57fe6715dea412fd064236a725aa",
        "title": "Alibaba’s Qwen 3 AI coding model gains on Claude Sonnet 4 in popularity",
        "summary": "Alibaba Group Holding’s artificial intelligence coding model Qwen 3 Coder has been gaining popularity globally amid intensified competition in the AI-assisted coding sector, according to data from a third-party agency.\nThe model’s usage share on AI marketplace OpenRouter soared to more than 20 per cent as of mid-August, trailing only Amazon.com-backed Anthropic’s Claude Sonnet 4 with 31 per cent of usage.\nAlibaba’s Qwen team released the Qwen 3 Coder on July 23, claiming it delivers top-tier AI...",
        "source": "smcp",
        "date": "2025-08-19T09:00:20+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3322264/alibabas-ai-coding-model-qwen-3-coder-soars-popularity-challenging-claude-sonnet-4?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "eb2a1c3156a0c29b568c4600e852912042ba9e553673e744b77ee7bc864664b2",
        "title": "China’s coastal provinces look to ride economic wave with offshore action plans",
        "summary": "China’s coastal provinces are leveraging their geographic advantages to align with the national strategy surrounding the marine economy, with plans to foster new growth in digitalised governance, offshore energy and tourism.\nSince China incorporated the marine economy into its 2035 vision, 10 provincial-level regions, including Shanghai, have rolled out marine-focused economic development plans since last year, according to a summary by Founder Securities.\nSoutheast China’s Fujian province will...",
        "source": "smcp",
        "date": "2025-08-19T09:00:09+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3322246/chinas-coastal-provinces-look-ride-economic-wave-offshore-action-plans?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "21a0035b9972d67986d963e737a716ee0ac2ba3db185602eb73f3cd93f39e567",
        "title": "China’s involution problem is not just about supply but also demand",
        "summary": "In economic policy documents, Beijing’s leadership used the term “involution”, neijuan in Chinese, in efforts to combat excessive competition in market segments such as photovoltaics and lithium batteries.\nThe authorities, who criticised the domestic dumping of products, have directed local governments to behave and stop offering unreasonable incentives that would lure enterprises into highly competitive segments.\nThe potential worst-case scenario for continued involution would be to drive many...",
        "source": "smcp",
        "date": "2025-08-19T08:00:07+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3322265/chinas-involution-problem-not-just-about-supply-also-demand?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a9f1d6718acf51a25c3133b718d155da31d7e9f8f5f656a320aaf9e0bec1dc8a",
        "title": "HKU virologist says next pandemic inevitable and world may not be ready",
        "summary": "In the fourth instalment of a series to mark the 10th anniversary of the Future Science Prize, Victoria Bela and Holly Chik look at Professor Malik Peiris’s contributions to public health and virology, which earned him the 2021 award in life science. Click here for parts one, two and three.\nThe next pandemic is inevitable, yet the world may not be any better prepared than it was before Covid-19, a top virologist has warned, and to prevent it, a more resilient world integrating human, animal and...",
        "source": "smcp",
        "date": "2025-08-19T07:00:22+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322249/next-pandemic-inevitable-top-hong-kong-virologist-says-and-world-may-not-be-ready?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "92a36b7a1f3d0e1cc8ffbec521c2cc9ba78fae869b4efec2ff6f5aec804a731a",
        "title": "How Beijing’s proposed new embassy in London could benefit Britain",
        "summary": "In a world increasingly defined by digital diplomacy and virtual communication, the persistent struggle over bricks and mortar might seem like an old-fashioned skirmish.\nHowever, the ongoing saga of China’s proposed new embassy in London, England, proves that physical buildings remain potent symbols of power, prestige and national ambition. The dispute over the diplomatic compound is more than just a planning row; it is a microcosm of the complex, often fraught relationship between the UK and...",
        "source": "smcp",
        "date": "2025-08-19T06:30:07+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3322136/how-beijings-proposed-new-embassy-london-could-benefit-britain?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "377f984c4016fd6c4c0aa43fc13a9c3ccebee6ec64032addf49c3bf49328a9c6",
        "title": "Chinese premier urges efforts to unlock consumption potential",
        "summary": "Chinese Premier Li Qiang on Monday stressed the importance of efforts to consolidate and expand the momentum of China's economic recovery and positive development trajectory, and of efforts to accomplish the country's annual economic and social development goals.",
        "source": "cgtn",
        "date": "2025-08-18T23:37:44+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Chinese-premier-urges-efforts-to-meet-annual-development-goals-1FWEILWxtW8/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "07080f1e6c43d09d69a8e788e6e6b9b83d9b590180920344cd254d434d445a69",
        "title": "MOFA refutes DPP authorities' claims over 'San Francisco treaty'",
        "summary": "MOFA refutes DPP authorities' claims over 'San Francisco treaty'",
        "source": "cgtn",
        "date": "2025-08-18T23:10:28+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/MOFA-refutes-DPP-authorities-claims-over-San-Francisco-treaty--1FWvPEWoCu4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d7e67ff146683fee5757bbf30a6a9c2eb56eec71bf376b932dd022c394e62775",
        "title": "Trump was put up for Nobel Peace Prize, so he must be a top mediator. Right?",
        "summary": "US President Donald Trump’s methods for mediating international conflicts may backfire and lead to more confrontation, experts in China have warned.\nTrump’s mediation tactics revealed a power politics approach and constituted ill-advised interference in the long term, Zhang Luwei, a research associate at the China Institutes of Contemporary International Relations, said in an article published on the institute’s social media account last week.\nShe said Trump was known for taking a high profile...",
        "source": "smcp",
        "date": "2025-08-18T23:00:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322166/trump-being-put-forward-nobel-peace-prize-so-he-must-be-top-mediator-right?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "98535dc7dfe6de8987d1b43e5d97b45ce9a7359a76ae5b01f597869abca117da",
        "title": "China’s latest weapons on show, US human rights slammed: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. EU envoys mull skipping China military parade over Putin’s attendance: sources\nEuropean envoys in Beijing are discussing plans to skip China’s massive military parade next month after considering the attendance of Russian President Vladimir Putin and the possible participation of Russian troops, the Post has learned.\n2. What new weapons were on show in...",
        "source": "smcp",
        "date": "2025-08-18T22:15:07+09:00",
        "url": "https://www.scmp.com/news/china/article/3322263/chinas-latest-weapons-show-beijing-slams-us-human-rights-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2c8f07076fc4b196204d633a1c272a68332104eb0846600fcbeba18d44ec0ef2",
        "title": "Mainland China IDs may mean loss of job, Taiwanese status, Taipei warns public",
        "summary": "Taiwan on Monday warned government employees and the wider public against obtaining mainland Chinese identification documents, stating that violators could lose Taiwanese citizenship and be disqualified from civil or military service.\nThe announcement is part of a wider effort by the William Lai Ching-te administration to counter what it describes as “mounting influence operations” from Beijing, which it says pose an increasing threat to Taiwan’s security.\nThe warning came as Taiwan’s Ministry...",
        "source": "smcp",
        "date": "2025-08-18T22:14:47+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3322270/taiwanese-mainland-china-ids-risk-losing-jobs-citizenship-taipei-warns?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "061aa57ac8c528847d549bc127b389b5264c68029641048190d27e70e17eeeed",
        "title": "Alibaba, Baidu lead China’s fast-growing market for AI cloud services",
        "summary": "Baidu and Alibaba Group Holding led the market for public cloud services supporting artificial intelligence in China last year, as the industry embraced “disruptive innovations” towards generative and agentic AI, according to consultancy IDC.\nThe mainland AI public cloud market reached 19.6 billion yuan (US$2.7 billion) in 2024, increasing 55 per cent on the back of surging demand for AI training and applications, IDC said on Monday.\nThe top two market players each accounted for roughly 25 per...",
        "source": "smcp",
        "date": "2025-08-18T22:00:14+09:00",
        "url": "https://www.scmp.com/tech/article/3322250/alibaba-baidu-lead-chinas-ai-cloud-boom-market-surges-55-us27-billion?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "51187a4ec65e193626c23dbdaee03883a4aef6858d6d16412dad27d0436542fe",
        "title": "Can China forge an offshore economic empire? EV producers are feeling the way",
        "summary": "The electric vehicle (EV) industry, formerly one of China’s most inward-focused industrial sectors, is now leading a push overseas, carrying the government’s hopes of forging an offshore economic empire to sidestep cutthroat competition at home.\nLast year, for the first time, Chinese EV companies invested more overseas than they did at home, despite higher costs, delays and risks abroad, according to a report published by Rhodium Group on Monday.\nThat marked a historic shift after years of...",
        "source": "smcp",
        "date": "2025-08-18T22:00:08+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3322247/how-ev-industry-driving-chinas-going-global-strategy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9c92dc8ef74f3e3af312ac7e128eb86290e15f6c538b44459f3d28ac4a7cd808",
        "title": "US negotiators face tough task to secure trade deal with China",
        "summary": "With the tariff truce extended to November 10, US and Chinese negotiators can now focus on shaping a trade deal in the lead-up to a possible summit between US President Donald Trump and Chinese President Xi Jinping this autumn. While engagement has occurred at senior levels since the first meeting in Geneva, Switzerland, several months ago, it appears that much of the discussion since then has centred around ensuring the smooth flow of Chinese critical minerals and magnets to the United...",
        "source": "smcp",
        "date": "2025-08-18T21:30:07+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3322129/us-negotiators-face-tough-task-secure-trade-deal-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "57ddc501653d22395c2179d9e93c2e3e56b532f12516ddb91db3df34f27e3b34",
        "title": "China to face greater pressure if US gives Ukraine Nato-style security: analysts",
        "summary": "China is likely to face “increasing” geopolitical pressure if the US extends Nato-style security protection to Ukraine to end its war with Russia following the Trump-Putin summit, Chinese analysts have warned.\nRussian President Vladimir Putin agreed at the meeting in Alaska to allow the United States and Europe to “effectively offer Article 5-like” security guarantees to Kyiv as part of a potential peace deal, US President Donald Trump’s special envoy Steve Witkoff, who attended the high-stakes...",
        "source": "smcp",
        "date": "2025-08-18T21:00:07+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322254/china-face-increasing-pressure-if-us-gives-ukraine-nato-style-protection-analysts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d5e4b34869c9180d2f687cf35dea30698b187bafca73f44699706c03a8bfead4",
        "title": "Chinese surgeons save patient who was nearly beheaded by robotic arm",
        "summary": "Chinese doctors have saved a patient whose head was nearly severed by a robotic arm.\nDoctors said the patient’s cervical vertebrae had been severed and crucial neurovascular structures had been damaged, but the spinal cord remained intact despite sustaining serious contusions.\n“We have looked through much literature at home and abroad, but have never come across a case of such severe cervical vertebra separation, let alone one that survived after treatment,” Chen Huajiang, director of the...",
        "source": "smcp",
        "date": "2025-08-18T20:39:05+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322257/chinese-surgeons-save-patient-who-was-nearly-beheaded-robotic-arm?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "73436903460768809d79a42e35614583a930a12e6a32956a3e56a0dfc1bd84f6",
        "title": "Xtep’s interim profit rises as China’s running craze lifts Saucony sales",
        "summary": "Xtep International Holdings’ interim earnings surged to a record, as the sportswear maker and distributor of the Saucony brand of running shoes benefited from the new-found popularity of marathons and trail running in China.\nNet profit rose to a record 913.6 million yuan (US$127.3 million) in the first half, 6.4 per cent more than the revised interim earnings last year, Xtep said in a statement on Monday. Sales increased 7.1 per cent to 6.84 billion yuan, from the restated revenue of 6.38...",
        "source": "smcp",
        "date": "2025-08-18T19:30:24+09:00",
        "url": "https://www.scmp.com/business/companies/article/3322241/xtep-posts-record-interim-profit-chinas-marathon-boom-boosts-sales-saucony-shoes?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "68783a1309947ad62cb5ab379a8b8e08d93a6cc95f68cc505ea3a2854a4b5293",
        "title": "EU envoys mull skipping China military parade over Putin’s attendance: sources",
        "summary": "European envoys in Beijing are discussing plans to skip China’s massive military parade next month after considering the attendance of Russian President Vladimir Putin and the possible participation of Russian troops, the Post has learned.\nAccording to five sources familiar with the matter, European missions in Beijing have been invited to the parade and events on the same day but are particularly troubled by the Russian leader’s attendance as Moscow has intensified its attacks on Ukrainian...",
        "source": "smcp",
        "date": "2025-08-18T17:06:25+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322196/eu-diplomats-mull-skipping-china-military-parade-over-putins-attendance-sources?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0703ba4d3a3d77d6b7f90fdeef6b874588cac90dc33bf8d10cd98205308d9f8a",
        "title": "China’s Nvidia challenger Cambricon to raise US$560 million for AI chip work",
        "summary": "Chinese semiconductor firm Cambricon Technologies, seen as a potential future challenger to Nvidia, plans to raise nearly 4 billion yuan (US$560 million) for AI chip development, boosting its standing in the country’s tech self-sufficiency drive.\nIn a statement on the weekend, Cambricon said the Shanghai Stock Exchange had given the go-ahead for its 3.98 billion yuan fundraising plan, which is pending approval from the China Securities Regulatory Commission. The move comes after its stock price...",
        "source": "smcp",
        "date": "2025-08-18T16:33:52+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3322203/chinas-nvidia-challenger-cambricon-raise-us560-million-ai-chip-development?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b3ed1ab298d1cdf7accc218067ee593b3ba782013f33beac4a8ae4e68b5b3162",
        "title": "Chinese scientists transplant human brain cells to mice, boosting pleasure",
        "summary": "Chinese scientists have found a way to turn human stem cells into dopamine-producing brain cells, transplanting them into mice and helping reduce depressive behaviour and boost pleasure.\nWhen the engineered neuron-like cells were grafted into depression-model mice, they helped lessen symptoms like anxiety and resignation while increasing feelings of enjoyment.\nThe development has the potential to be employed as a therapy to treat neuropsychiatric disorders by directly targeting and repairing...",
        "source": "smcp",
        "date": "2025-08-18T15:00:13+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322054/chinese-scientists-transplant-human-brain-cells-mice-boosting-pleasure-levels?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "60f2148b22ded383a0be2fd84c27bcd17df964a6e70c6ed3e4ad35849028f676",
        "title": "New hypersonic missiles and drones: what’s been rolling through Beijing?",
        "summary": "New hypersonic anti-ship missiles and a road-mobile intercontinental ballistic missile system were among a line-up of advanced Chinese weaponry seen on the streets of Beijing over the weekend.\nPhotos and videos circulating online reveal some of the People’s Liberation Army’s latest hardware that was spotted by residents during a second rehearsal for next month’s military parade.\nThe images and footage show unmanned underwater vehicles, a gigantic laser weapon, a fleet of drones and unmanned...",
        "source": "smcp",
        "date": "2025-08-18T13:00:09+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3322176/new-missiles-drones-and-tanks-whats-been-rolling-through-beijings-streets?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "98069830b3c597247042d61117e375f4d7827a59277b3a38c069e2af05723076",
        "title": "The rise of China’s soft power",
        "summary": "",
        "source": "smcp",
        "date": "2025-08-18T12:54:15+09:00",
        "url": "https://www.scmp.com/news/china/series/3322179/rise-chinas-soft-power?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "754db4e8810b5a0860c80c7c6d91d13eb6b319e7ab2f491b42e80cab9a2d0508",
        "title": "China’s key stock index climbs to 10-year high as investors chase higher returns",
        "summary": "Mainland Chinese stocks rose on Monday, driving a key gauge to a decade high amid increasing signs that investors have been rotating out of bonds and bank deposits into equities in hunt for better returns.\nThe Shanghai Composite Index advanced 0.9 per cent to 3,728.03 at the close, a level not seen since August 19, 2015. The CSI 300 Index climbed 0.9 per cent, finishing at the highest level in almost a year.\nShares worth 2.75 trillion yuan (US$382.9 billion) changed hands on the mainland’s...",
        "source": "smcp",
        "date": "2025-08-18T11:43:56+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3322169/hong-kong-stocks-steady-investors-await-key-quarterly-results-powells-speech?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c6ff7d68545ff320f7dfe187f95810d160f47f9194bb98e07fa9522dd0945e0d",
        "title": "‘Bargaining chips in power games’: China report slams US on human rights",
        "summary": "China has accused the United States of using human rights as a “bargaining chip” in its latest annual report on the issue.\nThe report released on Sunday criticised what it called the hypocrisy of the US political system, its unequal social welfare, widespread racism, and the politicisation of immigration, where immigrants become “scapegoats for political parties”.\nThe US had turned human rights into “props for political theatre” and “bargaining chips in power games”, it alleged.\nThe year 2024...",
        "source": "smcp",
        "date": "2025-08-18T11:26:37+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322151/china-report-says-us-using-human-rights-bargaining-chip-deeply-unequal-society?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "31d6d28769a98b66359c877ee47dd1d78c07f8baa5cc88bb0e9de5de46c06f5a",
        "title": "Chinese pharma firms Hengrui, Hansoh expected to post strong first-half profits",
        "summary": "Jiangsu Hengrui Pharmaceuticals and Hansoh Pharmaceutical Group, two of China’s largest drug makers, are expected to report significantly improved profits, buoyed by novel drug roll-outs and revenue from technology licensing.\nOn August 21, Hengrui, China’s largest drug maker by market value, is expected to say its net profit for the first half rose 40 per cent from a year earlier to 4.1 billion yuan (US$570.8 million), with revenue up 9 per cent to 15.7 billion yuan, according to analysts’...",
        "source": "smcp",
        "date": "2025-08-18T08:30:12+09:00",
        "url": "https://www.scmp.com/business/article/3322005/chinese-pharma-firms-hengrui-hansoh-expected-post-strong-first-half-profits?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1c01d5f5ce668bd2773975578ecafa14f2547b2725cd3bd40648ed6c952e6f58",
        "title": "Jing Qian unpacks the US-China trade talks and their ‘manageable’ rivalry",
        "summary": "Jing Qian is vice-president of the Asia Society and managing director of its Centre for China Analysis (CCA), which he co-founded with Kevin Rudd, former prime minister of Australia. His research examines the interplay between domestic politics and foreign policy in the United States and China.\nIn his second Open Questions interview, he delves into the two countries’ all-important relationship, how its twists and turns play out in Europe and the numerous domestic economic challenges Beijing is...",
        "source": "smcp",
        "date": "2025-08-18T07:00:15+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3321959/jing-qian-unpacks-us-china-trade-talks-and-their-manageable-rivalry?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ce67a2e2180d3a0bcabbb426c4ddbf7908f761e4cbf3ae61723f3b169d4d2e74",
        "title": "China achieves best performance at World Games in Chengdu",
        "summary": "China achieves best performance at World Games in Chengdu",
        "source": "cgtn",
        "date": "2025-08-17T22:09:22+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/China-achieves-best-performance-at-World-Games-in-Chengdu-1FUOzzSjFOo/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "95c157dad1824547a090c62deb5cf831ad20ac7dd14cb9f19ef5b35f3983d4ad",
        "title": "China Weekly News Quiz: August 11-17, 2025",
        "summary": "Do you know what happened in China last week? Take our weekly news quiz to test your knowledge and get up to speed on the latest developments in case you missed something.",
        "source": "cgtn",
        "date": "2025-08-17T20:42:06+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/China-Weekly-News-Quiz-August-11-17-2025-1FULDEBzwpW/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "bd178307d0e80e152ab3ff06b5b6bd8f9b8169e874f30aff0b8cbb2e53563acb",
        "title": "China launches new test satellite Shiyan-28B 02",
        "summary": "China launches new test satellite Shiyan-28B 02",
        "source": "cgtn",
        "date": "2025-08-17T20:38:25+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/China-launches-new-test-satellite-Shiyan-28B-02-1FUMrDexnhe/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "862911f4279304e94dbacd4ecdc447645cf8cd32f0c5fcf341947af025b5e381",
        "title": "Books of Xi's discourses on deepening reform comprehensively published",
        "summary": "The first and second volumes of a compilation of discourses by Xi Jinping, general secretary of the Communist Party of China (CPC) Central Committee, on adhering to deepening reform comprehensively have been published.",
        "source": "cgtn",
        "date": "2025-08-17T20:02:40+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/Books-of-Xi-s-discourses-on-deepening-reform-comprehensively-published-1FUJreWZRNm/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "13c767e0304724fcabe03736d27a96815914de3f317681545f76ed2ec1fc3e18",
        "title": "CMG to air Xizang Autonomous Region's 60th anniversary special",
        "summary": "CMG to air Xizang Autonomous Region's 60th anniversary special",
        "source": "cgtn",
        "date": "2025-08-17T19:13:10+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/CMG-to-air-Xizang-Autonomous-Region-s-60th-anniversary-special-1FUwQocSKC4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "8e005662a1c305a00648b1c8a6db02ae298f5d440ee662c5c0c0a94824d9408d",
        "title": "Tibetan dance shines in Stockholm",
        "summary": "To celebrate the 60th anniversary of the founding of the Xizang Autonomous Region, CGTN is launching a global social media campaign called \"Xizang Dance Time.\"",
        "source": "cgtn",
        "date": "2025-08-17T18:36:45+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/Tibetan-dance-shines-in-Stockholm-1FUCcJ2JWNy/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f49758f00df5bd08d19d3e541595c590d0a59bc30d051641e81a81c8cc765933",
        "title": "Chinese film 'Dongji Rescue' touches hearts in the UK and Australia",
        "summary": "The Chinese-produced World War II film \"Dongji Rescue\" had its European premiere in London on August 15, marking the 80th anniversary of Japan's surrender. Two days earlier, the film debuted in Australia.",
        "source": "cgtn",
        "date": "2025-08-17T18:15:08+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/Chinese-film-Dongji-Rescue-touches-hearts-in-the-UK-and-Australia-1FUBJns0Bt6/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "2e34c65147e8d6b6b899f1eba00d5061db2d9dcc4c5d1af75e9a7d2648b3f308",
        "title": "We Are the World: Memories of the Chengdu World Games",
        "summary": "As the World Games in Chengdu draws to a close, one symbol remains etched in the hearts of athletes and audiences alike – the letter \"W.\"",
        "source": "cgtn",
        "date": "2025-08-17T18:14:06+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/We-Are-the-World-Memories-of-the-Chengdu-World-Games-1FUAq3e9Xm8/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f453872a63a87806d64b151d75f162c64d0ab485a5ff6b445923cca4176e6490",
        "title": "Wushu, dragon boat racing to remain competitive sports at World Games",
        "summary": "Wushu, dragon boat racing to remain competitive sports at World Games",
        "source": "cgtn",
        "date": "2025-08-17T18:13:44+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/Wushu-dragon-boat-racing-to-remain-competitive-sports-at-World-Games-1FUqbvnhqs8/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "483477a12128e97d1aedcebfa6a88a10ea974dbca7fa5fb008d9fc5555c11240",
        "title": "Irish athletes snag panda souvenirs and spicy cuisine in Chengdu",
        "summary": "Irish athletes snag panda souvenirs and spicy cuisine in Chengdu",
        "source": "cgtn",
        "date": "2025-08-17T18:08:07+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/Irish-athletes-snag-panda-souvenirs-and-spicy-cuisine-in-Chengdu-1FUapRIS0iQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "13a0b6c6d1cee64950be54003b9d4d293c04a532b472a227d3c3f62457690b0e",
        "title": "UN@80: A Chinese village's journey out of poverty",
        "summary": "Located in a mountainous area on the west bank of Jin-Shaan Grand Canyon, Chiniuwa Village was once considered \"uninhabitable.\" However, with the development of the local tourism industry, it has become a prominent landmark of Jiaxian County.",
        "source": "cgtn",
        "date": "2025-08-17T17:53:09+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/UN-80-A-Chinese-village-s-journey-out-of-poverty-1FUz54x7lQY/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "3d594c0abc5386eea09464c330f5019dcc9b548850b141f5a53ff1daabb48675",
        "title": "18 world and nine Games records broken at Chengdu World Games",
        "summary": "18 world and nine Games records broken at Chengdu World Games",
        "source": "cgtn",
        "date": "2025-08-17T15:28:15+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/18-world-and-nine-Games-records-broken-at-Chengdu-World-Games-1FUbCP2IkX6/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ef9e901db4879e201c11eac005fd0a069d5958c84c04281a2bdee9b9a32c906b",
        "title": "Beneath the spotlight: Unsung heroes of the World Games",
        "summary": "Beneath the spotlight: Unsung heroes of the World Games",
        "source": "cgtn",
        "date": "2025-08-17T15:14:53+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/Beneath-the-spotlight-Unsung-heroes-of-the-World-Games-1FUpt8Zibsc/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "c50d6031b44fd32afb88e5a13df9f4f6be597bd80ec5f477296f90ff7699ca8b",
        "title": "Why Taiwan's return to China is part of the post-WWII global order",
        "summary": "Taiwan's restoration to China is a victorious outcome of WWII and an integral part of the postwar international order, said Chinese President Xi Jinping in a signed article in May.",
        "source": "cgtn",
        "date": "2025-08-17T14:59:29+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/Why-Taiwan-s-return-to-China-is-part-of-the-post-WWII-global-order-1FTcHIdgO6Q/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "82eef52c563cb51e6b83d771bcafc83de5f65d7dad84bf09e4333968421cb05c",
        "title": "The backbone of China's resistance war",
        "summary": "The backbone of China's resistance war",
        "source": "cgtn",
        "date": "2025-08-17T13:45:34+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/The-backbone-of-China-s-resistance-war-1FUiT8xjzag/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "3155bd1dcb49f0fcb6adae5876d47dc1d0ffc1f0c1c87090babf13736a4c083c",
        "title": "London hosts European premiere of WWII film 'Dongji Rescue'",
        "summary": "London hosts European premiere of WWII film 'Dongji Rescue'",
        "source": "cgtn",
        "date": "2025-08-17T12:05:20+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/London-hosts-European-premiere-of-WWII-film-Dongji-Rescue--1FU96t9VCPC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "05a81b79e65a535c57c784a5553ac0484976e3c246a882f38e5022402dd23baa",
        "title": "Taiwan marks 80th anniversary of victory against Japanese aggression",
        "summary": "A symposium was held on Saturday in Taipei to commemorate the 80th anniversary of the victory of the Chinese People's War of Resistance Against Japanese Aggression and the World Anti-Fascist War.",
        "source": "cgtn",
        "date": "2025-08-17T11:26:14+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/Taiwan-marks-80th-anniversary-of-victory-against-Japanese-aggression-1FTZeqhzrtm/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "e0189128eaa3ed4e15038a3341f78d72ff148bc1d172d060a453fa1750dbfc82",
        "title": "Suzhou: City of misty canals and the water spirit who watches",
        "summary": "At first glance, Suzhou feels like a city made of water.",
        "source": "cgtn",
        "date": "2025-08-17T10:11:08+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/Suzhou-City-of-misty-canals-and-the-water-spirit-who-watches-1FIuWxvHRTy/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b23a28b926e3613dbd16b54bfabba386097a734dbcf7ce1fbdf6e766f6295dba",
        "title": "China holds second rehearsal for September grand gathering",
        "summary": "The second comprehensive rehearsal for the upcoming grand gathering to mark the 80th anniversary of the victory in the Chinese People's War of Resistance Against Japanese Aggression and the World Anti-Fascist War concluded in Beijing early Sunday, according to the event's media center.",
        "source": "cgtn",
        "date": "2025-08-17T09:04:59+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/China-holds-second-rehearsal-for-September-grand-gathering-1FTXX7qKjh6/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "e37c876550332353a8f0708e8a068f57fd8d715d0e515b2b23307fd95e316955",
        "title": "Tibetan tales revived through children's picture books",
        "summary": "Tibetan artist Gawa Damdhul is breathing new life into ancient folklore through his beautifully illustrated children's books.",
        "source": "cgtn",
        "date": "2025-08-16T16:41:20+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Tibetan-tales-revived-through-children-s-picture-books-1FSSch0FAAw/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    }
]