[
    {
        "id": "5b93f8dd4feba9243cc53d4b8bc730c74aa31b5395dffd044ef76d9a06fcbe06",
        "title": "The STEM crisis in China’s universities: how outdated courses are wasting talent",
        "summary": "At a conference in December, Wang Xingxing – the robotics guru who founded China’s industry-leading Unitree Robotics – had a sharp critique.\n“China is at a disadvantage in terms of talent reserves because its education system has decided that knowledge learned in school is often outdated, whereas overseas students study the world’s most cutting-edge technologies,” he told the audience.\n“The education system fundamentally shapes future development potential and opportunities,” Wang said, adding...",
        "source": "smcp",
        "date": "2025-10-25T07:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329310/stem-crisis-chinas-universities-how-outdated-courses-are-wasting-talent?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a15a4c0de6d498c595d34e83a7b71dc482246b4beb569c9f532ea5ee7bd55335",
        "title": "Trump turns up the heat with probe into China’s compliance with 2020 trade deal",
        "summary": "In a move that piles up further US leverage in advance of next week’s planned meeting between US President Donald Trump and Chinese President Xi Jinping, the US trade representative announced an investigation on Friday into Beijing’s compliance with the Phase One Trade Agreement.\nThe latest tit-for-tat salvo comes as the two economic giants amass threats that, if carried through, could cripple the global economy.\n“The initiation of this investigation underscores the Trump administration’s...",
        "source": "smcp",
        "date": "2025-10-25T01:21:43+09:00",
        "url": "https://www.scmp.com/news/us/economy-trade-business/article/3330280/us-launches-investigation-chinas-compliance-trumps-2020-trade-deal?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f332b7fd56984f302d42a4c3df9d22ecec07d711fd08792bc80755e621b654e4",
        "title": "Modest hopes for Xi-Trump summit as China and US count down to South Korea talks",
        "summary": "As the presidents of China and the United States prepare to meet in South Korea next week, observers remain sceptical of breakthroughs but see potential for incremental steps towards mutual de-escalation of US-China tensions.\nWithout confirming a bilateral meeting with Donald Trump, China’s foreign ministry said on Friday that Xi Jinping would visit South Korea from October 30 to November 1 for the Asia-Pacific Economic Cooperation (Apec) summit in Gyeongju.\nThe White House, however, announced...",
        "source": "smcp",
        "date": "2025-10-25T00:00:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330268/modest-hopes-xi-trump-summit-china-and-us-count-down-south-korea-talks?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "89e6d9ce367fa54d2286827679f8ecce8622a6dec7588708bd0c1a6993fe7d69",
        "title": "Beijing sets October 25 as day to commemorate Taiwan’s restoration",
        "summary": "Beijing has formally designated October 25 as the day to commemorate Taiwan’s restoration, as it again asserts its sovereignty over the self-ruled island.\nThe National People’s Congress Standing Committee, the country’s top legislative body, ratified the decision on Friday.\nState news agency Xinhua reported that commemorative events would be held on Saturday, the 80th anniversary of the surrender of the Japanese forces in Taiwan to the then ruling Kuomintang (KMT).\nThe surrender ended Japan’s...",
        "source": "smcp",
        "date": "2025-10-24T23:34:19+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3330273/beijing-sets-october-25-annual-day-commemorate-taiwans-restoration?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e0121791265cf20719aac4544c9d0dc5a8049055da953b4e441c75d2d4e1a2d1",
        "title": "China to tackle risks, ‘inject certainty’ into global economy over next 5 years",
        "summary": "In the face of an increasingly turbulent world, China will employ “strategic proactiveness” as it addresses growing risks and challenges, senior officials said at a Friday press conference detailing the country’s priorities under its next five-year plan.\nThe world’s second-largest economy will shift more attention to the development of its domestic market amid global uncertainty, focusing on the production of tangible goods and technological advancements to ensure growth “remains within a...",
        "source": "smcp",
        "date": "2025-10-24T22:30:09+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330256/china-tackle-risks-inject-certainty-global-economy-over-next-5-years?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e932118dc74ec6e0feb7032215ca452e704b1aced34204dc1540e4feda1506f3",
        "title": "Trump-Xi meeting, China’s C919 jet at Dubai Airshow: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Trump to meet Xi in South Korea next Thursday as part of key Asia trip\nUS President Donald Trump will meet Chinese President Xi Jinping on October 30 in South Korea, the White House confirmed.\n2. Does Switzerland beat China in innovation? Ranking raises questions about bias\nChina topped the world in knowledge and technology outputs this year in a leading...",
        "source": "smcp",
        "date": "2025-10-24T22:15:08+09:00",
        "url": "https://www.scmp.com/news/china/article/3330238/trump-xi-meeting-li-qiangs-singapore-visit-chinas-c919-jet-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "be87eb93fe78e3d73f16c8e976639565b308144648e66dff0ef1164dcbdcc63c",
        "title": "State rare earth giant throws support behind China’s broad export controls",
        "summary": "One of China’s largest producers of rare earth elements has pledged to “strictly enforce government guidance” on export controls, a show of support from a major industry player as US officials harshly criticise Beijing’s recent expansion of licensing requirements for the crucial minerals.\nThe statement from China Rare Earth Group – a conglomerate of state metals firms formed in 2021 – serves as a reaffirmation of Beijing’s resolve in consolidating its oversight of the rare earths trade, despite...",
        "source": "smcp",
        "date": "2025-10-24T22:00:08+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330227/state-rare-earth-giant-throws-support-behind-chinas-broad-export-controls?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "062fe925722cf158b1b439cfd55c4f1ce60cca302f90b9fc51d01de16208055c",
        "title": "To win wars, PLA must fight corruption, China’s military mouthpiece declares",
        "summary": "China’s military mouthpiece has described political loyalty and fighting corruption as crucial for winning wars, a day after a Communist Party conclave endorsed a reshuffle and anti-corruption drive in the armed forces.\nAt the fourth plenum of the party’s Central Committee, which concluded on Thursday, the military’s anti-corruption chief, Zhang Shengmin, was promoted to vice-chairman of the powerful Central Military Commission (CMC) headed by President Xi Jinping.\nParty leaders also endorsed...",
        "source": "smcp",
        "date": "2025-10-24T21:00:09+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3330257/win-wars-pla-must-fight-corruption-chinas-military-mouthpiece-declares?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f5eb61183f84ccd3bc050042df0b241a35eacff6e52fcf5939a08ec565a8a5a1",
        "title": "China must stay focused on ‘own work’ despite external challenges, Xi says",
        "summary": "During the preparatory period for China’s next five-year plan, President Xi Jinping stressed the country needed to stick to its strategy of “focusing on doing its own work” and seizing the initiative amid an uncertain external environment, according to a report by the state-run news agency Xinhua.\nThe comments, which Xi originally made during a symposium in August, were published on Friday, the day after the conclusion of the fourth plenum of the Communist Party’s Central Committee, where...",
        "source": "smcp",
        "date": "2025-10-24T20:00:13+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330239/china-must-stay-focused-own-work-despite-external-challenges-xi-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "20976061d7874197486d4041794878346593ce6142c2ccac8e9d2ee7419bc028",
        "title": "Crater suggests a huge asteroid hit Guangdong 10,000 years ago",
        "summary": "Scientists have confirmed that a large crater in China’s southern Guangdong province formed as a result of an asteroid impact around 10,000 years ago, at a time when human civilisation was undergoing rapid development.\nThe Jinlin crater, located near the city of Zhaoqing, is just the fifth confirmed impact crater in China and the first one to be identified in the country’s southern region.\nThrough analysis of the tilted bowl-shaped crater on a hillside with a diameter of about 900 metres (2,952...",
        "source": "smcp",
        "date": "2025-10-24T20:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330000/crater-suggests-asteroid-hit-guangdong-10000-years-ago-blast-40-atomic-bombs?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3e49c6d5b9ca73cc51b2f94f328272b9330b99efdd08e77867ae3b23e2b9fefe",
        "title": "China can learn US lessons to unleash military power of civilian tech, researcher says",
        "summary": "China can learn from the United States when it comes to applying civilian innovations to the military, a Chinese geopolitical expert has said.\nIn an article last week, Gu Jianyi, a researcher at Shanghai Jiao Tong University, said China could consider developing a new industrial ecosystem inspired by successful US firms such as SpaceX, Palantir and Anduril. Such an ecosystem would be defined by Silicon Valley-style innovation, software-centric design, agile development and civil-military...",
        "source": "smcp",
        "date": "2025-10-24T19:01:17+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3330236/china-can-learn-us-lessons-unleash-military-power-civilian-tech-researcher-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "eee7c2642911850618241a8d337125654d2b1f7cf4fde74b1913ae02dbf04736",
        "title": "Premier Li Qiang to visit Singapore as China looks to shore up ties",
        "summary": "Premier Li Qiang will arrive in Singapore on Saturday for a two-day visit that the Chinese foreign ministry said aimed to deepen cooperation and reaffirm a shared commitment to multilateralism.\nThe ministry confirmed the trip on Friday, saying it came at a pivotal moment as the two countries marked 35 years of diplomatic ties.\n“China hopes to work with Singapore through the visit to … deepen cooperation in various fields, have close communication and cooperation on international and regional...",
        "source": "smcp",
        "date": "2025-10-24T17:15:39+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3330204/premier-li-qiang-visit-singapore-china-looks-shore-ties?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "79a098ca71a359cd58eef300d57b02831103895f5af367703c5004e38b48fcb1",
        "title": "China and US must halt escalating weaponisation of trade, Chinese scholar urges",
        "summary": "China and the United States should refrain from weaponising more aspects of their relationship, a Chinese scholar has urged, as the world’s two largest economies prepare to hold a fresh round of negotiations to cool down a recent flare-up in tensions.\n“It’s very important that the two sides need to have some kind of self-restraint,” said Da Wei, director of Tsinghua University’s Centre for International Security and Strategy, at the Bund Summit in Shanghai on Thursday. “Stop trying to find new...",
        "source": "smcp",
        "date": "2025-10-24T16:06:07+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330187/china-and-us-must-halt-escalating-weaponisation-trade-chinese-scholar-urges?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2ecbde6da296c7956dd50e532ba8fdf6b9ab3c6d8ed537d27db4ea93566ea480",
        "title": "Maker of China’s C919 jet to scout for Middle Eastern buyers at Dubai Airshow",
        "summary": "China’s passenger jet manufacturer will make its Dubai Airshow debut next month, when it is likely to scout for buyers of its small C909 and narrowbody C919 aircraft in the Middle East.\nThe air show’s website lists Commercial Aircraft Corporation of China (Comac) among its 1,500 exhibitors, and analysts said the Shanghai-based, state-owned planemaker’s participation at the event from November 17 to 21 would mark a first for the company.\nComac has been looking for overseas buyers of its older,...",
        "source": "smcp",
        "date": "2025-10-24T16:00:09+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3330179/maker-chinas-c919-jet-visit-dubai-airshow-scout-middle-eastern-buyers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4ffb6fccff12764518f4ce9dbbeda845e412e441b759dd6fecac5af3284047d7",
        "title": "Chinese team unveils smart, super-tough coating for stealth aircraft",
        "summary": "China has developed a flexible, durable aircraft coating that absorbs radar waves, potentially closing a critical technological gap and redefining the future of aerial stealth.\nA study published on October 14 in Advanced Materials details a scalable, flexible and ultra-thin (0.1 mm) metasurface capable of withstanding temperatures up to 1,000 degrees Celsius (1,832 degrees Fahrenheit).\nThe material features tunable impedance, making it suitable for aerospace electromagnetic wave absorption.\nIt...",
        "source": "smcp",
        "date": "2025-10-24T15:00:59+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330025/chinese-team-unveils-smart-super-tough-coating-stealth-aircraft?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bfc6bf4d486ced22f84b728a7e7029cb58f5a291aae66df98fab5b641604c8e6",
        "title": "Nexperia China defies Dutch headquarters’ order to oust executive",
        "summary": "Nexperia’s Chinese subsidiary has publicly rejected a decision by the Dutch headquarters to remove John Chang as vice-president of global sales and marketing, declaring the dismissal legally ineffective in China and escalating a conflict that has garnered international attention.\nNexperia China, the chipmaker’s primary entity in the country, said the dismissal “shall not have legal effect within the jurisdiction of China”, claiming it violated local company and labour laws, according to a...",
        "source": "smcp",
        "date": "2025-10-24T13:00:13+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3330152/nexperia-china-defies-dutch-head-offices-order-remove-veteran-chinese-executive?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0a543673fc71001c0af695a3b6d13563ad93e7d1847c9cf432e0926840160c05",
        "title": "China aims to overcome adversity with tech, self-reliance – as it happened",
        "summary": "This live blog has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing.\nAfter China’s ruling Communist Party concluded the fourth plenum of its powerful Central Committee on Thursday, a press conference was held on Friday morning to review the events of the conclave and the committee’s conclusions.\nAmong those who attended the briefing were the head of the country’s top economic planner, the minister of commerce, the minister...",
        "source": "smcp",
        "date": "2025-10-24T10:50:18+09:00",
        "url": "https://www.scmp.com/economy/policy/article/3330134/chinas-communist-party-meets-press-after-fourth-plenum-wraps?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bcf9ce2121dc199c69f0eab9241f6c822f1fecf750498d9b627c96e0f76099b9",
        "title": "How strategic planning is powering China’s green energy transition",
        "summary": "Recently, some major Western media outlets have focused on China’s embrace of clean energy technologies. Between the lines of the rhetoric on China becoming an “electrostate”, there is palpable anxiety about US President Donald Trump’s “drill, baby, drill” approach and the partisan political landscape.\nThe New York Times highlighted one of China’s longest ultra-high-voltage power lines, stretching from the far northwest remote desert to the populous southeast, noting that these power lines are...",
        "source": "smcp",
        "date": "2025-10-24T10:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3329944/how-strategic-planning-powering-chinas-green-energy-transition?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "163cfdb1690811fff09f97568c77b418df8a84bc9613a7fcbee001cb68a9c8ad",
        "title": "BeOne Medicines to expand cancer-drug offerings in Hong Kong",
        "summary": "BeOne Medicines, a global drug company that originated as a research and development firm in Beijing, plans to launch more cancer drugs in Hong Kong and expand production in Guangzhou to tap greater market opportunities arising from local drug-approval reforms two years ago.\nThe company has brought three types of cancer medications to Hong Kong so far and intends to seek approval from local health authorities to cover additional medical indications by the end of this year.\n“The Guangzhou...",
        "source": "smcp",
        "date": "2025-10-24T08:30:09+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3330043/beone-medicines-bring-more-cancer-drugs-hong-kong-thanks-easier-approval-regime?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a0ca58827b686324aeb070f5d56835fdc9f1e82b4c9a41ebd9e1eedd54332aed",
        "title": "Crypto cooperation between Hong Kong, mainland China to benefit sector: experts",
        "summary": "Increased collaboration between Hong Kong and mainland China could potentially lead to more advances in the cryptocurrency sector, according to industry experts who took part in the 11th Global Blockchain Summit in Shanghai on Thursday.\nThat assessment comes amid the central government’s years-long ban on a range of crypto-related activities on the mainland, including initial coin offerings, cryptocurrency trading and bitcoin mining.\nCalls for Hong Kong and the mainland to collaborate in...",
        "source": "smcp",
        "date": "2025-10-24T08:00:11+09:00",
        "url": "https://www.scmp.com/tech/blockchain/article/3330106/crypto-collaboration-between-hong-kong-and-mainland-china-benefit-sector-experts-say?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c4717cff8146b43dae74b7aceb9bb73ec3ddf26fbf96bfe6ab855c518c2e7f15",
        "title": "Trump to meet Xi in South Korea next Thursday as part of key Asia trip",
        "summary": "US President Donald Trump will meet Chinese President Xi Jinping on October 30 in South Korea, the White House confirmed.\n“On Thursday morning local time, President Trump will participate in a bilateral meeting with President Xi of the People’s Republic of China,” White House press secretary Karoline Leavitt said at a briefing on Thursday.\nThe meeting between the two leaders will take place at the end of a trip by the US president to Asia, which will begin in Malaysia, continue to Japan and...",
        "source": "smcp",
        "date": "2025-10-24T07:57:03+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3330131/donald-trump-meet-chinas-xi-jinping-next-thursday-south-korea-crunch-talks?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8372fcf9a17a1b412d1c6f686952d6ce30abc56937e8e871d4dd475467e49dcb",
        "title": "Does Switzerland beat China in innovation? Ranking raises questions about bias",
        "summary": "China topped the world in knowledge and technology outputs this year in a leading innovation index, driven in large part by its scientific productivity, patent applications and hi-tech exports.\nDespite its strong showing in sci-tech output, China came in 10th overall in the World Intellectual Property Organisation (Wipo)’s annual Global Innovation Index (GII) released last month.\nIt was Switzerland that took the top spot in the ranking for the 15th year in a row, raising questions among some in...",
        "source": "smcp",
        "date": "2025-10-24T07:00:14+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330064/does-switzerland-beat-china-innovation-new-ranking-raises-questions-about-bias?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "228aed91b07997118fe5035623dd154a76e47d5b25517d3490a9f9fa933f704f",
        "title": "Why Beijing is taking a gloves-off approach to rare earth exports",
        "summary": "To justify his threat of a 100 per cent tariff on imports from China, US President Donald Trump framed China’s tightening of its export controls on rare earths as “hostile”. However, Beijing’s expanded rules are a direct and reasonable response to the Trump administration’s relentless campaign of ratcheting up restrictions on Chinese companies and exports.\nOn September 12, just two days before US-China trade talks in Madrid, Spain, the US blacklisted 23 Chinese institutions.\nOn September 25,...",
        "source": "smcp",
        "date": "2025-10-24T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3329905/beijings-rare-earth-export-control-regime-blowback-us-policy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "261d4ff36297cec8c95361b555511c9e174e57531981c0a03fc5e81a1829328b",
        "title": "Plug pulled on Chinese firm Gotion’s US plant, days before Trump meets Xi",
        "summary": "After years of fiery protests, lawsuits and intense scrutiny over alleged Communist Party ties, the plan for a controversial multibillion-dollar Chinese electric vehicle battery plant in Michigan is officially dead.\nThe setback comes just days before President Xi Jinping will meet US counterpart Donald Trump to talk about fair trade and economic relations in South Korea.\nOn Thursday, the state’s economic arm announced that it had suspended US$175 million in grants for the enterprise after...",
        "source": "smcp",
        "date": "2025-10-24T03:56:02+09:00",
        "url": "https://www.scmp.com/news/us/economy-trade-business/article/3330126/ev-battery-maker-gotion-abandons-plan-build-us24-billion-factory-michigan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5d9431ed904f8c541d4e917049d4a892b23c8a8cfa2a35d84aa275093c66b4a6",
        "title": "Binance founder Zhao pardoned by Trump in latest crypto clemency",
        "summary": "Binance co-founder Zhao Changpeng has received a pardon from US President Donald Trump after he went to prison for failing to safeguard the world’s largest crypto exchange against money laundering.\n“President Trump exercised his constitutional authority by issuing a pardon for Mr Zhao, who was prosecuted by the Biden administration in their war on cryptocurrency,” said White House spokeswoman Karoline Leavitt.\nZhao wrote in a social media post that he was “deeply grateful for today’s pardon and...",
        "source": "smcp",
        "date": "2025-10-24T02:31:23+09:00",
        "url": "https://www.scmp.com/news/world/united-states-canada/article/3330124/binance-founder-zhao-pardoned-trump-latest-crypto-clemency?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "693e5f8899e0900cdd484a694cfb390c56f96eba69ec4d2b97d81a79f519dc71",
        "title": "US lawmakers urge Trump to press Xi on American detainees, exit bans",
        "summary": "A group of US Republican lawmakers is urging President Donald Trump to confront Chinese President Xi Jinping at an expected summit next week about Americans they view as unjustly detained or barred from leaving China, framing Beijing’s use of exit bans and detention as “tools” to gain leverage.\nIn a letter released on Thursday, three Republicans – Senator Dan Sullivan of Alaska, Representatives Chris Smith of New Jersey and John Moolenaar of Michigan – highlighted the cases of two Americans,...",
        "source": "smcp",
        "date": "2025-10-24T01:54:06+09:00",
        "url": "https://www.scmp.com/news/us/article/3330123/us-lawmakers-urge-trump-press-xi-american-detainees-exit-bans?utm_source=rss_feed",
        "reportUrl": ""
    }
]