[
    {
        "id": "9c8ba3d0f9c766ed7b9abc0dd92670f63ed93e8f4ac1f8917c7b6bb4c3223ab2",
        "title": "AI stock opportunities lie in ‘battleground’ sectors, not ‘titans’, BofA Securities says",
        "summary": "Global investors should shift their focus from Asia’s dominant AI hardware “titans” to a growing group of mid-cap “battleground” sectors that offer stronger growth potential amid intensifying competition, according to BofA Securities.\nIn a report, analysts from the Bank of America investment banking arm mapped more than 330 Asian stocks across 22 subsectors in the artificial intelligence technology layer – representing market capitalisation of nearly US$6 trillion. The most compelling...",
        "source": "smcp",
        "date": "2025-12-12T08:30:08+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3336110/ai-stock-opportunities-lie-battleground-sectors-not-titans-bofa-securities-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b1343b83e5d663b23735aca58ef579800e9b916aa51b0c135b51d0c6e21e5cf2",
        "title": "Why South Korea poses a major challenge to China’s Middle East arms sales drive",
        "summary": "Rising tensions in the Middle East despite the fragile ceasefire agreement in Gaza are continuing to fuel demands for arms in a region where China has emerged as a major supplier.\nAs well as supplying drones and missiles, China is looking to expand its offering into advanced weapons systems, such as fighter jets, but is facing increasing competition from a near neighbour: South Korea.\nWhile both have opportunities to expand arms exports, analysts said South Korea was relatively better positioned...",
        "source": "smcp",
        "date": "2025-12-12T07:00:19+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3336039/why-south-korea-poses-major-challenge-chinas-middle-east-arms-sales-drive?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a023404f3ded9a6fb08e7eb2a83492e45f62d98e30ecb9d9a9611e199327085c",
        "title": "Fill US Arctic affairs post to halt China and Russia’s rise, senior Democrat urges Rubio",
        "summary": "The senior Democrat on a US congressional committee focused on China is urging Secretary of State Marco Rubio to fill the State Department’s vacant post for Arctic affairs, citing intensifying competition with Beijing and adding to growing pressure to address the vacancy.\nThe Ambassador-at-Large for Arctic Affairs leads US engagement with the eight-country Arctic Council and coordinates American interests related to safety and security, economic development and intergovernmental cooperation. The...",
        "source": "smcp",
        "date": "2025-12-12T05:05:25+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3336131/senior-us-democrat-urges-rubio-fill-arctic-affairs-post-halt-china-and-russias-rise?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0387a40f2d632bbfc3e9309fc227d8f0a050a2dcb47e5ff4d675547aa800d835",
        "title": "Mexico slaps tariffs of up to 50% on Chinese goods as US trade pact review looms",
        "summary": "Mexican President Claudia Sheinbaum on Thursday defended her government’s decision to impose new import tariffs, hours after the Senate approved legislation allowing duties of up to 50 per cent on more than 1,400 products from Asian countries.\nThe measure, widely seen as aimed at curbing Chinese imports, comes as Mexico prepares for a review of its trade agreement with the United States and Canada next year.\nSheinbaum described the move as part of her administration’s plan to strengthen domestic...",
        "source": "smcp",
        "date": "2025-12-12T04:56:42+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3336130/mexico-slaps-tariffs-50-cent-chinese-goods-us-trade-pact-review-looms?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b8ab868a9c4819d707b467192106101ca231d33ac38d6c964bed1c671c25b7cd",
        "title": "Brussels ramps up China de-risking while France and Germany pull further apart",
        "summary": "With the end of the year approaching, the European Commission is rapidly ramping up its de-risking efforts through a flurry of broadsides against Chinese firms – even as the bloc’s most powerful member states appear to be moving in different directions on China.\nForeign subsidy regulation probes were launched against online retailer Temu and Nuctech, a maker of airport scanning equipment, on Wednesday and Thursday respectively.\nE-commerce giant Temu saw its Dublin headquarters raided by...",
        "source": "smcp",
        "date": "2025-12-12T02:56:21+09:00",
        "url": "https://www.scmp.com/news/china/article/3336127/brussels-ramps-china-de-risking-while-france-and-germany-pull-further-apart?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b7052b31a7e4321b7163747b53f6efe0880521f3edeb2bd4ad88bdb007d115f6",
        "title": "China-Japan row has left US’ Donald Trump facing ‘dilemma’: analyst",
        "summary": "The Trump administration is possibly facing a “dilemma” as tensions between China and Japan intensify, one Chinese analyst has suggested, while another noted that any breakthrough in the diplomatic dispute still hinged on direct engagement between the two Asian neighbours.\nThis week, the downward spiral in ties between China and Japan showed no signs of easing.\nBeijing issued another travel warning targeting Japan on Thursday – less than four weeks after its previous advisory – this time citing...",
        "source": "smcp",
        "date": "2025-12-12T00:00:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3336106/china-japan-row-has-left-us-leader-donald-trump-facing-dilemma-analyst?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "770ce3036841311a852110d9b80e19fe861c84340702427488931a1bbc880fa7",
        "title": "First flight of China’s giant drone carrier Jiu Tian signals PLA swarm capacity boost",
        "summary": "China’s massive aerial drone carrier the Jiu Tian has completed its first flight, adding to the potential swarming capacities of the People’s Liberation Army (PLA).\nThe Jiu Tian, which is itself a large drone, took to the air for the first time in the northwestern province of Shaanxi, state news agency Xinhua said on Thursday. The report did not mention when this took place.\nDesigned by the First Aircraft Institute of the state-owned aerospace giant Aviation Industry Corporation of China (AVIC),...",
        "source": "smcp",
        "date": "2025-12-11T22:20:05+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3336098/first-flight-chinas-giant-drone-carrier-jiu-tian-signals-pla-swarm-capacity-boost?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "261c5877ff5c2a5e6626e114e904afadc3f7cfc2c24f843bb920fbe4c53319ab",
        "title": "US signals China reset, Beijing-endorsed reincarnation in Tibet: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. US seeks ‘constructive’ reset with China as trade tensions ease: Greer\nUS Trade Representative Jamieson Greer says the United States is striving for a more “constructive” relationship with China after this year’s trade war, even as disputes over minerals and AI chips persist.\n2. US commission wants more Mandarin language courses to curb Beijing’s sway\n\nA...",
        "source": "smcp",
        "date": "2025-12-11T22:15:07+09:00",
        "url": "https://www.scmp.com/news/china/article/3336101/us-signals-china-reset-beijing-endorsed-reincarnation-tibet-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6458f86985c7b936960b862423bd16c21105d28840c3c8481bf8fd940f8cd1b1",
        "title": "China may tap Nvidia’s H200 for AI gains but domestic chip strategy here to stay: analysts",
        "summary": "Beijing’s push to advance the domestic chip industry will remain unchanged regardless of whether it allows Chinese companies to buy Nvidia’s H200, analysts said.\nDays after US President Donald Trump announced Washington would permit Nvidia to ship the chips to approved Chinese customers – on the condition that 25 per cent be “paid” to the United States – Beijing has yet to publicly state whether it will approve purchases.\nSo far, the Ministry of Foreign Affairs has issued the only official...",
        "source": "smcp",
        "date": "2025-12-11T22:00:18+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3336100/china-may-tap-nvidias-h200-ai-gains-domestic-chip-strategy-here-stay-analysts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bc05a6e30e091ba6a67efca607b664886a653bc4b7b7038105a7157cd81c215f",
        "title": "WHO responds to agency chief’s alleged pledge to ‘strengthen ties’ with Taiwan",
        "summary": "The World Health Organization said on Wednesday that its position on Taiwan remained unchanged, after Japan’s finance minister claimed that the health body’s chief executive intended to strengthen ties with the island.\nOn December 6, Japan’s Minister of Finance Satsuki Katayama stated in a social media post in Japanese that, during a visit to Tokyo, the WHO director general had “explicitly [stated] his intention to strengthen ties” with Taiwan.\nThe post followed a forum in Tokyo on universal...",
        "source": "smcp",
        "date": "2025-12-11T21:17:54+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3336104/who-responds-agency-chiefs-alleged-pledge-strengthen-ties-taiwan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c41e011eab460afdc6e0e5cb69b0a9b1d67e9730b310cb187d4179ee16b11e07",
        "title": "US military sends show of support to Japan as China’s navy, air drills continue",
        "summary": "US bombers and stealth fighters took part in a joint military exercise with Japan on Wednesday while an American aircraft carrier arrived at a Japanese port on Thursday, in a show of force amid heightened tensions between Beijing and Tokyo.\nJapanese Self-Defence Forces (SDF) and the US military conducted the exercise “amid an increasingly severe security environment surrounding Japan”, Tokyo’s Ministry of Defence said on Thursday.\n“Through this exercise, we confirmed the strong commitment of...",
        "source": "smcp",
        "date": "2025-12-11T20:00:12+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3336085/us-military-sends-show-strength-japan-chinas-navy-air-drills-continue?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "503130e49efc84597dfc8683d674c4227072499d631abad1cc66b86a39d9bfa2",
        "title": "AI race: Meta reported to use Alibaba’s Qwen for ‘Avocado’ model in likely win for China",
        "summary": "American tech giant Meta Platforms is reportedly using an open-source artificial intelligence model developed by Alibaba Group Holding to reinvigorate its faltering AI efforts in another likely win for Chinese AI.\nAccording to a Bloomberg report on Wednesday, Facebook owner Meta was using Alibaba’s Qwen model, along with other open-source models from Google and OpenAI, as part of the training process for a new model code-named Avocado, which was expected to be released in the spring.\nThe report...",
        "source": "smcp",
        "date": "2025-12-11T20:00:08+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3336073/ai-race-meta-reported-use-alibabas-qwen-avocado-model-likely-win-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ec4df7c28ed4148009999d18b2f0211317c0b8f7d32d59e82b003baa1050769e",
        "title": "China sets sights on ‘fully tapping’ domestic market potential after tone-setting meet",
        "summary": "China has pledged to build a robust domestic market to counter external risks following a high-level policy meeting – a strategy that analysts say signals more pro-growth measures and a better balance between supply and demand.\nThe central economic work conference – an annual gathering of the Central Committee of the ruling Communist Party and the State Council, China’s cabinet – concluded on Thursday with a nationwide call to “strengthen our own capabilities to cope with external challenges”,...",
        "source": "smcp",
        "date": "2025-12-11T18:47:50+09:00",
        "url": "https://www.scmp.com/economy/policy/article/3336076/china-stresses-domestic-demand-after-closely-watched-economic-conference?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fab1ab06dae771664fce6f57fc260f98bee26a6f58df61e6fdbd7dec391c2536",
        "title": "Studio Ghibli co-founder Hayao Miyazaki’s Chinese show cancelled as Japan row rumbles on",
        "summary": "An exhibition based on the works of the celebrated Japanese animator Hayao Miyazaki in the southern Chinese city of Guangzhou has been postponed as relations between the two countries continue to deteriorate.\nStudio Ghibli, the Oscar-winning anime studio which Miyazaki co-founded, announced the decision on Tuesday without giving a reason.\n“We apologise to the audience who have been looking forward to this event, and sincerely thank you for your understanding and support,” the statement said....",
        "source": "smcp",
        "date": "2025-12-11T18:23:26+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3336057/studio-ghibli-founder-hayao-miyazakis-chinese-show-cancelled-japan-row-rumbles?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0a643c32a535ed49311536aef32cc17e440957565b7e9123edb12a1faffa3b7a",
        "title": "Beijing urges Dutch government to push for China visit by Nexperia execs",
        "summary": "China has urged the Dutch government to push the Netherlands arm of semiconductor manufacturer Nexperia to send personnel to China, Beijing’s commerce ministry said during a press conference on Thursday.\nThe Dutch embassy in China has been asked to urge The Hague’s Ministry of Economic Affairs to “implement the consensus reached in consultations” and encourage the Nijmegen-headquartered company to dispatch its representatives to China “as soon as possible”, ministry spokesman He Yadong...",
        "source": "smcp",
        "date": "2025-12-11T17:55:11+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3336048/beijing-urges-dutch-government-push-china-visit-nexperia-execs?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f7f8e1839ba5adda8d1f927fece1292e191d36ae1efd482bf65354d1cbf6daff",
        "title": "How China is cementing its central role as the architect of green tech",
        "summary": "In the first three quarters of this year, China added 310 gigawatts of renewable energy capacity, up 47.7 per cent year on year and accounting for 84.4 per cent of all new power installations in the country, according to the National Energy Administration. This progress is more than climate leadership or capacity building; it involves a holistic reconstruction of the energy system.\nChina is replacing the 20th-century fossil fuel order with a 21st-century “electro-industrial order” where power...",
        "source": "smcp",
        "date": "2025-12-11T17:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3335658/how-china-cementing-its-central-role-architect-green-tech?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "174ddd4ca6dd098580193aa93bac8a8ab861b71ae5a0d039155da3a7bde17766",
        "title": "China can sustain 5 to 6% GDP growth through 2035: economist",
        "summary": "A prominent Chinese economist said the country can sustain annual economic growth of 5 to 6 per cent over the next decade and stabilise relations with the United States by the middle of the century, as it seizes opportunities from the fourth industrial revolution.\nJustin Lin Yifu, dean of the Institute of New Structural Economics at Peking University and a former chief economist at the World Bank, said China could achieve breakthroughs in US technology “choke points” within five years and raise...",
        "source": "smcp",
        "date": "2025-12-11T17:00:08+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3336036/china-can-sustain-5-6-gdp-growth-through-2035-economist?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bf017995c7340d4efc64941778e84ab0f75833f135249aecfacb5309c1569302",
        "title": "Hegseth’s G2 description for US-China relations ‘deeply problematic’, House Democrat warns",
        "summary": "Defence Secretary Pete Hegseth’s characterisation of US-China relations as a “G2” partnership is “deeply problematic”, a Democratic lawmaker has warned in a letter to the Pentagon chief.\nSuch a description sidelines Washington’s allies and partners in the region, House Representative Raja Krishnamoorthi said in his letter sent on Monday.\nKrishnamoorthi, a ranking member of the House Select Committee on the Chinese Communist Party, also expressed “profound concern” about such a label being used...",
        "source": "smcp",
        "date": "2025-12-11T15:25:24+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3336018/hegseths-g2-description-us-china-relations-deeply-problematic-lawmaker-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "44df5cf5c31e2a402d27ed97ce1e7d55fe04f8e5db060bf0f3d55b59bb3a124e",
        "title": "‘Major breakthroughs’: Chinese biotech firms plan global expansions after domestic success",
        "summary": "With their domestic profits narrowing and production capacity expanding, China’s firms are continuing to widen their overseas footprints in search of new, more lucrative markets. In this series, we examine China Inc.’s next phase of “going global” and the complex, challenging international environment its companies have chosen to enter.\nChinese biotech companies are expected to make major international advances over the next decade, industry leaders said, but cautioned that weak patent...",
        "source": "smcp",
        "date": "2025-12-11T15:00:15+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335582/major-breakthroughs-chinese-biotech-firms-plan-global-expansions-after-domestic-success?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cbc47cf14818c6a6d4ca0d659a1080979e80337f4717b164c8f6d4417b94ba02",
        "title": "Should Opec worry? China joins US shale oil revolution with deep fracking breakthrough",
        "summary": "China’s recent breakthroughs in fracking technology have the potential to usher in a new shale revolution that could solidify the country’s energy security and reshape the international oil order.\nThat would see China join the United States, whose shale boom earlier this century enabled it to become the largest crude oil producer in the world. This fundamentally altered the international oil market, with significant impact on oil exporters, particularly members of the Organisation of the...",
        "source": "smcp",
        "date": "2025-12-11T13:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3335949/should-opec-worry-china-joins-us-shale-oil-revolution-deep-fracking-breakthrough?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "49bdb2708c72574f7b3ba2d976617f9d5b7ab2b717b3c76ddd37631fef884c3e",
        "title": "Panchen Lama says reincarnation must follow Chinese laws, be endorsed by Beijing",
        "summary": "Reincarnation must follow Chinese laws and be endorsed by Beijing, Tibetan Buddhist leader Panchen Lama has said in an apparent reference to the succession of the Dalai Lama.\nSpeaking at an official symposium in Shigatse on Monday, the Panchen Lama – the second-highest figure in Tibetan Buddhism after only the Dalai Lama – stated that reincarnated “living Buddhas” must be identified within China and approved by the central government.\nThis must be done “without any interference or control from...",
        "source": "smcp",
        "date": "2025-12-11T10:00:13+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335933/panchen-lama-says-reincarnation-must-follow-chinese-laws-be-endorsed-beijing?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e3f925f68b7efdf1e545e2d20a33a6df884a1cb1ee2c61a16ad769bfcac6d2de",
        "title": "Less hype and more hardware: SenseTime banks on multimodal AI to regain its edge",
        "summary": "Chinese artificial intelligence pioneer SenseTime is betting that its roots in computer vision will help it lead the next phase of AI, as the industry shifts towards multimodal systems and embodied intelligence in the physical world, according to co-founder and chief scientist Lin Dahua.\nIn an interview with the Post on Wednesday, Lin said the company’s long-standing expertise in vision-based AI put it in a strong position to become a leader in embodied intelligence, robotics and AI agents...",
        "source": "smcp",
        "date": "2025-12-11T09:00:17+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3335922/less-hype-and-more-hardware-sensetime-banks-multimodal-ai-regain-its-edge?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e6e3927fba5ba824bee9e18d54ff01002b21ce3f81bddb0707fc9a72d24d51de",
        "title": "US commission wants more Mandarin language courses as Congress looks to curb Beijing sway",
        "summary": "A bipartisan commission focused on the rule of law and human rights in China is recommending that the US Congress scale up immersion programmes for Mandarin and other languages spoken on the mainland in American high schools and universities.\nThe recommendation, made as part of the Congressional-Executive Commission on China’s (CECC) annual report, comes as Washington has scaled back funding for cultural exchange programmes since the start of US President Donald Trump’s second administration.\nIt...",
        "source": "smcp",
        "date": "2025-12-11T07:46:52+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3335974/us-commission-wants-more-mandarin-language-courses-congress-looks-curb-beijing-sway?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0fc428a50e13900b5a37246540632065f831b1e11633d594c0375eb8947bc2c4",
        "title": "First China ore shipment rewards Guinea coup leader’s push for Simandou alliance",
        "summary": "The Simandou mountain range in southeastern Guinea, once a dense forest where exploration teams relied on GPS and helicopters to navigate, has yielded vast reserves of its sought-after high-grade iron ore after decades of delay.\nWorkers struggled to define the layout of the thick forest before clearing the trees and brush at the site set for the Simandou Iron Ore project, “as it was nothing but darkness”, according to Chris Aitchison, the managing director for Rio Tinto’s Simfer joint...",
        "source": "smcp",
        "date": "2025-12-11T07:00:16+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335862/first-china-ore-shipment-rewards-guinea-coup-leaders-push-simandou-alliance?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3cab20eea1ec0098b2a70f6543f520eeef0afa639843516dae0d30855c66c728",
        "title": "US seeks ‘constructive’ reset with China as trade tensions ease: Greer",
        "summary": "The United States is striving for a more “constructive” relationship with China after this year’s trade war and will continue to pursue a “managed” bilateral trade relationship, its chief trade envoy said, despite concerns lingering over China’s grip on critical minerals and pushback over the White House’s recent approval of H200 AI chip sales.\nThe comments by US Trade Representative Jamieson Greer came after Beijing and Washington fought fiercely throughout the year over tariffs.\nThe Chinese...",
        "source": "smcp",
        "date": "2025-12-11T04:51:45+09:00",
        "url": "https://www.scmp.com/news/china/article/3335970/us-seeks-constructive-reset-china-trade-tensions-ease-greer?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "67a0623fef211111bcb9ec5bcd9f9d2203b4e08c0e184e1ea55d66b557b72762",
        "title": "US Fed delivers quarter-point rate cut as policymakers weigh inflation outlook",
        "summary": "The US central bank announced on Wednesday it would slash the benchmark interest rate by a quarter of a percentage point, though this year’s third cut has long been criticised by President Donald Trump as too late and too little.\nThe cut decision made by the Federal Open Market Committee (FOMC), the monetary-policy organ affiliated to the Federal Reserve, was broadly in line with market expectations, but fell short of Trump’s demand of a larger cut. The benchmark interest rate after the...",
        "source": "smcp",
        "date": "2025-12-11T04:09:51+09:00",
        "url": "https://www.scmp.com/news/us/economy-trade-business/article/3335968/us-fed-delivers-quarter-point-rate-cut-trump-renews-pressure-central-bank?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "21698b841d3d0c37715e35c5dfd577afa059e2601c15f842d7289a4fb60bc68c",
        "title": "China faces 2026 marked by economic strains and uneasy rivalry with US: Asia Society",
        "summary": "Beijing and Washington will continue to circle each other warily in 2026 even as China’s leadership struggles to balance economic growth against its control fixation, according to a report on next year’s outlook for China released on Wednesday by the Asia Society.\n“As we look towards 2026, the story is not one of rises or triumph. It’s not black or white,” said Lizzi Lee, a fellow at the Society’s Centre for China Analysis and one of the report’s co-authors. “It is a story of transitions,...",
        "source": "smcp",
        "date": "2025-12-11T01:36:29+09:00",
        "url": "https://www.scmp.com/news/china/money-wealth/article/3335961/china-faces-2026-marked-economic-strains-and-uneasy-rivalry-us-asia-society?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9f2d7e51c5620963d35c80aa459f7e80f47827d99af7832d9802421a4fc63743",
        "title": "China pledges aid to Latin America, Caribbean with no ‘political conditions’",
        "summary": "China has promised no-strings-attached aid to Latin American and Caribbean countries as it positions itself as a key voice of the Global South and seeks to expand its influence in a region also actively courted by the United States.\nIn an updated policy framework for deeper economic cooperation with the region, Beijing highlighted what it described as a “significant shift in the international balance of power”, with the Global South gaining greater influence.\nThe strategy paper, the third of its...",
        "source": "smcp",
        "date": "2025-12-11T00:00:14+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335901/china-pledges-aid-latin-america-caribbean-no-political-conditions?utm_source=rss_feed",
        "reportUrl": ""
    }
]