[
    {
        "id": "d8d85a8b0976b5647560182d7fb20dd695f697068515f7cad78908912c9af367",
        "title": "Mexico stands by 50 per cent tariffs on Chinese goods, says move will protect 350,000 jobs",
        "summary": "Economy Secretary Marcelo Ebrard on Monday defended Mexico’s decision to impose new tariffs on imports from China and other Asian countries, describing the move as a necessary step to protect hundreds of thousands of domestic jobs rather than a provocation to any trading partner.\nThe tariff package, approved by Congress last week, will take effect on January 1 and introduce duties ranging from five to 50 per cent on 1,463 products from countries without trade agreements with Mexico. These...",
        "source": "smcp",
        "date": "2025-12-16T03:27:17+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3336547/mexico-stands-50-cent-tariffs-chinese-goods-says-move-will-protect-350000-jobs?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ad56d81e287ea171640d4b29fdc734ead7616d8a12d77069b0b125696db99184",
        "title": "China’s latest stealth endurance drone, CH-7, completes maiden flight",
        "summary": "China’s latest long-endurance stealth unmanned aerial vehicle (UAV), the CH-7, has completed its maiden flight, further expanding Beijing’s rapidly growing arsenal of autonomous weapons.\nState broadcaster CCTV said on Monday that China’s new high-altitude, high-speed, long-endurance CH-7 had recently completed its first flight.\nThe drone offered long endurance, stealth and high cruising speed, meeting the needs of ground observation, data support and communication under complex conditions, the...",
        "source": "smcp",
        "date": "2025-12-15T23:00:10+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3336520/chinas-latest-stealth-endurance-drone-ch-7-completes-maiden-flight?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "40cca7845b5a48433a0ebef7f7f4ef95026cf7aa4a68c44d1e2186d8c71a26a8",
        "title": "Tokyo’s latest bid to ease tensions with Beijing, Liu Cixin on AI: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Tokyo spells out part position on Taiwan in bid to ease tension with Beijing\nThe Japanese government has spelled out its position on Taiwan – although only in part – based on the 1972 document that normalised diplomatic ties to ease tensions, but insists the Taiwan issue should be resolved “peacefully through dialogue”.\n2. Sci-fi writer Liu Cixin on why...",
        "source": "smcp",
        "date": "2025-12-15T22:15:08+09:00",
        "url": "https://www.scmp.com/news/china/article/3336499/tokyos-latest-bid-ease-tensions-beijing-liu-cixin-ai-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8ee892a65f5868e73f56f43ca552f34d92fad2ed19a86772a164a750fa51dc73",
        "title": "Why China’s growing demand for rare-earth steel is bad news for US F-35",
        "summary": "At a sprawling industrial complex in the Inner Mongolian city of Baotou, workers feed bag after bag of rare-earth additives into roaring furnaces, turning ordinary steel into a high-performance alloy worth twice as much.\nThis is the front line of a technological leap being powered by China’s dominance in critical minerals and its strategic industrial policy.\nThe advanced rare-earth steel being produced is used in the country’s most ambitious engineering projects – from high-speed railways to...",
        "source": "smcp",
        "date": "2025-12-15T22:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3336457/why-chinas-growing-demand-rare-earth-steel-bad-news-americas-f-35?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "25fe68ef881753fc083c47426195fddf58434ba0b229a9a4caca05f489bba6ee",
        "title": "China’s fertility push: IVF grants grow, but high costs still deter couples",
        "summary": "From cash handouts to reimbursed procedures, local governments across China are throwing money at in vitro fertilisation and related fertility treatments in a bid to coax couples into having children.\nBut some experts warn that the hi-tech push ignores the low-tech reality: raising a family is simply too expensive, and fertility subsidies cannot reverse China’s demographic decline.\nJingmen, a city in central Hubei province, is the latest to join the fray, announcing subsidies of up to 10,000...",
        "source": "smcp",
        "date": "2025-12-15T21:30:16+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3336505/chinas-fertility-push-ivf-grants-grow-high-costs-still-deter-couples?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e99055b1c8214b3da8d90e2c3515553b8db2e466ed8304c32f50b488bbcfcc22",
        "title": "US global retreat shows Japan’s folly in defying China",
        "summary": "Retrenchment appears to be the buzzword following the Trump administration’s release of its new National Security Strategy (NSS). Under the heading “Balance of Power”, the report states that “the US rejects the ill-fated concept of global domination for itself”. And under “burden-sharing and burden-shifting”, it says that “the days of the US propping up the entire world order like Atlas are over”.\nThe document asserts a “‘Trump corollary’ to the Monroe Doctrine” and vows to “restore American...",
        "source": "smcp",
        "date": "2025-12-15T21:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3336030/us-global-retreat-shows-japans-folly-defying-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7c9ac66cadcb7bc055890df1050b6d460ffac066cb8b70b4d22db7cd5e9f11a6",
        "title": "Chinese main battle tank, upgraded for high altitudes, could be sent to border with India",
        "summary": "One of China’s newest main battle tanks, the Type 99B, is an upgraded model designed to perform better in high-altitude and cold weather operations, according to state media – suggesting it could be sent to the Himalayan border with India.\nThe tank is the latest of the Type 99 armoured vehicles and was among the military hardware unveiled during China’s huge Victory Day parade in Beijing in September.\nState broadcaster CCTV reported on Thursday that the upgraded model has a raft of new features....",
        "source": "smcp",
        "date": "2025-12-15T21:00:30+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3336467/chinese-main-battle-tank-upgraded-high-altitudes-could-be-sent-border-india?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a24c526e8b44771156fb7655a9a878d0d78e02bd6b208e1fdc28b462c931591f",
        "title": "China-led Asia-Pacific region lifts global aviation outlook as profits set to soar",
        "summary": "The global air travel market has bounced back to pre-pandemic levels, with the industry upbeat about 2026 and the Asia-Pacific region expected to lead worldwide traffic growth, the International Air Transport Association (IATA) said on Monday.\nLoad factors in Asia-Pacific were projected to hit an all-time regional high of 84.4 per cent next year, according to IATA, which represents some 370 airlines, accounting for more than 80 per cent of the world’s air traffic.\nPassenger demand was strong,...",
        "source": "smcp",
        "date": "2025-12-15T20:53:19+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3336513/china-led-asia-pacific-region-lifts-global-aviation-outlook-profits-set-soar?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d3dad1fc58a63a3af2093a7fe7073b285e04c9b9de320c06350a68f5950f12a3",
        "title": "Shenzhen sets travel record as rail station handles 116 million trips in 11 months",
        "summary": "Shenzhen’s main railway station handled a record 116.6 million passengers in the first 11 months of 2025, as China’s major cities continue to see a boom in rail ridership and travel between Hong Kong and mainland China picks up steam.\nThe total passenger flow at Shenzhen North Railway Station between January and November was up 8.8 per cent compared with the same period last year, according to data from China State Railway Group cited by local media.\nShenzhen North is one of the two largest...",
        "source": "smcp",
        "date": "2025-12-15T20:30:09+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3336497/shenzhen-sets-travel-record-rail-station-handles-116-million-trips-11-months?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c67771f4b861399eb3887e3d2abb4d5e009f490b2275be32e99021e1634246c9",
        "title": "China and Saudi Arabia pledge deeper hi-tech cooperation despite US pressure",
        "summary": "Saudi Arabia has pledged to deepen hi-tech cooperation with China in areas such as new energy and artificial intelligence.\n“Saudi Arabia is willing to further deepen cooperation with China in areas including oil and gas, new energy, artificial intelligence and high technology, to bring greater benefits to the peoples of both countries,” Crown Prince Mohammed bin Salman said, according to China’s Ministry of Foreign Affairs.\nThe pledge comes at a time when the kingdom is facing growing scrutiny...",
        "source": "smcp",
        "date": "2025-12-15T20:15:21+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3336508/china-and-saudi-arabia-pledge-deeper-hi-tech-cooperation-despite-us-pressure?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9cc2d7098eb858f015578193d6a7a4070dc5873d2e575e6541546e97cfe3c514",
        "title": "China accuses Philippines of ‘premeditated’ provocations near Sabina Shoal",
        "summary": "Beijing has accused Manila of organising a “premeditated” provocation and dangerous manoeuvres near a disputed reef in the South China Sea, and Washington of making false statements that have escalated tensions in the region.\nManila said Philippine fishing boats near Sabina Shoal had been targeted with water cannons by Chinese coastguard ships in an incident on Friday, while Beijing said Philippine personnel had threatened Chinese officers with knives.\nChinese foreign ministry spokesman Guo...",
        "source": "smcp",
        "date": "2025-12-15T20:14:14+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3336509/china-accuses-philippines-premeditated-provocations-near-sabina-shoal?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5302bc51b45ed43120f5d7c1f3f56dab861b582088d240c0c27406970cf45294",
        "title": "China’s scandal-hit Shaolin Temple urged to draw clear line between business and religion",
        "summary": "The Communist Party chief of Henan province has made an impromptu visit to the famed Shaolin Temple, whose former abbot was rounded up on corruption charges earlier this year, and called for a clear boundary between the temple and business.\nLiu Ning made the comments during his first inspection of the temple on Sunday, according to a report by the official Henan Daily.\nThe visit comes nearly five months after former abbot Shi Yongxin – known as “the CEO monk” – was abruptly removed amid...",
        "source": "smcp",
        "date": "2025-12-15T20:00:18+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3336493/chinas-scandal-hit-shaolin-temple-urged-draw-clear-line-between-business-and-religion?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "94b14d3c1e75a6f113c92bdb3155107e8c359b4529506d02658246dcf6c6ddfb",
        "title": "Sperm quality declining worldwide: could easy-to-use Chinese balm solve the crisis?",
        "summary": "In an attempt to solve the global fertility crisis, Chinese scientists have developed a balm for testicles they say can boost sperm activity.\nThe lotion they developed for external application significantly enhanced sperm quality in both animal trials and in vitro studies, regardless of whether the decline in function was caused by exposure to heavy metals, plasticisers, heat stress or natural ageing, the researchers said.\nThe findings of the study, conducted by researchers from several domestic...",
        "source": "smcp",
        "date": "2025-12-15T15:31:34+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3336452/worldwide-sperm-quality-decline-can-easy-use-balm-china-solve-crisis?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6b6838637108afb6d458216f163f174271ed73bbaadc32a9f78f814435171a13",
        "title": "China’s currency comeback: yuan seen as strong as 6.8 in 2026, breaking key dollar level",
        "summary": "China’s currency appears poised to break through the psychological 7.0-per-dollar barrier next year, fuelled by US Federal Reserve rate cuts and thawing trade tensions, with some bulls betting that the yuan could strengthen to 6.8.\nAnalysts and onlookers are increasingly optimistic, with some citing the potential for a relatively weaker US dollar and pointing to signs that Beijing’s policy support is stabilising the world’s second-largest economy.\nGuan Tao, a former senior official with China’s...",
        "source": "smcp",
        "date": "2025-12-15T15:30:41+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3336453/chinas-currency-comeback-yuan-seen-strong-68-2026-breaking-key-dollar-level?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4d30687b71d3318ae038c604f7a35e90d39ef41e64f16cc99ed40c3badc7111f",
        "title": "Tokyo spells out position on Taiwan, in part, in bid to ease tension with Beijing",
        "summary": "The Japanese government has spelled out its position on Taiwan – although only in part – based on the 1972 document that normalised diplomatic ties to ease tensions, while insisting that the Taiwan issue should be resolved “peacefully through dialogue”.\nIn a parliamentary session, Foreign Minister Toshimitsu Motegi repeated Tokyo’s position on Taiwan stated in the document that established and normalised diplomatic ties with Beijing and severed ties with Taipei – language Beijing has repeatedly...",
        "source": "smcp",
        "date": "2025-12-15T15:30:31+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3336449/tokyos-foreign-minister-spells-out-position-taiwan-bid-ease-tension-beijing?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a87202247cc33d8897533adbb84a79ea76418ff6c95c302313466e0b6e17f132",
        "title": "China’s home prices slide further in November as authorities vow to stabilise sector",
        "summary": "Home prices in mainland China continued to decline at a rapid pace in November, posing challenges for policymakers who have vowed to stem a years-long downturn.\nNew home prices fell 0.4 per cent month on month on average across 70 cities, according to data from the National Bureau of Statistics (NBS) on Monday. The decline eased slightly from a 0.5 per cent fall in October, but it was among the steepest in more than a year.\nPrices slipped 2.8 per cent year on year in November, compared with a...",
        "source": "smcp",
        "date": "2025-12-15T14:19:54+09:00",
        "url": "https://www.scmp.com/business/article/3336438/chinas-home-prices-slide-further-november-authorities-vow-stabilise-sector?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "551fcc5d9d2244054973fc09406d5482f5476b750fc098d962cd22d9c57fc8a3",
        "title": "Chinese mining giant CMOC pays US$1 billion for Brazilian gold mines with 8 tons of output",
        "summary": "CMOC Group, one of China’s biggest miners, extended its push into precious metals with a US$1 billion deal to buy the Brazilian operations of Equinox Gold.\nIt will take full ownership of two Equinox entities – Leagold LatAm Holdings and Luna Gold – that control several mines or deposits in the South American nation. Equinox will receive US$900 million in cash, plus a contingent payment of as much as US$115 million one year after the deal closes, CMOC said in an exchange filing on Monday.\nThe...",
        "source": "smcp",
        "date": "2025-12-15T13:55:15+09:00",
        "url": "https://www.scmp.com/business/commodities/article/3336437/chinese-mining-giant-cmoc-pays-us1-billion-brazilian-gold-mines-8-tons-output?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a48de76ae59e24dbb7e67018b8bb0d3afd6d9dd7ebfa52380b39074446dfa690",
        "title": "Beijing sanctions former Japanese military chief for ‘colluding with Taiwan separatists’",
        "summary": "Beijing has imposed sanctions on Shigeru Iwasaki, former chief of the Joint Staff of the Japan Self-Defence Forces, saying he had “colluded with separatist forces” in Taiwan, the Chinese foreign ministry said on Monday.\nIt comes after Beijing lodged a protest with Tokyo in March over the appointment of Iwasaki, a retired four-star air force general, as an honorary adviser to the Executive Yuan, the Taiwanese government’s highest administrative body.\nAs Japan’s chief of the Joint Staff from 2012...",
        "source": "smcp",
        "date": "2025-12-15T11:19:36+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3336421/china-sanctions-japanese-ex-official-colluding-separatist-forces-taiwan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cbcfbe35f7fcb49e6c1918c7e272197058d4921c467068a9ef6ad33542f3a295",
        "title": "China’s growth engines sputter as retail and investment hit in November",
        "summary": "China faces mounting pressure to ramp up stimulus as new data shows its growth engines sputtering, with retail sales growth slowing for six straight months and investment showing renewed signs of strain in November despite recent policy support.\nThe deceleration in consumption growth and the deepening property slump underscore the challenges Beijing faces in revitalising the economy heading into 2026.\nRetail sales, a key gauge of consumer spending, grew in November by just 1.3 per cent, year on...",
        "source": "smcp",
        "date": "2025-12-15T11:00:11+09:00",
        "url": "https://www.scmp.com/economy/economic-indicators/article/3336420/chinas-consumption-and-investment-show-weak-performance-november?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fea01e3fda97b4e37dee9c063f401d55b7269d51217d0d23f59aa0d15f905610",
        "title": "Beyond bipolar: why China-US rivalry defies the Cold War model",
        "summary": "The world has not slid into a simple US–China bipolar order but become “two superpowers and many strong powers”, veteran Peking University scholar Wang Jisi has warned, pointing to a relationship plagued by structural confrontation, deep misunderstandings and rising risks of conflict.\nIn a wide-ranging virtual conversation last Friday at the University of Hong Kong’s Centre on Contemporary China and the World (CCCW), Wang voiced concerns about America’s inward turn under US President Donald...",
        "source": "smcp",
        "date": "2025-12-15T10:00:22+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3336407/beyond-bipolar-why-china-us-rivalry-defies-cold-war-model?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f02ada74df41de14a2da7f95c5f738629309d00435081fc3fa02251fad2363c1",
        "title": "‘Rational optimist’: sci-fi writer Liu Cixin on why he’ll be happy if AI surpasses humans",
        "summary": "Liu Cixin is the most influential contemporary science fiction writer in China. He is best known for his trilogy that starts with The Three-Body Problem, for which he won a Hugo Award for best novel in 2015. The trilogy earned international acclaim and has been adapted for television in both Chinese and English.\nBorn in 1963 and raised in Shanxi, Liu started his working life as a computer engineer at a power plant in the central province. Inspired by British sci-fi author Arthur C. Clarke, Liu...",
        "source": "smcp",
        "date": "2025-12-15T07:00:19+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3336312/rational-optimist-sci-fi-writer-liu-cixin-why-hell-be-happy-if-ai-surpasses-humans?utm_source=rss_feed",
        "reportUrl": ""
    }
]