[
    {
        "id": "ab1cb7628d7af653d2fbfa2eea3024d3c2e3bf696dcf21c4307716dd4135eb91",
        "title": "Liu Qian on Chinese innovation, the US rivalry and women holding up half the sky",
        "summary": "Liu Qian is the founder of Wusawa Advisory and formerly the managing director of The Economist Group in Greater China. She is also a prominent advocate for gender equality, and the only Chinese representative in the core working group of the UN Women Leaders Network. In this interview, she discusses how Chinese innovation differs from Western innovation, where the US-China rivalry is headed and the critical role of women’s voices in policymaking.\nThis interview first appeared in SCMP Plus. For...",
        "source": "smcp",
        "date": "2025-10-20T07:00:16+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3329426/liu-qian-chinese-innovation-us-rivalry-and-women-holding-half-sky?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9d71de7904ba4c15689cd7f305f012b6deb9121315bc492cce006e193ec31f20",
        "title": "Will today’s great powers heed the example of Richard Nixon and Zhou Enlai?",
        "summary": "When Germany emerged as Europe’s industrial powerhouse in the 19th century, the established powers spent years attempting to contain it, culminating in a war no serious statesman desired, yet none proved skilful enough to prevent. Today, as we navigate the transition from American unipolarity, a similar question looms: will this shift follow that tragic pattern, or can it be managed through institutional adaptation as Zhou Enlai and Richard Nixon did in the early 1970s?\nThe multipolar order is...",
        "source": "smcp",
        "date": "2025-10-20T06:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3329275/will-todays-great-powers-heed-example-richard-nixon-and-zhou-enlai?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a8b1268416d18d055d8b54f4001c18e81766ae93abbf02d17688befcdf8b4ead",
        "title": "No major PLA activity near Taiwan after ‘troublemaker’ Lai’s policy speech",
        "summary": "The People’s Liberation Army (PLA) has refrained from conducting a large-scale drill near Taiwan following its leader’s annual policy speech – an address seen as less provocative than last year’s, which drew sabre-rattling from Beijing.\nFigures released by Taiwan’s defence ministry showed there was no increase in the number of PLA warplanes and warships detected near the island following William Lai Ching-te’s Double Tenth address on October 10.\nAccording to the Taiwanese figures, the PLA...",
        "source": "smcp",
        "date": "2025-10-19T23:00:10+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3329578/no-major-pla-activities-near-taiwan-after-troublemaker-william-lais-policy-speech?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8b0c8b61b66be4226e4ad3702dae7a8e5e26121bbe6ca19a79b8a76cf51bd9d9",
        "title": "China’s economy can grow by up to 5% over next 5 years, ex-finance official says",
        "summary": "China can sustain annual growth of 4.5 to 5 per cent over its next five-year plan period, former finance vice-minister Zhu Guangyao has said, just days ahead of a key Communist Party conclave to roll out the 2026-2030 blueprint.\n“We have full confidence that we will accomplish the economic development goal this year. The economic growth will be around 5 per cent,” Zhu said at a conference in Beijing on Friday, hosted by the Chongyang Institute for Financial Studies at Renmin University.\n“I...",
        "source": "smcp",
        "date": "2025-10-19T21:00:15+09:00",
        "url": "https://www.scmp.com/news/china/article/3329570/chinese-economy-can-grow-5-until-2030-ex-finance-vice-minister-zhu?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "25d13e4b1483a2b21a5072d5cb40a19305ae92ee430a1466cd69d520b398b6ae",
        "title": "Chinese firm thanks ‘sales consultant' Trump as tariff threat spurs orders",
        "summary": "A Chinese exporter said it has seen a sudden surge in orders as US humanoid robot makers and artificial intelligence (AI) companies – including industry leader OpenAI – rush to secure critical components amid Washington’s threat to impose an additional 100 per cent tariff on goods from the country.\nMyActuator, a Suzhou-based manufacturer of intelligent drive modules for humanoid robots, has received more than 1,000 new orders in the past week alone, according to a person familiar with the...",
        "source": "smcp",
        "date": "2025-10-19T21:00:10+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3329465/chinese-robotics-firm-thanks-sales-consultant-trump-tariff-threat-spurs-orders?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e006a5299c1e888e630046beeba4070f61e69599bf4b5d23b436566d306277be",
        "title": "Chinese minister calls out US ‘protectionism’ in shipping industry",
        "summary": "China’s Minister of Transport Liu Wei has called on shipping companies and port operators worldwide to promote free trade in a “concerted effort” to combat “protectionism” after the US administration slapped port fees on Chinese vessels.\n“All the companies dealing with shipping businesses should work together to promote a fair, just and open environment and safeguard the common interests of global economic and trade development,” he said at the North Bund Summit, a shipping industry ­conference,...",
        "source": "smcp",
        "date": "2025-10-19T20:15:16+09:00",
        "url": "https://www.scmp.com/business/markets/article/3329582/chinese-minister-calls-shipping-industry-fight-us-protectionism?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5308f3f1c18804d267cc39c659ee99636a8664bd59a12810e39d596904368e02",
        "title": "Xi congratulates new KMT leader, calls for efforts to ‘advance reunification’",
        "summary": "Chinese President Xi Jinping on Sunday sent his congratulations to the newly elected leader of Taiwan’s main opposition Kuomintang, Cheng Li-wun, calling for joint efforts to promote reunification.\nXi said he hoped both the mainland’s ruling Communist Party and the island’s KMT could “strengthen their common political foundation and unite the vast majority of people in Taiwan to deepen exchange and cooperation, boost common development, and advance national reunification”, according to state...",
        "source": "smcp",
        "date": "2025-10-19T19:10:24+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3329574/xi-congratulates-taiwans-new-kmt-leader-calls-efforts-advance-reunification?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cfb484e630c626e9dbded7a98fa67038ab5877de82f9cdec3a09cacab232093c",
        "title": "US-China tit-for-tat escalation is now a feature, not a bug",
        "summary": "Beijing has expanded export controls on rare earths. The latest move requires foreign buyers to obtain a Chinese export licence and extends controls to foreign-made products that use rare earths or technology from China.\nWashington shot back with threats of sweeping tariff hikes. Markets shuddered and supply-chain chiefs braced.\nThe stakes are systemic. China wields a chokepoint through its dominance in processing of rare earths and manufacture of magnets; the US wields the world’s most powerful...",
        "source": "smcp",
        "date": "2025-10-19T18:53:59+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3329374/us-china-tit-tat-escalation-now-feature-not-bug?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4556eca3e1d8ccd1d331a3a0d3552b6687428950a5eb000ed15e6cefbb41dccc",
        "title": "Nexperia China tells employees to ignore orders from Dutch head office",
        "summary": "Nexperia China, the local unit of the Dutch chipmaker, has told its employees to follow orders from local management and ignore instructions from the Dutch head office, according to a letter issued to employees over the weekend.\nIn open revolt against the headquarters in Nijmegen, the Netherlands, Nexperia China said in a Chinese-language statement on its official social media channel on Saturday that it was an “independent” Chinese entity and that Nexperia employees in China “should continue to...",
        "source": "smcp",
        "date": "2025-10-19T18:30:08+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3329565/nexperia-china-tells-employees-ignore-orders-dutch-head-office?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "dd5fbf3f6ecc9045cd3a13c6d87fada625a5ca4089e1ced78d24f5b9767eaccf",
        "title": "How China is pushing back the invading sand dunes and winning in arid Ningxia",
        "summary": "“The wind blows all the year round, not a bird in the sky nor a leaf can be found.” This saying, once common in northwest China’s arid Ningxia Hui autonomous region, captures the suffering inflicted on its communities by the desert.\nOver the past 40 years, the Baijitan National Nature Reserve has served as a frontline fortification against the Mu Us Desert for Ningxia’s capital Yinchuan and its nearly 3 million people.\nBy the 1950s, the desert had advanced to within 5km (3 miles) of the Yellow...",
        "source": "smcp",
        "date": "2025-10-19T17:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329077/how-china-pushing-back-invading-sand-dunes-and-winning-arid-ningxia?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e4335d8b4caa94b9d437199d4da059301ea1aeebe4b6d3184dac0931987d4fb1",
        "title": "China accuses US of carrying out cyberattacks on national time centre",
        "summary": "China’s top counter-espionage agency has accused the United States of conducting cyberattacks against the country’s national time centre, which it said could have had a severe impact on the orderly functioning of society.\nIn a social media post on Sunday, the Ministry of State Security said the US National Security Agency was behind a number of cyberattacks against China’s National Time Service Centre.\nThe centre – affiliated with the Chinese Academy of Sciences and based in Xian, Shaanxi...",
        "source": "smcp",
        "date": "2025-10-19T15:04:13+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3329558/china-accuses-us-carrying-out-cyberattacks-national-time-centre?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d4ef1b504ed1360777c458604ffe3dc4bd15266c0b35ee6cb81a611c6699cc3e",
        "title": "Taiwan’s leader proposes missile shield like Israel’s Iron Dome. Will it work?",
        "summary": "Taiwanese leader William Lai Ching-te wants the island to build a “T-Dome” missile shield – modelled after Israel’s Iron Dome. But his proposal has sparked debate over feasibility, given Taiwan’s disparate missile systems.\nLai unveiled his “T-Dome” plan during a Double Tenth Day address marking the 114th anniversary of the founding of the Republic of China – Taiwan’s official title.\nHe described it as a “multilayered air defence network” to protect critical infrastructure and population centres...",
        "source": "smcp",
        "date": "2025-10-19T13:01:09+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3329538/william-lai-wants-t-dome-missile-shield-taiwan-will-it-remain-pie-sky?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b975e71ac3c7764ab934d30c8aa210401518ad046e5997c0459e2e7697591ea3",
        "title": "China’s new hope in breaking reliance on foreign chipmaking machines",
        "summary": "AMIES Technology, a new Chinese lithography equipment manufacturer that showcased its latest chipmaking products at an industry event in Shenzhen last week, is offering renewed optimism in the nation’s drive to reduce its dependence on Dutch giant ASML.\nThe company presented a wide range of products – including compound-semiconductor lithography machines, laser-annealing systems, advanced inspection tools and solutions for packaging and wafer bonding – at the WeSemiBay Semiconductor Ecosystem...",
        "source": "smcp",
        "date": "2025-10-19T11:00:16+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3329508/meet-amies-chinas-new-hope-breaking-reliance-asmls-chipmaking-machines?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "424f9f70a5cb57469b1319ab4c80873f99eb50bf0e3c4fe875124a9b37f5215b",
        "title": "‘Work from the air’: Chinese airline offers free Wi-fi to lure back travellers",
        "summary": "China’s biggest airlines have started offering free Wi-fi to passengers on a growing number of domestic flights, as they vie to win back business travellers who now often prefer to shuttle between cities on high-speed trains.\nChina Eastern Airlines on October 11 launched a free “basic” Wi-fi service on all its widebody aircraft operating on domestic routes, said a company representative who spoke anonymously per company rules.\nThe planes cover a total of 37 routes serving major Chinese cities...",
        "source": "smcp",
        "date": "2025-10-19T11:00:09+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3329419/chinese-airline-offers-free-wi-fi-lure-back-travellers-high-speed-trains?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e893004629f8da008bd776f0a59c1e987f837123d30a1a985dbdd38cc747a319",
        "title": "‘Potassium railway’: China’s hidden card in the trade war",
        "summary": "Landlocked in the heart of Southeast Asia, Laos ranks among the world’s poorest nations.\nHowever, for over a decade, China invested heavily to build a dual-purpose passenger and freight railway through the thick rainforest between Kunming and Vientiane, the Laotian capital. This 1,000km (621-mile) rail line, with speeds of up to 200km/h (124 mph), has been operating quietly for four years.\nAccording to a Chinese government study released this month, this railway has become a critical conduit for...",
        "source": "smcp",
        "date": "2025-10-19T09:00:11+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3329355/potassium-railway-how-north-america-lost-trump-card-trade-war-china?utm_source=rss_feed",
        "reportUrl": ""
    }
]