[
    {
        "id": "47948f256e98a8f2a4d1ee7d7f8fec5c0869baac1a807a9b75b9dc1bb097309a",
        "title": "Why are tensions between China and Japan running so high now?",
        "summary": "While failing to see eye to eye is hardly new to Beijing and Tokyo, Sino-Japanese relations have been especially strained this month and are at risk of worsening even further.\nThe trigger for the downturn was Japanese Prime Minister Sanae Takaichi’s comments to the Japanese parliament on November 7 that the use of force against Taiwan could be perceived as a “survival-threatening situation”, which would permit Tokyo to deploy the Japan Self-Defence Forces. She has refused to retract her...",
        "source": "smcp",
        "date": "2025-11-19T09:00:16+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333296/why-does-taiwan-issue-touch-nerve-between-beijing-and-tokyo?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c2ab6c6c19b9abfa501b8b6911afb1d5cd7d6d7f48b44aed90dc495547a600f7",
        "title": "Xpeng’s founder headlines SCMP Live’s 2025 Business Awards",
        "summary": "Xpeng’s CEO He Xiaopeng is among three corporate founders who have been shortlisted as finalists in the 2025 Business Awards organised by SCMP Live, in a reimagination of a series of accolades first introduced in 1990.\nA total of 43 nominations were received for the awards in six categories, honouring the most noteworthy business owner, corporate executive, company, small-and-medium-sized enterprise (SME), start-ups and the best globalised brand. A discretionary award honouring lifetime...",
        "source": "smcp",
        "date": "2025-11-19T08:30:08+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3333210/xpengs-founder-headlines-scmp-lives-2025-business-awards?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2f1179bacdda70daeff4ceca185ba912cf51949d0714f697332591e08a8178e1",
        "title": "China leveraged India-Pakistan conflict to test military edge: US panel",
        "summary": "China turned a brief but intense India-Pakistan conflict in May into a live testing ground for its advanced weaponry and intelligence systems, and then aggressively marketed those results to undercut Western arms sales, a US congressional panel said in its annual report on Tuesday.\n“Beijing opportunistically leveraged the conflict to test and advertise the sophistication of its weapons,” a new report from the bipartisan US-China Economic and Security Review Commission stated bluntly.\nIt...",
        "source": "smcp",
        "date": "2025-11-19T07:26:11+09:00",
        "url": "https://www.scmp.com/news/china/article/3333321/china-leveraged-india-pakistan-conflict-trial-and-tout-its-military-strengths-says-us-panel?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ef48b259a6fa6f08b451691ea0242c4345c504d923c2503c59e455f3f49eed01",
        "title": "Chinese and US experts agree AI use in defence sector must be restricted",
        "summary": "Limiting AI use in military applications and ensuring global AI governance could ease collaboration and dialogue between China and the US as they vie for influence over the transformative technology, according to experts at a forum in Hong Kong on Monday.\nTheir remarks came as artificial intelligence is being increasingly adopted in the defence sector, including for weapon-related functions. It raises serious ethical and accountability concerns, further elevates the US-China AI race to a...",
        "source": "smcp",
        "date": "2025-11-19T07:00:10+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333303/chinese-and-us-experts-agree-ai-use-defence-sector-must-be-restricted?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ce0dd0ea620be7ad99f2468504731490135b27a791bc9b8ed5bb4eb5651d9607",
        "title": "Takaichi’s Taiwan rhetoric is a strategic misjudgment",
        "summary": "Japanese Prime Minister Sanae Takaichi’s recent remarks suggesting that Japan could intervene militarily in the Taiwan Strait under the pretext of a “survival-threatening situation” represent a strategic pivot away from Japan’s post-war pacifist ethos.\nThese statements, explicitly condemned by Beijing as “blatant interference in China’s internal affairs”, transcend mere diplomatic indiscretion. They reflect a calculated alignment with containment strategies aimed at curtailing China’s...",
        "source": "smcp",
        "date": "2025-11-19T06:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3333048/taiwan-japans-takaichi-shouldnt-play-fire?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "083f8758433f85990750b1fa07780ba7d554f2f904ab6da61e90655b31b4d407",
        "title": "Brazil approves China’s naval visit while US research ship plans call nearby",
        "summary": "Brazil has cleared a Chinese navy hospital ship to dock in Rio de Janeiro in January, ending a months-long review that drew quiet pushback inside the country’s military, according to local media.\nThe approval, dated November 13 and published Tuesday in the government’s official gazette, allows the Ark Silk Road to remain in Rio from January 8 to January 15 next year. The 178 metre (584 feet) vessel operates under China’s People’s Liberation Army Navy.\nRecords show a United States ship will...",
        "source": "smcp",
        "date": "2025-11-19T06:00:19+09:00",
        "url": "https://www.scmp.com/news/china/article/3333320/brazil-oks-china-naval-visit-while-us-research-ship-plans-call-nearby?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2e6594bfe9fe6b61aab0b1eec5bd7946d1e09b64b5f3a530e43ccfca04dc068b",
        "title": "Bankruptcies, suicides: US farmers detail cost of trade tensions",
        "summary": "Randal Shelby planned carefully and waited years to ditch a career spent in hospitals and medical centres to chase a dream in which he traded antiseptic hallways full of sick patients for the great outdoors.\nHis new life started six years ago, after he secured about US$1.3 million in financing for a Case combine and other equipment, fertilisers, seed and labour needed to produce soybeans and rice, staples that enjoyed strong demand overseas, primarily from China.\nHigh fuel costs, rising interest...",
        "source": "smcp",
        "date": "2025-11-19T00:00:11+09:00",
        "url": "https://www.scmp.com/news/us/economy-trade-business/article/3333207/things-were-already-grim-us-farmers-then-china-tensions-worsened-again?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "447dc26c829e14d693dd665732c016563ea2db540e78519041d0362304b425a7",
        "title": "Will China ramp up military activity near Japan over Takaichi’s comments?",
        "summary": "Beijing could step up military and coastguard activities near Japan if tensions escalate further following Japanese Prime Minister Sanae Takaichi’s provocative remarks on Taiwan, according to analysts.\n“It cannot be ruled out that there will be new military activities near the Diaoyu Islands,” a government adviser said, referring to the disputed group of islands known as the Senkakus in Japan. The islands, located in the East China Sea, have long been a source of tension between the two...",
        "source": "smcp",
        "date": "2025-11-18T23:00:11+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3333287/will-china-ramp-military-activity-near-japan-over-takaichis-comments?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ef287f374c31349801fb1ced512de3d3fdaad919bba7ed6884788e90517627c8",
        "title": "China’s Baidu posts 50% rise in AI revenue despite third-quarter slump",
        "summary": "Chinese internet search giant Baidu on Tuesday reported a 50 per cent increase in artificial intelligence-related revenue in the three months ended September from a year ago, which was the bright spot to an otherwise lacklustre financial quarter.\nThe Beijing-based company’s third-quarter revenue declined 7 per cent year on year to 31.2 billion yuan (US$4.4 billion), owing to sluggish demand in its advertising business, while its net loss hit 11.2 billion yuan on asset writedowns.\nWhile its core...",
        "source": "smcp",
        "date": "2025-11-18T22:43:55+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3333305/chinas-baidu-posts-50-rise-ai-revenue-despite-third-quarter-slump?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7799bf2ed0628bd560be0f5fd4bbb3819845a40b6323648c71101d29c3da4e48",
        "title": "US pulls missile system from Japan, EV fires fan fears: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. US pulls missile system from Japan as Beijing-Tokyo row over Taiwan deepens\nA US missile system that could strike Beijing has been withdrawn from Japan, Japanese media reported on Monday, amid sharply escalating tensions triggered by the Japanese prime minister’s recent remarks on Taiwan.\n2. China’s dominance shrinks US remote sensing share from 88% to...",
        "source": "smcp",
        "date": "2025-11-18T22:15:09+09:00",
        "url": "https://www.scmp.com/news/china/article/3333297/us-pulls-missile-system-japan-ev-fires-cause-safety-debate-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7d1379acb6469d030ae57025f7a5fc8d87cb5bf80f0c1b810048868952c410a2",
        "title": "Alibaba bets on ‘everything app’ Qwen to define AI era for global consumers",
        "summary": "Alibaba Group Holding’s new multipurpose artificial intelligence consumer app, Qwen, has the potential to become China’s “super-app” in the AI era in the same way Tencent Holdings’ WeChat defined the mobile internet age, analysts say.\nPowered by Alibaba Cloud’s own model series of the same name, Qwen quickly jumped to fourth overall on Apple’s app store for free apps in Hong Kong and fifth in mainland China on its second day of beta testing.\nThe app, billed as “the best personal AI assistant”,...",
        "source": "smcp",
        "date": "2025-11-18T22:00:09+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3333276/alibaba-bets-everything-app-qwen-define-ai-era-global-consumers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "89772fd651fb0c018b4bd8b45e0cac754d1b0127f9a6eb6cd408d1e6a7c288f8",
        "title": "US and China’s national security ‘fixation’ has gone too far, Roach warns",
        "summary": "A prominent American economist has cautioned that the United States and China risk developing a “fixation” with national security, a tendency he said was distracting from the domestic challenges facing both countries.\n“We’ve taken the concept of national security too far,” said Stephen Roach, a senior fellow at Yale Law School’s Paul Tsai China Centre, at the US-China Hong Kong Forum on Monday.\nHe called on Washington and Beijing to draw a clear distinction between economic and national...",
        "source": "smcp",
        "date": "2025-11-18T21:30:19+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3333260/us-and-chinas-national-security-fixation-has-gone-too-far-stephen-roach-warns?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "17142723c3c3a4acf92a039c9dd6a787ed08462001d94f22d388ab46221b1920",
        "title": "As Russia advances and Trump retreats, China’s ascendancy is clear",
        "summary": "While the world’s attention is drawn to US President Donald Trump’s tug of war with China over trade tariffs and technological embargoes, a new development in the Ukraine war is catching the eye of geopolitical observers.\nPokrovsk, a city in Donetsk Oblast, has emerged as the most critical flashpoint in Russia’s war on Ukraine. At the intersection of major supply highways and a key railway junction, it serves as a vital logistics hub for Ukrainian forces defending central and western Donetsk....",
        "source": "smcp",
        "date": "2025-11-18T21:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3332846/russia-advances-and-trump-retreats-chinas-ascendancy-clear?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a61ac1ea51ee620349d9cc8cb2b03e3431bdca72aec5ad7d74266055465a2189",
        "title": "China’s Fujian carrier completes first training shortly after entering service",
        "summary": "China’s newest aircraft carrier, the Fujian, has returned to port following a training mission with its strike group, according to a state media report on Tuesday amid rising tensions with Japan.\nState broadcaster CCTV reported that the mission marked the “first maritime live-force training” for the world’s biggest conventionally powered warship since it was commissioned to the PLA Navy on November 5.\nThe Fujian, China’s first domestically designed carrier and its third overall, has a...",
        "source": "smcp",
        "date": "2025-11-18T21:10:37+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3333289/chinas-fujian-aircraft-carrier-completes-first-training-exercise-after-entering-service?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5ea62a6bbdc863dcf0f52a83938d6889e6d7490067fdbed52d8a8837eee89c8b",
        "title": "China’s military mouthpiece hits out at US ‘gunboat diplomacy’ over Venezuela",
        "summary": "China’s official military newspaper has accused the United States of “gunboat diplomacy” amid rising tensions with Venezuela.\nThe Pentagon announced on Sunday that a strike group including the US Navy’s largest aircraft carrier, the USS Gerald R. Ford, had been deployed to the Caribbean, carrying thousands of service personnel and dozens of aircraft.\nUS President Donald Trump said on Monday that he had not ruled out sending troops to Venezuela, while also expressing a willingness to engage in...",
        "source": "smcp",
        "date": "2025-11-18T21:00:28+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333282/chinas-military-mouthpiece-hits-out-us-gunboat-diplomacy-venezuela-tensions-rise?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a97d0bf55458790f5d8dca35f409f5e41a4026a4b88f22bb45e7ecbe264ba92b",
        "title": "Huawei’s Mate 80, foldable Mate X7 handsets to square off against Apple, Xiaomi",
        "summary": "Huawei Technologies is set to launch its latest flagship smartphone, the Mate 80 series, and a new foldable handset next Tuesday, as industry speculation swirls over the use of its next-generation Kirin 9030 processor in these devices.\nThe Shenzhen-based telecommunications equipment maker on Monday said its new Mate series – including the basic Mate 80, Mate 80 Pro, Mate 80 Pro Max and Mate 80 RS models – would be available for pre-order, but pricing and technical specifications were not...",
        "source": "smcp",
        "date": "2025-11-18T21:00:15+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3333269/huaweis-new-mate-80-foldable-mate-x7-handsets-square-against-apple-xiaomi?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f48a2a74e482238af7b172de858492f76ee29f5ecafb3bd5bbf07db83f16808b",
        "title": "China’s urban youth jobless rate falls slightly in tough market for graduates",
        "summary": "China’s urban youth unemployment rate continued to ease last month, though fierce labour market competition remains a challenge for many jobseekers.\nThe jobless rate for those aged 16 to 24, excluding students, slightly decreased to 17.3 per cent in October from 17.7 per cent in September, according to data released by the National Bureau of Statistics on Tuesday.\nFollowing a record 12.2 million graduates entering the job market over the summer, the youth unemployment rate rose in August to its...",
        "source": "smcp",
        "date": "2025-11-18T20:00:10+09:00",
        "url": "https://www.scmp.com/economy/economic-indicators/article/3333273/chinas-urban-youth-unemployment-rate-falls-slightly-tough-job-market-graduates?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c8830492790715ea876b12ef379db04ce6c82dc50d32257119fcfaba1fbfecd4",
        "title": "Europe and China must talk about ways to end Ukraine war: ex-French ambassador",
        "summary": "A former French diplomat has urged Europe and China to discuss security guarantees for Ukraine, describing the issue as “the major challenge” facing the two sides.\n“The Ukraine war is fracturing the dialogue between two parts of the world,” Maurice Gourdault-Montagne, France’s ambassador to China between 2014 and 2017, said in an interview.\n“It shouldn’t prevent us from having a stronger dialogue with China and finding out ways and means to cooperate as we did in the past, to find out shared...",
        "source": "smcp",
        "date": "2025-11-18T19:00:14+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333234/europe-and-china-must-talk-about-ways-end-ukraine-war-ex-french-envoy-beijing?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a0b462104b8e9ca67f91a00a681236431367d937526088e15693ac126d1978b3",
        "title": "Japanese yen weakens to 9‑month low, hits 155 to US dollar amid uncertainties",
        "summary": "The Japanese yen slid to a nine-month low against the US dollar, breaching a closely watched threshold of 155 amid domestic policy uncertainties, fading expectations of a Federal Reserve rate cut in December, and amplified China-Japan tensions over Taiwan.\nThe yen’s exchange rate briefly weakened beyond 155.3 to the dollar on Tuesday before improving slightly, while broader markets also came under pressure. Stocks slumped, bonds were sold off, and long-term yields jumped to multi-decade highs,...",
        "source": "smcp",
        "date": "2025-11-18T18:43:39+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3333268/japan-yen-slips-past-155-us-dollar-fiscal-doubts-china-spat-sap-investor-confidence?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6d5b00e219811a5c409b493d1fc5bf09511e43b1418a7db8fe5660bd2441f7b8",
        "title": "‘We need stability’: China and Germany strive to reset trade ties in Beijing",
        "summary": "Chinese Vice-Premier He Lifeng and German Finance Minister Lars Klingbeil tried to find common ground after a financial dialogue in Beijing on Monday, with both officials saying the two countries should strengthen ties and support open, rules-based global trade.\nKlingbeil’s trip marked the first visit to China by a German minister since the new coalition government took office earlier this year and came at a delicate time for Sino-German relations, with Berlin gripped by supply chain anxieties...",
        "source": "smcp",
        "date": "2025-11-18T18:00:39+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3333259/china-and-germany-strive-reset-trade-ties-beijing-we-need-stability?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e81d23eb96d2b120d177d6b0464d3caaaf4c005ab77642b03af3e4ae0d4089bf",
        "title": "Hong Kong, Saudi Arabia set to launch US$1 billion fund, Paul Chan says",
        "summary": "The Hong Kong Monetary Authority (HKMA) and the sovereign wealth fund of Saudi Arabia will launch a US$1 billion fund to help companies from Hong Kong and other cities in the Greater Bay Area expand into the Middle Eastern country, Financial Secretary Paul Chan Mo-po said on Tuesday.\nThe move was expected to contribute to the development of non-oil economic sectors in Saudi Arabia, he said.\n“Next month, a major Saudi development company will be hosting a roadshow in Hong Kong to seek strategic...",
        "source": "smcp",
        "date": "2025-11-18T17:58:32+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3333258/hong-kong-saudi-arabia-set-launch-us1-billion-fund-paul-chan-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1d0070b09b82e1cec17d762120ab61707e8ef2cb3d63f3dead95e3796a23b05f",
        "title": "US national security focus throws a spanner in the workings of global trade",
        "summary": "Regardless of the outcome of the challenge to US President Donald Trump’s powers under the International Emergency Economic Powers Act now before the Supreme Court, Treasury Secretary Scott Bessent has made clear the administration will continue to use national security rationales to enact its disruptive trade measures.\nIt was not always thus. Nations have always had national security interests. Major powers have always engaged in espionage targeting adversaries – even allies. But since the...",
        "source": "smcp",
        "date": "2025-11-18T17:30:10+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3332888/weaponising-national-security-trade-against-china-us-breeds-chaos?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "feffd4425db29ad681531cffbc7830ed31e5dffd66416d19bb7c6fefb014431a",
        "title": "China’s ‘coal plastic’ breakthrough can greatly reduce its demand for oil: study",
        "summary": "Chinese scientists have developed a catalyst that can turn biomass and coal-derived syngas directly into building blocks for plastic and synthetic rubber with higher efficiency and sustainability than existing methods.\nThe iron-based nanoparticle catalyst converts syngas, or synthesis gas, into hydrogen and carbon-based compounds called olefins by coupling two reactions that separately have limitations but together have synergistic effects.\nThis process produces olefins with a large variety of...",
        "source": "smcp",
        "date": "2025-11-18T16:00:08+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3333194/china-teams-super-efficient-catalyst-turns-coal-plastic-and-other-synthetics?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e8e10512860e9f3b808c27bd808f0573491df30e125399195b7c48ffd0c7a9e2",
        "title": "Hopes dim as China-Japan talks on Takaichi Taiwan Strait row end with no resolution",
        "summary": "Top-level talks between Chinese and Japanese diplomats ended without consensus on Tuesday, dimming hopes for an end to a row over Japanese Prime Minister Sanae Takaichi’s comments on the Taiwan Strait.\nAccording to the Chinese foreign ministry, Asian affairs department chief Liu Jinsong told his Japanese counterpart, Masaaki Kanai, that Takaichi must retract her suggestion from earlier this month that a crisis in the strait would allow Tokyo to deploy its self-defence forces.\n“[The comments]...",
        "source": "smcp",
        "date": "2025-11-18T15:15:05+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333216/japan-urges-citizens-china-be-wary-row-over-takaichis-comments-escalates?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e19ed21d04662bd35cd821e9148f4414b691c3f555946c52cca4eb655c1ea333",
        "title": "US panel urges new economic statecraft body as China’s tech challenge grows",
        "summary": "A leading advisory panel on China policy urged the US Congress on Tuesday to establish a “consolidated economic statecraft entity” to handle technological and other national security challenges posed by China’s “systematic and persistent evasion” of American export controls and sanctions.\n“This recommendation addresses the critical gap between export controls and sanctions as written and their actual enforcement, recognising that China and Russia continue to successfully circumvent existing...",
        "source": "smcp",
        "date": "2025-11-18T14:01:06+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3333177/us-panel-urges-economic-statecraft-body-tackle-chinas-growing-tech-challenge?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0d18838f46591a92ea86698ac7f1018f1daf1fbda0b2102185ded21d7167d036",
        "title": "China displays latest UAV and fighter jets at the Middle East’s largest air show",
        "summary": "China is offering a glimpse of some of its latest drones and fighter jets at the Middle East’s biggest air show this week, seizing an opportunity to promote the country’s aviation products in the region.\nAmong those displaying their advanced aircraft at the Dubai Air Show is China National Aero-Technology Import & Export Corporation (Catic), a major state-owned Chinese defence company.\nIts offerings include a full-scale model of the Wing Loong-X unmanned aerial vehicle (UAV), an export variant...",
        "source": "smcp",
        "date": "2025-11-18T13:00:17+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3333137/china-displays-latest-uav-and-fighter-jets-middle-easts-largest-air-show?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "720a5eb9c587f90a7cde0778a0690eff712342c6546795f2ea6f332b35cf44b8",
        "title": "Beijing-Tokyo row over Takaichi’s Taiwan comments: everything you need to know",
        "summary": "We have put together stories from our coverage of Japanese Prime Minister Sanae Takaichi’s comments on Taiwan, the reaction and articles on Beijing-Tokyo relations for context. If you would like to see more of our reporting, please consider subscribing.\n1. Beijing slams Japanese PM for ‘seriously damaging’ ties over Taiwan comment\nThis article was published on November 10, 2025.\n2. Has Takaichi planted a Taiwan ‘time bomb’ in Tokyo’s ties with Beijing\nThis article was published on November 13,...",
        "source": "smcp",
        "date": "2025-11-18T12:14:25+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333183/beijing-tokyo-row-over-takaichis-taiwan-comments-everything-you-need-know?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3f26041e933befa300394074dc2f4e0e52ebb0ceccb516bc7981e5142d73f76f",
        "title": "‘Significant gains’: US review evaluates ‘Made in China 2025’ advancements",
        "summary": "Beijing has not achieved all of its “Made in China 2025” (MIC2025) goals – particularly in aviation and integrated circuits – but has still made “significant gains” and cemented its status as a global manufacturing powerhouse, according to a new US government report.\nThe assessment, released by the US-China Economic and Security Review Commission, evaluated China's progress on the 10-year strategy, which was launched in 2015 to achieve self-reliance, innovation and technological prowess across...",
        "source": "smcp",
        "date": "2025-11-18T11:00:31+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3333119/made-china-2025-cements-manufacturing-dominance-despite-missed-goals-us-review-finds?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "765edf41b6706daf12dc2a046dcf8da9f2e4da603f4d11574c0cc797c99d362b",
        "title": "Why the era of great power politics is at its end",
        "summary": "Pundits the world over are pointing to a new cold war – the defending champion United States versus a rising China. Deglobalisation and great power rivalry dominate headlines while world leaders prepare for chaos.\nFortunately, a different picture emerges when we look at the data. A century of globalised trade has levelled the economic playing field. Countries are now closer in relative strength, far more interdependent and far less willing to pick sides. The “great powers” of the 21st century...",
        "source": "smcp",
        "date": "2025-11-18T10:30:09+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3332761/has-us-china-rivalry-killed-globalisation-hardly?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6aed815df194aa4b2a684e4aaa58bcff61f1f4f9322ca77a23fae259c23a9403",
        "title": "How League of Legends is still China’s top PC game after 15 years",
        "summary": "US video game developer Riot Games, creator of League of Legends, retains bragging rights to the most popular PC game in China nearly a decade and a half after its launch.\nFirst introduced in 2009 and brought to the mainland in 2011, the multiplayer online battle game has been around longer than many of those who play it – a remarkable feat in an industry known for its rapid shifts.\nThe secret to the game’s longevity may lie in the sustained appeal of the League of Legends esports scene, as...",
        "source": "smcp",
        "date": "2025-11-18T10:00:14+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3333089/how-league-legends-remains-most-popular-pc-game-china-after-15-years?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "571dc7ec6a0c1c8208b77a5c6b9d1227501a7f62f083f15299491e7b990a0604",
        "title": "Could battery fires be the Achilles’ heel of China’s electric vehicle industry?",
        "summary": "A series of electric vehicle fires in China has pushed the issue of battery safety into the public spotlight, triggering a wider public debate about the potential risks.\nLast month saw a number of high-profile incidents, including one on October 13 in Chengdu, the capital of Sichuan province, where a Xiaomi EV burst into flames after a high-speed crash, killing the driver.\nOn October 23 in Shanghai, a Li Auto car suddenly burst into flames on a bumpy road, becoming fully engulfed within 10...",
        "source": "smcp",
        "date": "2025-11-18T09:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3332302/could-battery-fires-be-achilles-heel-chinas-electric-vehicle-industry?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0a857b2db9a32e6c76889406d1bf4dad7c7d1bc8ccccedf85a7db7b9d3b0e61c",
        "title": "Hasan Piker’s China tour draws fire after viral Tiananmen police encounter",
        "summary": "American political commentator and live-streamer Hasan Piker has stirred controversy during his ongoing trip to China, with a viral encounter in Tiananmen Square and remarks that critics say amount to promoting Chinese propaganda.\nOn Monday, Liu Pengyu, spokesperson for China’s embassy in Washington, shared on X (formerly Twitter) an interview Piker did with state-run China Global Television Network last week, writing: “Real reason why mega #US influencer Hasan Piker is in #China.”\nIn the...",
        "source": "smcp",
        "date": "2025-11-18T07:39:43+09:00",
        "url": "https://www.scmp.com/news/china/article/3333173/hasan-pikers-china-tour-draws-fire-after-viral-tiananmen-police-encounter?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "12bac4fddb6b0ee2ce07fa2a5951fe51f7f9e7e3b7cc8fefc17ebe0e72b85663",
        "title": "US soybean futures rebound on signs China is ramping up purchases",
        "summary": "Soybean futures jumped on signals that China is stepping up its buying of oilseed, offering hope for US farmers after purchases appeared to have stalled.\nPrices in Chicago rose as much as 3.2 per cent on Monday, hitting a fresh 17-month high, after US President Donald Trump said China is in the process of buying soybeans.\n“They’ll be doing a lot of soybean purchases,” he told reporters aboard Air Force One on Friday, adding that those purchases could start before spring.\nBrokerage AgResource Co...",
        "source": "smcp",
        "date": "2025-11-18T07:21:57+09:00",
        "url": "https://www.scmp.com/news/world/united-states-canada/article/3333172/us-soybean-futures-rebound-signs-china-ramping-purchases?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b59d6fd3fa167324a1fd8bce8d31cf44f4eeda9ee76b80a577f98b0f3f3a36b8",
        "title": "China’s dominance shrinks US remote sensing share from 88% to 9%",
        "summary": "The year was 2015, and New York University professor Debra Laefer sat at her desk in Brooklyn reviewing yet another stack of research papers on remote sensing. As she scanned the authors’ affiliations, she paused – the same journals that once overflowed with names from American universities and Nasa labs had begun to publish discoveries from Beijing, Wuhan and Shanghai.\nOver the next few years, the drips became a wave – and then a tsunami.\nBack in the 1990s, the United States dominated remote...",
        "source": "smcp",
        "date": "2025-11-18T07:00:10+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3333093/88-9-stark-data-shows-us-decline-chinas-rise-remote-sensing-research?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "74213e06f0c96844b25386f85af3e03693ae5abd435a6d7309e53c7d74c0306e",
        "title": "As US and China turn their eyes to Central Asia, Russia loses out",
        "summary": "As a result of Russia’s war in Ukraine, Moscow has lost much of its influence in Central Asia. In the coming months and years, the United States is expected to expand its presence in this strategically important region. But given that China has developed close economic ties with regional actors, how does Beijing view Washington’s ambitions?\nCoincidentally or not, on November 6, the US and China both held important meetings with Central Asia. In Washington, US President Donald Trump hosted the...",
        "source": "smcp",
        "date": "2025-11-18T06:30:10+09:00",
        "url": "https://www.scmp.com/opinion/asia-opinion/article/3332544/us-and-china-turn-their-eyes-central-asia-russia-loses-out?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f49d5ab56127f27d1fe1f9a594743b292c67e5be650106dc142babd3453c3629",
        "title": "Brazil ends 60-year ordeal of tortured Chinese detainees during military regime",
        "summary": "Brazil’s top military court has closed a dictatorship-era case against nine Chinese citizens who were arrested and tortured in 1964, ending a process that stayed open for more than six decades despite the lack of evidence behind the original charges.\nIn a decision released on Sunday, Brazil’s Superior Military Court ruled that the case should legally have expired in 1981 but was never closed. As a result, a 50-volume case file remained on the docket.\nThe closure lifts a lingering point of...",
        "source": "smcp",
        "date": "2025-11-18T04:58:24+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3333168/brazil-ends-60-year-case-chinese-detainees-tortured-under-military-regime?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7b90b0031749247a6e5d412c826e645dd7ec41bb90c932166ab1416a809f7665",
        "title": "EU’s investment bank to work with Australia on critical raw materials",
        "summary": "The EU’s European Investment Bank (EIB) and the Australian government said in a joint statement on Monday they would deepen cooperation on critical raw materials, as Western powers scramble to cut their reliance on China.\nWith the exception of Japan, Group of Seven (G7) countries and the EU are heavily or exclusively reliant on China for a range of materials from rare earth magnets to battery metals.\nEuropean officials and industry sources say financing remains a key hurdle in the bloc’s efforts...",
        "source": "smcp",
        "date": "2025-11-18T04:22:32+09:00",
        "url": "https://www.scmp.com/news/world/europe/article/3333167/eus-investment-bank-work-australian-government-critical-raw-materials?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ac209436c3690c0f1747febf88d673d8a6b7f2ee27545dbe68bf0e255a217ab9",
        "title": "Colombia pushes for talks – to include China – over US military action in region",
        "summary": "Colombian President Gustavo Petro called for a high-level security meeting with the United States, China and regional partners, arguing that recent US military deployments and strikes on suspected drug-smuggling boats in the Caribbean and eastern Pacific are escalating tensions in the region.\nJoining other regional voices condemning the operations, he stressed that Latin America and the Caribbean should be treated with respect and repeated his proposal for talks in Pearl Harbour, noting that he...",
        "source": "smcp",
        "date": "2025-11-18T04:06:18+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3333166/colombia-pushes-talks-include-china-over-us-military-build-near-venezuela?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "74c686c80ddd05111ba799370373b906462e0b15f38b5badc87d2507fae1288e",
        "title": "US pulls missile system from Japan as Beijing-Tokyo row over Taiwan deepens",
        "summary": "A US missile system that could strike Beijing has been withdrawn from Japan, Japanese media reported on Monday, amid sharply escalating tensions triggered by the Japanese prime minister’s recent remarks on Taiwan.\nThe Typhon Mid-Range Capability (MRC) missile launcher system of the US Army, deployed to the Iwakuni base in Yamaguchi prefecture since September for the US-Japan “Resolute Dragon 2025” joint exercise, was already removed, the Japanese Defence Ministry confirmed on Monday.\nThe news...",
        "source": "smcp",
        "date": "2025-11-18T02:36:26+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3333161/us-pulls-missile-system-japan-beijing-tokyo-row-over-taiwan-deepens?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5ab70544e3d99b107bbc86ac9b15b91821b63cfe39a167f3b5fa5adec2363b71",
        "title": "Why ‘racist’ biologist James Watson is remembered in China with respect",
        "summary": "When Nobel laureate James Watson died at 97 in November, obituaries around the world painted a divided portrait: a scientific visionary who co-discovered the double helix of DNA – and a controversial figure long condemned for making racially charged statements about intelligence and genetics.\nIn the West, the American molecular biologist’s legacy was increasingly overshadowed by the fallout from those remarks, culminating in New York’s Cold Spring Harbour Laboratory (CSHL) severing ties with him...",
        "source": "smcp",
        "date": "2025-11-18T00:00:12+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3332771/why-racist-biologist-james-watson-remembered-china-respect?utm_source=rss_feed",
        "reportUrl": ""
    }
]