[
    {
        "id": "b60f52a9260fc57da194c3d05950d0c28fb3f6bf53df78987f37cde09f413d9a",
        "title": "China’s Deep Robotics raises US$70 million as sector draws more investors",
        "summary": "Deep Robotics – one of the “Six Little Dragons” from Hangzhou, the capital of eastern Zhejiang province – on Tuesday said it had raised 500 million yuan (US$70 million) in fresh funding from a group of Chinese investors.\nAccording to the company’s statement, its latest round of financing was led by CMB International, China Asset Management and funds under state-owned telecommunications network operators China Telecom and China Unicom.\nDeep Robotics founder and CEO Zhu Qiuguo, who also serves as...",
        "source": "smcp",
        "date": "2025-12-10T10:00:21+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3335806/chinas-deep-robotics-raises-us70-million-fresh-funds-sector-draws-more-investors?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e384dc373098c90e7d2ea53d08933f68704cde056135718ad7e50b14916eecd3",
        "title": "China and Russia must be on guard to stop Japan causing trouble: ex-diplomat",
        "summary": "Japan is likely to become the “most serious and direct” threat to both China and Russia in the Asia-Pacific, a former Chinese diplomat and foreign ministry official has warned.\nWu Hailong, assistant minister of foreign affairs from 2009 to 2011, now heads the semi-official China Public Diplomacy Association.\nRussia should factor in the challenge from Japan, he told a forum in Beijing last week.\n“When discussing China-Russia relations, I cannot avoid mentioning the Japan factor,” Wu said,...",
        "source": "smcp",
        "date": "2025-12-10T10:00:14+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335782/china-and-russia-must-be-guard-stop-japan-causing-trouble-chinese-ex-diplomat-warns?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "35fbb9ba256b59956b15ae1f6cdda812b20e608a8070e6d8d9f2bc272a7dda88",
        "title": "China’s powerhouse province targets doubling GDP by 2035 – but can it deliver?",
        "summary": "Guangdong, China’s largest provincial economy, has vowed to double its economy by 2035 from 2022 levels, in line with the central government’s target of becoming a medium-level developed country by that year.\n“Looking ahead, from the 20th National Congress of the Communist Party (in 2022) to 2035, Guangdong aims to achieve socialist modernisation and build a modern, new Guangdong within 13 years,” provincial authorities said in their five-year plan proposals released on Monday.\n“By that time,...",
        "source": "smcp",
        "date": "2025-12-10T09:30:10+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335798/chinas-guangdong-targets-doubling-gdp-2035-despite-slowing-growth?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b3b00e668b469bf12e7391960497208fa441a03335007f399d0b5ab909de8673",
        "title": "China, Hong Kong stocks set to gain nearly 20% in 2026, JPMorgan says",
        "summary": "China and Hong Kong stocks could deliver nearly 20 per cent gains in 2026, supported by resilient global growth, improving earnings and easing competition among e-commerce giants, according to JPMorgan.\nThe bank expected the MSCI China Index to rebound further as valuations normalised and Beijing’s push to curb excess capacity boosted profitability across key sectors, said Wendy Liu, chief China equity strategist at JPMorgan.\n“Earnings are giving us confidence,” Liu said during a media briefing...",
        "source": "smcp",
        "date": "2025-12-10T08:30:08+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3335804/china-hong-kong-stocks-set-gain-nearly-20-2026-jpmorgan-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4285101305bc3294433c44e8f2631c453d5dba614462ce6c2dc03f796ae260bb",
        "title": "US senators warn of China-cartel links forming a global ‘Silk Road of crime’",
        "summary": "Lawmakers from both parties are warning that Chinese criminal groups have helped build what officials call a “Silk Road of crime”, a global network that launders Latin American cartel profits and supplies the chemicals used to make fentanyl bound for the United States.\nAt a Senate hearing on Tuesday, members of the Caucus on International Narcotics Control said Chinese money brokers and Latin American cartels have merged their operations into a system that blurs the line between trade and...",
        "source": "smcp",
        "date": "2025-12-10T08:21:36+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3335821/us-senators-warn-china-cartel-links-forming-global-silk-road-crime?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fd7c9cca42034b5bc02a08ecde82babedcb057d830107175fc3bd6a70cc21196",
        "title": "How China pulled off a critical mineral tech revolution in just 10 months",
        "summary": "When a European start-up developed a breakthrough technology capable of transforming low-grade bauxite – once considered waste – into high-quality feedstock for aluminium production, they announced it at an industry conference in Miami, United States.\nThe innovation not only promises to revive exhausted mines, but also opens a new door to extracting critical minerals and rare earth elements essential for semiconductors, electric vehicles and national defence.\nWith Western governments from...",
        "source": "smcp",
        "date": "2025-12-10T07:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3334322/how-china-pulled-critical-mineral-production-tech-revolution-just-10-months?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c874815c1a7da1af3be356a8cdf0e3f9ad7404f0500516312503c51301b69355",
        "title": "How Nexperia became a casualty of the US-China trade war",
        "summary": "Don’t bring a knife to a gunfight, they say. Alas, the Dutch government has been a slow learner.\nNo matter, the Nexperia debacle has shown how some European states have been too compliant with the United States and defiant with China. They don’t seem to realise they are little better than pawns in US President Donald Trump’s America.\n“Model allies that step up … will receive our special favour,” US Defence Secretary Pete Hegseth declared at the 2025 Reagan National Defence Forum in California...",
        "source": "smcp",
        "date": "2025-12-10T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3335596/how-nexperia-became-casualty-us-china-trade-war?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "abc5f982f181213a01f3dd0b84897f659e0554d8ea8b1b6b455619e21e7bb2c1",
        "title": "China reveals radio clip heard before mid-air stand-off with Japan fighter jets",
        "summary": "China on Tuesday released more details about Saturday’s mid-air stand-off between Chinese and Japanese fighter jets, as the two sides traded barbs over the radar lock-on incident amid rising tensions.\nThe Japanese Defence Ministry claimed the Chinese ship-based J-15 fighters from aircraft carrier Liaoning had locked fire-control radars on Japan’s F-15 jets in the international airspace near Okinawa.\nChinese Foreign Ministry spokesman Guo Jiakun stated on Tuesday that it is “standard practice for...",
        "source": "smcp",
        "date": "2025-12-10T05:06:34+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3335816/china-reveals-radio-communication-heard-mid-air-standoff-japanese-fighter-jets?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5504765311f3954b74d437dcb1f3bb2c163d459c3e8f7b75fc02cfd143dbce4c",
        "title": "Chinese boy Yuanxin, 6, speaks with father for first time since ICE detention",
        "summary": "Yuanxin, a 6-year-old immigrant from China who was detained and separated from his father, Fei Zheng, over the Thanksgiving holiday in New York City, was finally allowed to speak with his parent by phone this past weekend.\nJennie Spector, who has been supporting the family since July, described the call as a “very good development”. She said a US Immigration and Customs Enforcement (ICE) officer at the Orange County Correctional Facility in upstate New York, where Zheng is being held, made it...",
        "source": "smcp",
        "date": "2025-12-10T04:25:54+09:00",
        "url": "https://www.scmp.com/news/china/article/3335815/chinese-boy-yuanxin-6-speaks-father-first-time-ice-detention?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "43ab0a0b6aa5bccb56f1a99c4462f4c221126d6d619a590ecf32c63ca76cc734",
        "title": "Code talker 2025? PLA frontline troops are testing portable quantum radio devices",
        "summary": "The People’s Liberation Army is testing what could be the world’s first portable quantum radio device in its border patrol troops, according to the official Science and Technology Daily.\nThe PLA’s Information Support Force said its miniaturised prototype of quantum communication, weighing 3kg (6.6lbs), had successfully received radio signals from tens of kilometres away. The team was able to read lines of decoded information, the newspaper reported last Thursday.\n“This successful experiment will...",
        "source": "smcp",
        "date": "2025-12-10T00:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3335791/code-talker-2025-pla-frontline-troops-are-testing-portable-quantum-radio-devices?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3ae0d0fcd172eb6f5e572137a716ab84b157ebe45dabbac74c10ecaa4345367f",
        "title": "US-China tech thaw? Trump clears Nvidia H200 exports – why it matters",
        "summary": "US President Donald Trump’s green light for Nvidia to sell H200 artificial intelligence (AI) chips in China signals a calculated shift to export older technology, according to analysts who see the move as aiming to fortify the US market share while dampening China’s urgency for self-reliance.\nBut some predict an ongoing policy tug of war in the US between advocates of this week’s relaxation and those who prefer continued tight restrictions on hi-tech gear shipped to China.\nTrump said on Monday...",
        "source": "smcp",
        "date": "2025-12-09T23:00:09+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3335774/us-china-tech-thaw-trump-clears-nvidia-h200-exports-why-green-light-matters?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f6add0c2b699eb03c3cb36c5902aeac8d96d8106dfcceb522b8b7e09a6844fef",
        "title": "Tokyo ‘monitoring’ Beijing backlash; Taiwan’s RedNote ban: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Tokyo ‘closely monitoring’ backlash from China, Japanese PM tells lawmakers\nOne month after the Taiwan contingency remarks that set off the diplomatic firestorm with China, Japanese Prime Minister Sanae Takaichi said Japan would “closely monitor” the situation and respond appropriately.\n2. Taiwan RedNote ban backfires, driving mainland Chinese app’s top...",
        "source": "smcp",
        "date": "2025-12-09T22:15:08+09:00",
        "url": "https://www.scmp.com/news/china/article/3335760/tokyo-monitoring-beijing-backlash-taiwans-rednote-ban-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "449641f01fc6f553177f0a9a1ded7c50094c8abb4cf30575d65a70c5c69f8e89",
        "title": "China’s AI developers to welcome Nvidia’s H200 chip shipments, analysts say",
        "summary": "China’s artificial intelligence developers are expected to welcome Washington’s go-ahead for Nvidia to ship its H200 AI chips to approved customers on the mainland, according to analysts, even as Beijing continues to drive the country’s tech self-sufficiency efforts.\nIn a post on his Truth Social platform on Monday, US President Donald Trump said he had informed his Chinese counterpart, Xi Jinping, of that decision “under conditions that allow for continued strong national security”. Xi had...",
        "source": "smcp",
        "date": "2025-12-09T22:00:13+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3335802/tech-war-chinas-ai-developers-welcome-nvidias-h200-chip-shipments-analysts-say?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5a1a6066efb129428033525a745a83172fc5e746b3ec6207dfe88965fd1641f0",
        "title": "Eyeing mainland China, Taiwan passes stiffer penalties for undersea cable damage",
        "summary": "Taiwan has moved to deter what it sees as an alarming rise in deliberate damage to its undersea cables, revising its laws to impose stiffer prison sentences of up to seven years.\nThe legal changes approved by Taiwan’s legislature on Tuesday come as the island accuses Beijing of sabotaging its submarine cables, describing such acts as “grey-zone” pressure tactics.\nMainland authorities have strongly denied any involvement, calling the incidents “common maritime accidents” and accusing Taipei of...",
        "source": "smcp",
        "date": "2025-12-09T22:00:08+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335800/eyeing-mainland-china-taiwan-passes-stiffer-penalties-undersea-cable-damage?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "556041d223cfcf512870ee8c4e31e7c147df4645a4c49ceeec9ac7a3f1ecc11b",
        "title": "‘China threat’ narrative a ‘complete mislabelling’, Jin Keyu says",
        "summary": "A prominent economist has dismissed the “China threat” phenomenon as a “complete mislabelling”, arguing that the country has instead supported the global diffusion of technology by significantly lowering costs through production at scale.\nSpeaking at a summit on Tuesday, Jin Keyu – a professor of finance at the Hong Kong University of Science and Technology – also said China’s proposals for its next five-year plan indicate Beijing recognises the need to rebalance its economy and better harmonise...",
        "source": "smcp",
        "date": "2025-12-09T21:30:16+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335778/china-threat-narrative-complete-mislabelling-jin-keyu-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7acfbda7cad22fae8af02ef8d8940762312b7eaf4bd25987506c3fd006682f6b",
        "title": "China-born architect Wang Fei dies in suspected car crash in London",
        "summary": "The renowned Chinese-born architect Wang Fei has died at the age of 45 following an accident in London.\nThe China Academy of Art, where he had worked as a visiting professor between 2009 and 2011, confirmed that Wang, who taught at Syracuse University in New York state, had died on Monday.\nSome friends and colleagues leaving tributes online suggested that Wang had been killed in a car accident.\nLi Lexian, an architectural designer, wrote on social media that Wang had died at the Royal London...",
        "source": "smcp",
        "date": "2025-12-09T21:00:49+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3335794/chinese-born-architect-wang-fei-dies-suspected-car-crash-london?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ca58ef9b99cb4437a12b07a1a1d5d3600071896c088b9fe33bc87cd2e118f3a7",
        "title": "Supply chain guru Victor Fung warns of ‘20% tax’ as tariffs reshape global trade",
        "summary": "Hong Kong tycoon Victor Fung Kwok-king former chairman of supply chain management conglomerate Fung Group, warned on Tuesday that consumers around the world will ultimately bear the cost of a de facto 20 per cent tariff in global trade.\nSpeaking at the Global Supply Chain Business Summit 2025 held by the Hong Kong University of Science and Technology’s Li & Fung Supply Chain Institute, the 80-year-old said the global trading environment was converging towards an average tariff rate of about 20...",
        "source": "smcp",
        "date": "2025-12-09T21:00:17+09:00",
        "url": "https://www.scmp.com/news/china/article/3335788/supply-chain-guru-victor-fung-warns-20-tax-tariffs-reshape-global-trade?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cb037a9dfc117fc09b96514fd14ff291adba37af5418106120548ad48254a1b3",
        "title": "‘We’ve been careful’: Japanese firms in China stay calm amid political storm",
        "summary": "Beijing and Tokyo’s war of words over Taiwan was expected to be bad news for Japanese businesses in China. Previous diplomatic flare-ups have brought waves of online vitriol, protests and boycotts.\nBut at a Japanese-invested luxury department store in China’s eastern Zhejiang province, the outlet’s executives seemed largely unruffled. They are already well versed in riding out tense political situations.\nThe billion-dollar project – which is operated by a major Japanese retail group – had a...",
        "source": "smcp",
        "date": "2025-12-09T21:00:09+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335763/why-japanese-firms-china-are-unfazed-rising-tensions-weve-been-careful?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "67351a3245b0d2152b69419bc5353a5d6d552e34e6c6ce087f808323c9482499",
        "title": "Tencent quits Paramount’s Warner Bros bid amid US regulatory concerns",
        "summary": "Chinese social media and gaming giant Tencent Holdings has pulled out of US media group Paramount Skydance Corp’s takeover bid for Warner Bros Discovery to avoid heightened scrutiny of foreign investment in the United States, according to a filing on the US Securities and Exchange Commission’s website.\nTencent had pledged US$1 billion as part of Paramount’s December 1 proposal to acquire Warner Bros, but the Shenzhen-based company was removed as a financing partner in Paramount’s latest all-cash...",
        "source": "smcp",
        "date": "2025-12-09T20:00:13+09:00",
        "url": "https://www.scmp.com/business/investor-relations/article/3335743/tencent-quits-paramounts-warner-bros-bid-amid-us-regulatory-concerns?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c53c68cf63d2623aa1f3fa54147fec9787cb83628a93e4699af86a33065f58c8",
        "title": "Former Chinese senior banker executed for taking US$155 million in bribes",
        "summary": "China has executed a former senior banker who was found guilty of taking more than 1.1 billion yuan (US$155 million) in bribes.\nBai Tianhui, the former general manager of the asset management firm China Huarong International Holdings, was executed on Tuesday after the Supreme People’s Court approved the sentence, state broadcaster CCTV reported.\nThe state-owned offshore unit Bai ran was taken over by Citic Group and renamed China Citic Financial Asset Management in January last year.\nIt is rare...",
        "source": "smcp",
        "date": "2025-12-09T20:00:08+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335722/former-chinese-senior-banker-bai-tianhui-executed-taking-us155-million-bribes?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7211628737ab0687db1702cd3b5501072d67a9123edef87fed52843120befb93",
        "title": "China’s cautious shoppers continue to challenge consumer brands",
        "summary": "International and Chinese consumer brands will be forced to maintain a low-price strategy in mainland China amid persistent deflationary pressures, while looking to lower-tier cities and emerging sales channels for growth, according to a study by global consultancy Bain & Co and market research firm Kantar Worldpanel.\nCompanies in the fast-moving consumer goods (FMCG) sector would need to respond quickly to new market trends with a focus on product affordability to increase sales volume, said...",
        "source": "smcp",
        "date": "2025-12-09T19:45:08+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3335776/consumer-brands-china-face-fraught-future-amid-frugal-spending-forecast?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "29fa32d36d21505b9d362577ab88d9af44caed07e4efbe10ca787d2f04edcc1a",
        "title": "2 Chinese, 7 Russian jets enter South Korean air defence zone near Japan",
        "summary": "Military aircraft from China and Russia entered South Korea’s air defence zone without notification on Tuesday, prompting the deployment of fighter jets, the Korean military said.\nThe nine aircraft appeared to be part of a joint patrol in the area, their first such exercise in more than 12 months. They did not violate Korean airspace, the country’s military command authority said.\nHours later, the Chinese defence ministry said China and Russia had carried out their 10th joint strategic patrol in...",
        "source": "smcp",
        "date": "2025-12-09T19:03:03+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3335775/2-chinese-7-russian-jets-enter-south-korean-air-defence-zone-near-japan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f9f400177070db519ed1bf0a35724df6b97911924e924ec03a5ab7db0e7828dc",
        "title": "DeepSeek’s Liang Wenfeng among top 10 ‘people who shaped science in 2025’",
        "summary": "DeepSeek’s founder and CEO, Liang Wenfeng, has been listed among the top 10 “people who shaped science in 2025” by the British journal Nature, which hailed the 40-year-old entrepreneur as a “Chinese finance whizz” whose breakthrough artificial intelligence models had stunned the world.\nThe Nature’s 10 profile of Liang recognised the disruption caused in January by the release of DeepSeek-R1, a reasoning model that showed how “the United States was not as far ahead in AI as many experts had...",
        "source": "smcp",
        "date": "2025-12-09T19:00:16+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3335748/deepseeks-liang-wenfeng-makes-cut-top-10-people-who-shaped-science-2025?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "af326c9270c6265d701dbf3b9c68da40ed8c9a0a16474271170c00094944cb63",
        "title": "7 Chinese warships followed our navy vessel in East Asia, New Zealand says",
        "summary": "New Zealand’s largest naval vessel was followed by seven Chinese warships in a deployment to East Asia last month, including a rare transit through the Taiwan Strait, according to the Pacific nation’s military.\nThe HMNZS Aotearoa, a Polar-class replenishment vessel, was deployed to the East China and Yellow seas with allies, the New Zealand Defence Force said in a statement on Monday.\n“During the operation, the ship was shadowed by seven different People’s Liberation Army (Navy) warships, which...",
        "source": "smcp",
        "date": "2025-12-09T18:59:04+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3335768/7-chinese-warships-followed-our-navy-vessel-its-east-asia-mission-new-zealand-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c243fd938b6f958b04a124a4e4008a8e9393defaa0191b34c5cbc673fbf47ca9",
        "title": "How China can help Africa build human capital",
        "summary": "Whereas then US president Joe Biden initially missed the group photo at the annual Group of 20 summit in Rio de Janeiro last year, requiring a reshoot, his successor did not even bother showing up for this year’s meeting in Johannesburg. US President Donald Trump boycotted the summit due to alleged mistreatment of white people in post-apartheid South Africa.\nYet, even in the absence of the US, the G20 managed to make a leaders’ declaration at the start of the summit, which usually comes at the...",
        "source": "smcp",
        "date": "2025-12-09T17:35:14+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3335374/how-china-can-help-africa-build-human-capital?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8232552f843b43d4f2ea2a86c65dc3f0c606a43138c7970982ff8c6db4840f75",
        "title": "Former chief of China’s food and drug watchdog ousted from Communist Party",
        "summary": "Bi Jingquan, China’s former top food and drug regulator who received an international accolade for promoting innovation, has been expelled from the Communist Party and removed from public office on corruption charges.\nAn investigation found that Bi had accepted gifts, money, trips and banquets and borrowed vehicles from private business owners, a statement from the Central Commission for Discipline Inspection (CCDI) said on Monday.\nThe statement also said Bi had “allowed others to pay for him,...",
        "source": "smcp",
        "date": "2025-12-09T17:00:15+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335712/former-chief-chinas-food-and-drug-watchdog-ousted-communist-party?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b023d9ed3efd774a3da02d7b03b3637d11562521d85610b23d33524d86cff775",
        "title": "Tokyo ‘closely monitoring’ backlash from China, Japanese PM tells lawmakers",
        "summary": "A month after her comments on Taiwan set off a diplomatic firestorm with Beijing, Japanese Prime Minister Sanae Takaichi said Tokyo would “closely monitor” the situation and respond appropriately.\nTakaichi delivered these remarks during a Tuesday morning Diet session, while addressing a draft supplementary budget to fund her administration’s comprehensive economic package.\nOn concerns about the economic impact from Beijing’s countermeasures – which have included a travel alert, a seafood import...",
        "source": "smcp",
        "date": "2025-12-09T15:14:24+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335713/tokyo-closely-monitoring-backlash-china-japanese-pm-tells-lawmakers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1520ab7adf330b8b371b77815205931de488bcdb2486d53b0cea73977bcbe892",
        "title": "Why is China piling on the pressure on Japan with increasing naval operations?",
        "summary": "Chinese naval vessels have intensified pass-through operations as tensions between Beijing and Tokyo continue to rise.\nJapan’s defence ministry said on Tuesday that a PLA Navy Type 054 destroyer had sailed southeastwards between Okinawa Island and Miyako Island, heading towards the Pacific Ocean, while another travelled eastwards through the Osumi Strait.\nThe operations on Monday came shortly after the Chinese aircraft carrier Liaoning charted an unusual course towards Japan’s main islands...",
        "source": "smcp",
        "date": "2025-12-09T14:23:37+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3335703/why-chinas-liaoning-carrier-unique-route-amid-beijing-tokyo-tensions?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "91d29e0fd9a9d8295be30a7f5923db4030a5a0b2b6567cf15cfc15172301e825",
        "title": "China tests super wireless rail convoy that could carry 3 Eiffel Towers",
        "summary": "China has tested a rail system that links multiple freight trains through a wireless system rather than physical coupling.\nOn Monday, a test conducted on the Baoshen Railway in Inner Mongolia saw seven freight trains with a combined cargo capacity of 35,000 tonnes – 3½ times the weight of the Eiffel Tower – running together much more closely than would be usually required when they travel as single units.\nThe technology could increase China’s railway freight transport capacity by more than 50...",
        "source": "smcp",
        "date": "2025-12-09T13:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3335646/china-tests-super-wireless-rail-convoy-could-carry-three-eiffel-towers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "346574d4861f0ff00f9127d5b3e9eaf0ec16243bc6e54da70eef42ce0fc3e09b",
        "title": "Hong Kong launches HKEX Tech 100 Index in pivot towards innovation-driven growth",
        "summary": "Hong Kong Exchanges and Clearing (HKEX) has launched its first equity index tracking Hong Kong-listed technology companies, underscoring the city’s ongoing shift from a market long dominated by property and finance towards innovation-driven growth.\nUnveiled on Tuesday, the HKEX Tech 100 Index tracks 100 large-cap and mid-cap companies spanning artificial intelligence, biotech and pharmaceuticals, electric vehicles and smart driving, information technology, internet, and robotics.\nBiotech...",
        "source": "smcp",
        "date": "2025-12-09T12:33:10+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3335684/hong-kong-launches-hkex-tech-100-index-pivot-towards-innovation-driven-growth?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d70c12021d83f79df85f44c27e3b9eed14c051e9a6e0fa4313160d05aeac1004",
        "title": "Hitting China with tariffs should be ‘last resort’, German foreign minister says",
        "summary": "German Foreign Minister Johann Wadephul has warned that Europe must be “extremely cautious” about slapping tariffs on China, as it could prompt Beijing to take countermeasures that could turn into a “spiral”.\nThe remarks came after French President Emmanuel Macron said he had told Beijing during his visit to China last week that Europe would be forced to take “strong measures” against Chinese goods if the trade imbalance was not addressed.\n“I told them that if they do not react, we Europeans...",
        "source": "smcp",
        "date": "2025-12-09T11:43:59+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3335679/hitting-china-tariffs-should-be-last-resort-german-foreign-minister-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7a6a19ebc548b66c555f8713dbc6be0c4536dd6da50b01ad54e61a7cb09935eb",
        "title": "How Hong Kong can distinguish itself as a climate finance hub",
        "summary": "For decades, New York and London have defined the flow of global capital. But while markets still chase short-term returns in US equities, the next great wave of productive investment is taking shape in East Asia, led by China’s financing, manufacturing and export of the clean technologies that are remaking the global economy.\nThat contrast has only widened. As the United States retreats from climate leadership, China has doubled down. A day after US President Donald Trump called climate change...",
        "source": "smcp",
        "date": "2025-12-09T10:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3334872/how-hong-kong-can-distinguish-itself-climate-finance-hub?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9c17083ab9a9bab81c180a42bf4474fa5c66452cdc890bc9f20e2ade803d7f82",
        "title": "Taiwan RedNote ban backfires, driving mainland Chinese app’s top download rise",
        "summary": "Taiwan’s ban on mainland Chinese social media app RedNote has sparked fierce pushback on the island, making the platform a top download as users rush to access it through workarounds.\nThe island’s interior ministry announced on Thursday it had ordered local telecoms and internet providers to block access to the app, also known as Xiaohongshu, for one year over “rising online fraud cases”. Authorities also cited a “lack of cooperation from its operator in Shanghai”.\nBut the move has unleashed a...",
        "source": "smcp",
        "date": "2025-12-09T10:00:17+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3335652/taiwans-ban-mainland-china-app-rednote-makes-it-top-download-amid-fierce-pushback?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c007f5b8e0bee431998add3f61c09275507d8418f42d81069b30bc75a893ee62",
        "title": "‘A slap in the face’: some US farmers unhappy with Trump’s US$12 billion bailout",
        "summary": "US President Donald Trump has announced a long-anticipated US$12 billion farm aid package to assist farmers caught in US-China trade tensions, crediting his tariff strategy for making the bailout possible and asserting that his negotiations with China had led to the resumption of massive soybean sales.\nBut the announcement has not pleased all farmers, particularly those still struggling with low prices and lost markets. Some said it was too little, too late, and that a bailout wouldn’t be...",
        "source": "smcp",
        "date": "2025-12-09T07:48:49+09:00",
        "url": "https://www.scmp.com/news/us/economy-trade-business/article/3335671/slap-face-not-all-us-farmers-happy-trumps-12-billion-aid-package?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4b8d1df8f02b2103b70263b48adf26547669da832754483c5b4cef5509105574",
        "title": "US Congress unveils bill with curbs on China tech investment and biotech ties",
        "summary": "The US Congress is readying votes on a sprawling bill that would restrict US outbound investment to China in sensitive sectors as well as federal government contracting with Chinese biotechnology companies, two controversial measures that were left out of similar legislation last year.\nThe provisions were included in a compromise defence bill released on Sunday after months of negotiation.\nVotes on the annual bill, known as the National Defence Authorisation Act (NDAA), could happen this week....",
        "source": "smcp",
        "date": "2025-12-09T07:14:05+09:00",
        "url": "https://www.scmp.com/news/us/article/3335668/us-congress-unveils-defence-bill-curbs-china-tech-investment-biotech-ties?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "027eb09b8c96cf8b52a0351f5bd68ca81cdda4cdc6090cef6fba33f148a394d1",
        "title": "Are US, EU and Japan banking on defence spending for an economic boost?",
        "summary": "More than six decades after British historian AJP Taylor termed war the “mother of invention”, economies around the world appear to be ramping up their military spending, at least in part, to reinvigorate industrial production.\nTaylor was referring to the genesis of the tank, the aeroplane and poison gas in World War I, and that of radar, the jet engine and the atomic bomb in World War II. More modern examples, such as satellite-based navigation systems and the internet, were the products of the...",
        "source": "smcp",
        "date": "2025-12-09T07:00:16+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3335612/us-eu-and-japan-boost-defence-spending-stimulus-their-true-intention?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7f00748bcbcdf5da7c55018e56af22d6e49f7637e4fa1a6a23599801aa7e81d9",
        "title": "Rubio and Hegseth discuss Indo-Pacific security with Australian counterparts",
        "summary": "US Secretary of State Marco Rubio and Defence Secretary Pete Hegseth met their Australian counterparts on Monday in Washington for annual talks focused on Indo-Pacific security and countering mainland China’s increasing assertiveness in the region, including in the South China Sea and directed at Taiwan.\nRubio, Hegseth, Australian Foreign Minister Penny Wong and Defence Minister Richard Marles gathered at the State Department, with many eyes also on the Russia-Ukraine war, a fragile ceasefire in...",
        "source": "smcp",
        "date": "2025-12-09T05:23:01+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3335667/rubio-and-hegseth-discuss-indo-pacific-security-australian-counterparts-washington?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "81679c8e591f830a5919fad5379ed2020e4e8d1128423650969261e76046e14c",
        "title": "Federal communications agency may bar Chinese telecoms firms from US networks",
        "summary": "The US Federal Communications Commission (FCC) said on Monday it may bar three major Chinese telecoms companies from connecting to US networks over efforts to prevent robocalls, the latest in a series of actions Washington has taken against Beijing.\nThe FCC issued orders saying China Mobile, China Telecom and China Unicom must address issues with their certifications in the agency’s robocall mitigation database, and raised concerns about their presence in the database.\nIf the FCC removes them,...",
        "source": "smcp",
        "date": "2025-12-09T04:28:56+09:00",
        "url": "https://www.scmp.com/news/world/united-states-canada/article/3335666/federal-communications-agency-may-bar-chinese-telecoms-firms-us-networks?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d47619c27873a4f18d587d2c396e24f97abb8bb230a91f118fba223cb2bfb276",
        "title": "Ant International signs WNBA star Sabrina Ionescu as brand ambassador",
        "summary": "Ant International, the Singapore-based affiliate of Chinese fintech giant Ant Group, has named US basketball star Sabrina Ionescu as its global brand ambassador in a fresh partnership between sports and tech.\nThe four-time all-star in the US Women’s National Basketball Association (WNBA) was chosen as part of an effort to expand access to financial tools via innovative technology, the digital payments provider said on Tuesday.\nThe 28-year-old point guard – an Olympic gold medallist and the top...",
        "source": "smcp",
        "date": "2025-12-09T01:01:07+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3335649/ant-international-signs-wnba-star-sabrina-ionescu-brand-ambassador?utm_source=rss_feed",
        "reportUrl": ""
    }
]