[
    {
        "id": "a910933320706dbf3417ce80aa0615b599024500ef6ee5886ea0900306410fcd",
        "title": "How deadly is CJ-1000, world’s first hypersonic plane killer? PLA gives hint",
        "summary": "Amid the roar of China’s military parade on September 3, a few trucks rolled through Tiananmen Square with camouflaged loads tagged “CJ-1000”.\nThe trucks were hauling surface-launched hypersonic cruise missiles also known as Long Sword-1000s – weapons designed for ultra-long-range strikes on “system-node targets on the ground, at sea or in the air”, according to Chinese state media.\nChina has not officially disclosed the detailed specifications of the CJ-1000. Though a new weapon must pass many...",
        "source": "smcp",
        "date": "2025-09-19T11:00:16+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3326010/how-deadly-cj-1000-worlds-first-hypersonic-plane-killer-pla-war-game-gives-hint?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e3ea6fc4d3cd1206fed8dfe1343a473525d779d5fc3077cc5c14c68742308f9e",
        "title": "Focusing on pageantry, the West misses the point of China’s diplomacy",
        "summary": "China’s recent high-profile diplomatic activity, including the Shanghai Cooperation Organisation (SCO) summit in Tianjin and the Victory Day parade in Beijing in the same week, conveyed more than international headlines suggested.\nAlthough much of the media spotlight focused on the optics of Russian President Vladimir Putin, Indian Prime Minister Narendra Modi and North Korean leader Kim Jong-un, I think the real story centres on pragmatic engagement, regional reassurance and the realignment of...",
        "source": "smcp",
        "date": "2025-09-19T10:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3325907/focusing-pageantry-west-misses-point-chinas-diplomacy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bb56f3c25e4b10a42204b9325f9f787c398d81521788a12c5ffeaa1124aeb274",
        "title": "Beijing makes progress in quashing solar-sector price war: analysts",
        "summary": "Beijing’s fight against disastrous competition in the solar-equipment sector showed early signs of success, with a sustained recovery in prices likely to return leading polysilicon makers to profitability after 18 months of losses, according to analysts.\nA raft of initiatives – including a proposal to limit manufacturing plants’ power use – following a series of government-industry meetings to discuss self-imposed production controls, had borne early fruit, they said.\n“Upstream solar-product...",
        "source": "smcp",
        "date": "2025-09-19T08:30:08+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3325974/beijings-fight-quash-solar-sector-price-war-paying-analysts-say?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6f094b9a47a4ed289952ac8271b148cc7587ee0b523ed3c587c78670bfb847be",
        "title": "How Southeast Asia showed its support for China and sent a message to the US",
        "summary": "Indonesian President Prabowo Subianto had a last-minute change of plan when he travelled to Beijing to attend China’s military parade in Tiananmen Square, just hours before it began.\nPrabowo had earlier decided to cancel the trip because of widespread protests at home.\nBut he showed up for the parade in a grey suit on the morning of September 3, taking a seat at the rostrum beside Russian leader Vladimir Putin, who was to the right of Chinese President Xi Jinping.\nSources said the Indonesian...",
        "source": "smcp",
        "date": "2025-09-19T07:00:20+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3325969/how-southeast-asia-showed-its-support-china-and-sent-message-us?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "68721f7eda5dfb325fabbb836eb2983866189c0f28d263b3f299317f1aff18e4",
        "title": "Asian-American businesses are being decimated by Trump tariffs, lawmakers warn",
        "summary": "Businesses owned by Asian-Americans are struggling with mounting costs as a result of US President Donald Trump’s tariffs, with some potentially being forced to shut down, a group of Democratic lawmakers warned on Thursday as they urged the administration to reverse the duties.\nThe warning, reflecting growing national discontent regarding Trump’s tariffs, coincided with a media briefing in front of the US Supreme Court where a group representing over a hundred small business owners pressed their...",
        "source": "smcp",
        "date": "2025-09-19T05:33:46+09:00",
        "url": "https://www.scmp.com/news/us/article/3326050/asian-american-businesses-are-being-decimated-trump-tariffs-democratic-lawmakers-warn?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d9190a4ba758872cc6d89ca9cfc9fa9a7bf48110c1e807e633bb60f8a43eeae0",
        "title": "Trump vows US push to reclaim key Afghan air base, ties it to China",
        "summary": "US President Donald Trump said on Thursday that his administration was moving to retake control of Bagram Air Base in Afghanistan, claiming that such a move was necessary because of the facility’s proximity to nuclear weapons sites in China.\nBagram, located 44 kilometres (27 miles) north of Kabul, was the largest US military base in Afghanistan and the central hub of the 20-year US-led campaign until American and Nato forces withdrew in 2021 under former US president Joe Biden.\n“We’re trying to...",
        "source": "smcp",
        "date": "2025-09-19T02:25:40+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3326045/trump-says-us-moving-reclaim-key-afghan-air-base-links-it-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7f9ea311f7d1d34934d73504ac945ee4ba3ca563a9d55dc4bf21ef0396c57d31",
        "title": "China backs Venezuela, warns US against ‘bullying’ after second deadly sea raid",
        "summary": "Venezuela’s foreign minister said Wednesday that China pledged support for Caracas’ efforts to preserve peace in the Caribbean, quoting Ambassador Lan Hu as saying Beijing stood “in solidarity” as Washington pressed ahead with military strikes on boats it claimed were carrying drugs.\nForeign Minister Yvan Gil met with Lan in Caracas and described the message from Beijing as a significant gesture at a time when the United States had deployed warships and launched two deadly operations in less...",
        "source": "smcp",
        "date": "2025-09-19T01:02:15+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326043/china-backs-venezuela-warns-us-against-bullying-after-second-deadly-sea-raid?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a1fe869016fccac0c24ee8ba6484f9f677f40b0ff045428a8ca6f4c89b09cd1e",
        "title": "No orders from China: US farmers, desperate for trade deal, walk ‘tightrope’",
        "summary": "American farmers are “walking a tightrope” between supporting US President Donald Trump’s tariffs and suffering serious financial losses in the absence of a highly anticipated US-China trade deal, according to a seasoned farmer from South Dakota, one of the country’s top agricultural states.\nMike McCranie, a soybean and corn producer, voiced support for Washington’s tariff policy “if it results in a long-term deal” but acknowledged it has hurt US farmers.\nNo Chinese orders have been placed this...",
        "source": "smcp",
        "date": "2025-09-19T00:00:09+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3326006/no-orders-china-us-soybean-farmers-desperate-trade-deal-walk-tightrope?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "62902ed252f0966d97ea8a2e65eedc9e9cc82e2dba0b809f562d3c21b6d04603",
        "title": "How Nobel-winning biologist David Baltimore helped the rise of science in China",
        "summary": "David Baltimore, the Nobel Prize-winning American biologist who died this month at 87, built a legacy in China through decades of scientific exchange that helped the country rise as a global powerhouse in life sciences.\nBaltimore revolutionised gene research in his 30s and went on to mentor dozens of Chinese researchers and advise on the creation of top research institutions in the nation. His final paper was published in a Chinese journal.\nSince his passing, scientists in China and...",
        "source": "smcp",
        "date": "2025-09-18T23:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3325966/how-nobel-winning-biologist-david-baltimore-helped-rise-science-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5d7f0e6bcbe6f90b095f20eecdd0a4d9ff3901ff8feee4e8bde1f3e35be9293f",
        "title": "Chinese state firm to help build Chilean railway, expanding global business base",
        "summary": "A Chinese state-run company will help build a section of Chilean capital Santiago’s commuter rail system, as a host of contractors from China bid to construct a tunnel along the same railway system, reflecting Beijing’s burgeoning economic ties in Latin America.\nA consortium led by China Railway Construction (CRCC) has reached a US$470 million agreement with Chile’s State Railway to build a 26km (16.2-mile) electric railway in the South American country’s congested capital, Chinese media outlets...",
        "source": "smcp",
        "date": "2025-09-18T22:30:08+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3325988/china-state-firm-help-build-26km-chilean-electric-railway-peers-eye-tunnel-project?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "68bc2c8e059ce18996b17f066cfca6fef0f4c800916b6431fd01da800e937241",
        "title": "Chinese defence minister’s speech, US Fed cuts rates: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Takeaways from Chinese Defence Minister Dong Jun’s speech at Xiangshan Forum\nAs China hosts its annual defence conference, the Beijing Xiangshan Forum, Defence Minister Dong Jun outlined the country’s priorities and aims.\n2. US Fed cuts rates for first time in 2025 amid pressure from Trump, weaker job outlook\nThe US Federal Reserve has announced that it...",
        "source": "smcp",
        "date": "2025-09-18T22:15:08+09:00",
        "url": "https://www.scmp.com/news/china/article/3326021/chinese-defence-ministers-speech-us-fed-cuts-rates-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0179ff42d447bc73e1770b7cc4289c0d6c7894f192644995d0b5034ec6322d6a",
        "title": "Highlights of tech innovation in China's 14th Five-Year Plan",
        "summary": "Highlights of tech innovation in China's 14th Five-Year Plan",
        "source": "cgtn",
        "date": "2025-09-18T22:07:21+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/Highlights-of-tech-innovation-in-China-s-14th-Five-Year-Plan-1GLX7uT1Xlm/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a788e94de344b591e48b561cec6ee438bef470c74cfcba437021bba0c0c99c7a",
        "title": "China marks grim anniversary tied to Japan with air raid sirens, film debut",
        "summary": "Air raid sirens sounded in more than 100 cities across mainland China on Thursday to mark the anniversary of the “Mukden Incident” in 1931, the beginning of Japan’s invasion of China.\nThe incident refers to the evening of September 18 when the Japanese Kwantung Army in Shenyang, Liaoning province, used an explosion on the South Manchuria Railway as a pretext for an invasion and quickly occupied three northeastern provinces.\nMany Chinese view the incident as a day of national humiliation.\nBut in...",
        "source": "smcp",
        "date": "2025-09-18T22:02:56+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3326020/china-marks-grim-anniversary-tied-japans-aggression-air-raid-sirens-film-debut?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "872364ca3f5fdc2de7a87f4e2dd7afa1672a72a1ade568dbb2de71b825d8ed63",
        "title": "Can a Xi-Trump phone call deliver an off-ramp from US-China tensions?",
        "summary": "An expected phone call between Chinese President Xi Jinping and US President Donald Trump on Friday could pave the way for further engagement and progress towards a possible summit between the two leaders, according to a prominent Chinese academic.\n“Tomorrow’s phone call will give a sense of direction – whether the [US-China] relationship is moving more quickly towards a summit,” said Wu Xinbo, dean of the Institute of International Studies and director at the Centre for American Studies at...",
        "source": "smcp",
        "date": "2025-09-18T22:01:07+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326026/can-xi-trump-phone-call-deliver-ramp-rising-us-china-tensions?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1c906ead30af6367464e0d3b7b9e3f4c159e5652eb5070edd4243ffc921b2786",
        "title": "China says will never reach deal at expense of principles, companies",
        "summary": "China says will never reach deal at expense of principles, companies",
        "source": "cgtn",
        "date": "2025-09-18T21:54:08+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/China-says-will-never-reach-deal-at-expense-of-principles-companies-1GLYRWWtSTu/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "38e23e909eb8e44c87408a0b1318e3b365bcb711f05b59071cd88f7b87adf57b",
        "title": "Chinese film on Nanjing Massacre resonates with audience in Tokyo",
        "summary": "Chinese film on Nanjing Massacre resonates with audience in Tokyo",
        "source": "cgtn",
        "date": "2025-09-18T21:50:31+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/Chinese-film-on-Nanjing-Massacre-resonates-with-audience-in-Tokyo-1GLYJv8SVgc/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "72ef58787fc68262ecd5d9be3843b5844d6e5d415d8a5dd115879885b8dd027c",
        "title": "Clash between Chinese scholar and Israeli diplomat over Gaza goes viral",
        "summary": "A heated exchange between a prominent Chinese international relations scholar and an Israeli military representative about the war in Gaza has gone viral on social media.\nThe fierce exchange happened on the sidelines of the annual Xiangshan forum in Beijing on Wednesday.\nYan Xuetong, dean of the Institute of International Relations at Tsinghua University, was shown confronting Elad Shoshan, the military attaché with the Israeli embassy in Beijing, who claimed that the reason for the conflict was...",
        "source": "smcp",
        "date": "2025-09-18T20:59:49+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326025/chinese-scholar-confronts-israeli-diplomat-over-gaza-xiangshan-forum-viral-video?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3d0bd01f81145c707f27bd6539069bcfd6032fe063dcc1846f86cd1fe37e22cd",
        "title": "Cybersecurity tips: Quick checks you can do now",
        "summary": "Cybersecurity tips: Quick checks you can do now",
        "source": "cgtn",
        "date": "2025-09-18T20:34:06+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/Cybersecurity-tips-Quick-checks-you-can-do-now-1GLSyq8OMFy/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0755f59e97f5542eabb2d18308bc0befbabf31a267aecbdce72eec8397c89c24",
        "title": "China's contribution to WWII victory under-valued: war historian",
        "summary": "China's contribution to WWII victory under-valued: war historian",
        "source": "cgtn",
        "date": "2025-09-18T19:46:40+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/China-s-contribution-to-WWII-victory-under-valued-war-historian-1GLKvdlAIoM/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "bbb03e091743d41638f9985cfea262687113ea3edb7ffa6cd895be971e7073d0",
        "title": "Xinjiang color palette: Hetian, artistry of craftsmanship and culture",
        "summary": "Xinjiang color palette: Hetian, artistry of craftsmanship and culture",
        "source": "cgtn",
        "date": "2025-09-18T19:45:37+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/Xinjiang-color-palette-Hetian-artistry-of-craftsmanship-and-culture-1GLQoMyhxtu/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "fb6d9add3ac73feee807422a0e9b71ac323a30616a1cfb2cad318f144e28bf7b",
        "title": "Southeast Asian visitors power growth in visa-free arrivals in China",
        "summary": "Visa-free entries into China by foreign nationals rose by more than half in the first eight months of the year, with visitors from Southeast Asia accounting for a big part of the growth.\nThe National Immigration Administration (NIA) said on Thursday that foreign nationals made 15.89 million visa-free entries from January to August.\nThe NIA did not give a total for the number of entries during the period but did say that visa-free entries made up roughly two-thirds of international arrivals,...",
        "source": "smcp",
        "date": "2025-09-18T19:06:48+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326011/southeast-asian-visitors-power-growth-visa-free-arrivals-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0445e01614b6b88ee714553b415dd532f8ab87158aacd90cce18c782a14856f3",
        "title": "China unveils Global Climate Dataset, boosts AI cooperation with ASEAN",
        "summary": "China unveils Global Climate Dataset, boosts AI cooperation with ASEAN",
        "source": "cgtn",
        "date": "2025-09-18T18:19:34+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/China-unveils-Global-Climate-Dataset-boosts-AI-cooperation-with-ASEAN-1GLIfSynGow/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "2aaf9c6d7fae773b8e7be1927bfea54f713dd87a2d1777b396a460d89edf84ad",
        "title": "China’s defence chief slams Western ‘bullying’, rallies regional allies",
        "summary": "China’s defence minister summoned familiar talking points as he took aim at Western nations during a security conference on Thursday, urging nations to stand up against “bullying” and describing military alliances as groups with “selfish interests”.\nDong Jun did not name any country but his calls appeared to resonate with defence chiefs from Southeast Asia, as they took turns criticising unilateral action, including tariffs, and calling for greater efforts to advance multilateralism.\nDong...",
        "source": "smcp",
        "date": "2025-09-18T18:14:41+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3325991/chinas-defence-minister-warns-against-western-bullying-rallies-regional-allies?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "153175ab480e255b9321635e3b130abca357dcf70e6da06dd66f6380caf89038",
        "title": "Film about Japan's WWII germ warfare sets China's screening record",
        "summary": "A Chinese film about Japan's infamous WWII germ warfare Unit 731 and its inhumane medical experiments on Chinese victims has set a new benchmark in China's film industry.",
        "source": "cgtn",
        "date": "2025-09-18T17:42:01+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/Film-about-Japan-s-WWII-germ-warfare-sets-China-s-screening-record-1GLIcSomlna/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "7d75fd742505d280e359545a599935d2e6b770c2e1ab2027eee0446b0b1f59df",
        "title": "China sees 460 million border crossings in first eight months of 2025",
        "summary": "China sees 460 million border crossings in first eight months of 2025",
        "source": "cgtn",
        "date": "2025-09-18T17:23:02+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/China-sees-460-million-border-crossings-in-first-eight-months-of-2025-1GLAW5uhXtm/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "7fb150a0e5b25688340776f53300184a035f6ea0610d85949b0fc94341676b40",
        "title": "Conventional weapons enough to ‘resolve Taiwan issue’, former PLA general says",
        "summary": "Mainland China’s conventional weapons are “sufficient” to “resolve the Taiwan issue”, but peaceful reunification is still the preferred option, according to a retired general.\nOn Wednesday, Lieutenant General He Lei, the former vice-president of the People’s Liberation Army Academy of Military Sciences, told Phoenix Television that there was “no explicit distinction” about whether mainland China’s advanced weaponry was aimed at Taiwan.\nSpeaking on the sidelines of the Xiangshan military forum in...",
        "source": "smcp",
        "date": "2025-09-18T17:22:02+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3325984/mainland-chinas-conventional-weapons-enough-resolve-taiwan-issue-says-ex-general?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4ef50deb02e4ca5315a577244d2e0372235258def44abcf40b05f5025fc2073a",
        "title": "AI takes center stage at the 22nd China-ASEAN Expo",
        "summary": "AI takes center stage at the 22nd China-ASEAN Expo",
        "source": "cgtn",
        "date": "2025-09-18T15:52:04+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/AI-takes-center-stage-at-the-22nd-China-ASEAN-Expo-1GLxTFTpIIw/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "09cd0fce8153a5e78959f81e12af49da25765160676c338449a27178e778edb2",
        "title": "South Korea should join China as bulwark against ‘rampant’ bullying: Wang Yi",
        "summary": "China has urged South Korea to join it in defending free trade against “rampant” unilateral bullying amid the bitter trade war with the United States.\n“Both China and South Korea are beneficiaries of economic globalisation,” Chinese Foreign Minister Wang Yi told his South Korean counterpart, Cho Hyun, in a meeting in Beijing on Wednesday.\n“In the current situation where unilateral bullying is rampant, we should jointly oppose trade protectionism and safeguard the international free trade...",
        "source": "smcp",
        "date": "2025-09-18T15:04:22+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3325962/south-korea-should-side-china-bulwark-against-rampant-bullying-trade-wang-yi?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d0766327b0ae7b3154372eb4edc3e255357d01a47a0ee8bba55a82fc80073dca",
        "title": "China’s job market woes deepen as youth unemployment hits record since 2023",
        "summary": "China’s urban youth unemployment rate rose last month to the highest level since the data set was adjusted in 2023, as career prospects for young people have weakened amid an economic slowdown.\nThe jobless rate for those aged 16 to 24, excluding students, rose to 18.9 per cent in August from 17.8 per cent in July, according to data released by the National Bureau of Statistics on Wednesday.\nAfter the jobless rate for the demographic rose to an all-time high of 21.3 per cent in June 2023, Beijing...",
        "source": "smcp",
        "date": "2025-09-18T14:00:18+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3325950/chinas-youth-unemployment-soars-2-year-high-job-crunch-deepens?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a89030ea784e0571d0f0f32c4caff37ed61700e571843dbc2122ca8d9c60d088",
        "title": "EU, China parliaments aim to hold their first talks in 7 years on October 16",
        "summary": "The first official meeting between the European Parliament and China’s National People’s Congress for seven years is slated for October 16, confirming a continued thaw in relations between the two chambers.\nThe meeting has been in the works for months since the sides moved to lift restrictions on each other, but it was confirmed by the European Conference of Presidents last week, with invitations to be sent from Brussels imminently.\nSources familiar with the arrangement said the leadership group...",
        "source": "smcp",
        "date": "2025-09-18T13:29:51+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3325952/eu-china-parliaments-aim-hold-their-first-talks-seven-years-october-16?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4f186f436363355d394f1dc5049b7514fcd511e7ec5b033cd9bc657280062516",
        "title": "Talk Xinjiang｜City of Folded Time",
        "summary": "A uniquely special city, known as a living thousand - year-old city. Some say, it folds time and space. Beyond music, dance, and poetic architecture, Kashi holds legends passed down for millennia.",
        "source": "cgtn",
        "date": "2025-09-18T13:06:41+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/Talk-Xinjiang-City-of-Folded-Time-1GJHRDH0aeA/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "bfc450d5fc0d0cb3d132f1753893127126883d9e91f1ec1a49278669f4668f29",
        "title": "AI-enhanced bodycams among advanced police gear China shows developing nations",
        "summary": "China has showcased and marketed a range of new public security equipment, including AI-assisted facial recognition surveillance devices, in an exhibition for police forces in developing countries.\nThe equipment was displayed at the three-day Global Public Security Cooperation Forum, which runs in the coastal city of Lianyungang, Jiangsu province, until Thursday.\nAccording to state broadcaster CCTV, the exhibition’s theme is “Security Sharing, Development Integration”.\n\n\n“Through this showcase,...",
        "source": "smcp",
        "date": "2025-09-18T13:00:09+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3325892/china-showcases-ai-enhanced-bodycams-developing-nations-police-expo?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1783add7a6854655dc73f88ffd96e0bc8d8b372d87f856f4d97e5180ae61a79e",
        "title": "Huawei bypasses Nvidia AI chips in touting key breakthrough for China",
        "summary": "Huawei Technologies on Thursday unveiled hardware that it said could deliver world-class computing power without using Nvidia’s advanced chips, in a breakthrough that could potentially break the supply chokehold that constrains China’s aspirations in artificial intelligence.\nThe Shenzhen-based telecommunications equipment giant’s high-profile disclosure came just a day before a scheduled phone call between President Xi Jinping and his US counterpart Donald Trump, as Beijing seeks to minimise US...",
        "source": "smcp",
        "date": "2025-09-18T12:38:38+09:00",
        "url": "https://www.scmp.com/tech/tech-war/article/3325942/tech-war-huawei-bypasses-nvidia-ai-chips-computing-breakthrough-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "46af9d6b71fdf53ac772f37cd8434a4c61263ea6262084d8572a41a95bcb6e0c",
        "title": "China commemorates war against Japanese aggression",
        "summary": "Sirens wailed and a bell tolled in northeast China on Thursday to commemorate the 94th anniversary of the September 18 Incident, which marked the start of China's war of resistance against Japanese aggression.",
        "source": "cgtn",
        "date": "2025-09-18T12:24:59+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/China-commemorates-war-against-Japanese-aggression-1GLfOFuzf9K/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "549ed26b1c523cccdc4a78467f842bc0288b5739ae8f980f9796f28a7bc0fb1a",
        "title": "After Fed cut, moderate easing expected by China’s central bank, supporting yuan",
        "summary": "After the US Federal Reserve delivered its first interest rate cut of the year, analysts said China’s central bank would be most likely engage in moderate easing this year even as the cut creates more room for looser monetary policy.\nOn Thursday morning, the People’s Bank of China set the yuan’s midpoint rate – also known as the daily fixing rate – at 7.1085 per US dollar, weaker than Wednesday’s rate of 7.1013.\nThe move followed the Fed’s announcement on Wednesday of a widely expected cut of...",
        "source": "smcp",
        "date": "2025-09-18T11:28:28+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3325935/after-fed-rate-cut-only-moderate-easing-expected-chinas-central-bank-supporting-yuan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f9cc0f1bfae05e98b24dfb9b08cb00c52ad8cacff516ce51e8a8640b8aec8bbb",
        "title": "Takeaways from Chinese Defence Minister Dong Jun’s speech at Xiangshan Forum",
        "summary": "As China hosts its annual defence conference, the Beijing Xiangshan Forum, Defence Minister Dong Jun outlined the country’s priorities and aims.\nDuring his 30-minute keynote speech Dong addressed key issues, including Taiwan, the South China Sea and China’s take on regional blocs by US allies.\n\n1. Historical memory and 9/18 anniversary\nDong opened by marking the 918 Incident in which Japan began its invasion of China, starting from the northeast in 1931. He urged nations to “never forget the...",
        "source": "smcp",
        "date": "2025-09-18T10:51:36+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3325931/takeaways-defence-minister-dong-juns-speech-xiangshan-forum?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "be134662a1d2981aa79dfe7760103adb3e7e8d71e00d6d6f177de0f97b3441a4",
        "title": "Support young Chinese venturing off the usual gaokao path",
        "summary": "When Gong Sheng was in high school, he made a bold decision. Despite scoring well and getting into a prestigious middle school in Sichuan, the student suddenly decided to transfer to a vocational school and learn to cook.\nHe could have followed a standard academic path, but by chance he had a culinary encounter that brought a “spiritual awakening”, he said. Gong, who spoke to the media last week at the tourism college where he is now enrolled for a cooking and catering programme, added that...",
        "source": "smcp",
        "date": "2025-09-18T10:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3325744/china-should-open-more-paths-youth-chase-their-dreams?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9d5ff6f25b2ae0a91c3483317553534422a72903ea8b233af3ec329d1aa52588",
        "title": "Chinese defense chief calls for strong support for global governance",
        "summary": "China's Minister of National Defense Dong Jun on Wednesday called for efforts to provide strong support for global governance, and to work together to build a community with a shared future for humanity.",
        "source": "cgtn",
        "date": "2025-09-18T10:12:00+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/Chinese-defense-chief-calls-for-strong-support-for-global-governance-1GL9xJunJoQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "38d4b00621b7e0866e6ffe06b10c85757c81aeac1a8b86c96fa82c0a7f86431b",
        "title": "Chinese military official urges greater contributions to world peace",
        "summary": "Chinese military official urges greater contributions to world peace",
        "source": "cgtn",
        "date": "2025-09-18T10:11:06+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/Chinese-military-official-urges-greater-contributions-to-world-peace-1GL6tfqSJSE/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ae06ccc74fd259e5145fe88aa7aa2700fb8454e1c3d049a98b89d7a4392594f8",
        "title": "Chinese defense minister vows greater efforts to safeguard world peace",
        "summary": "Chinese Defense Minister Dong Jun on Thursday pledged greater efforts to safeguard world peace at the 12th Beijing Xiangshan Forum.",
        "source": "cgtn",
        "date": "2025-09-18T09:38:19+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/Chinese-defense-minister-delivers-keynote-speech-at-12th-Beijing-Xiangshan-Forum-1GL8Jtys8OA/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "3357fbe0b91e3ae06602cede4f957d7475e637987af2a69610e31938e0d30fbb",
        "title": "Dong Jun addresses Xiangshan Forum, as it happened – China a force for peace",
        "summary": "This live blog has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing.\nThe Chinese capital is this week hosting the country’s most important annual defence conference, the Beijing Xiangshan Forum.\nThe three-day event follows a flurry of high-profile diplomatic activity in recent weeks, including the Shanghai Cooperation Organisation summit in Tianjin and the Victory Day military parade in Beijing.\nMore than 100 defence...",
        "source": "smcp",
        "date": "2025-09-18T09:26:26+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3325927/chinese-defence-minister-dong-jun-address-xiangshan-forum?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e0b7351f2980b4e661e61f470f71d60fff07210e3f36791d41f4dea73e257e3d",
        "title": "Blue Helmets, No Borders | Peace Begins with Water",
        "summary": "CGTN correspondents go with the Chinese Infantry Battalion in South Sudan as they deliver fresh water to Nakitum village near Juba.",
        "source": "cgtn",
        "date": "2025-09-18T08:08:21+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/Blue-Helmets-No-Borders-Peace-Begins-with-Water-1GJSUpd1fcQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "63adbf29a0cfd65e592fc9d1494ab4509246f9a28f302f086d87148c1380f28b",
        "title": "Blue Helmets, No Borders | Part Three: Lines of Trust",
        "summary": "What they build are not just roads, but trust.",
        "source": "cgtn",
        "date": "2025-09-18T08:05:15+09:00",
        "url": "https://news.cgtn.com/news/2025-09-18/Blue-Helmets-No-Borders-Part-Three-Lines-of-Trust-1GJSwimfv4A/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "15e2ce2d21a355b563bcc586e243fc9fca5b9346e39386f13e5cf1a71738cabb",
        "title": "Hong Kong matches US Fed’s rate cut in boon for borrowers, economy",
        "summary": "Hong Kong’s de facto central bank cut the city’s base rate for the first time this year, bringing down the cost of funding to help reboot businesses and reduce the burden on mortgage borrowers.\nThe Hong Kong Monetary Authority (HKMA) reduced the city’s base rate by a quarter point to 4.5 per cent on Thursday, matching the US Federal Reserve’s cut hours earlier to its target rate, which fell to the range of 4 per cent to 4.25 per cent during the sixth meeting of the Federal Open Market Committee...",
        "source": "smcp",
        "date": "2025-09-18T08:00:43+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3325925/hong-kong-cuts-base-rate-first-time-2025-matching-feds-move-amid-weak-us-jobs?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "10ee06d2bce4bd7820b157c21bc2214ee35255ca35fb4e4caa587a1a1e30da67",
        "title": "China pushes for closer Southeast Asia trade links as it fends off US pressure",
        "summary": "Vice-President Han Zheng urged China and Southeast Asia to deepen their strategic alignment on Wednesday, as Beijing pushes to upgrade its free trade area agreement with the region amid the US trade war.\nThe world’s second-largest economy aims to “strengthen the alignment of development strategies and tighten the bonds of our shared community” with the 10-member Association of Southeast Asian Nations (Asean), Han said in his opening address at the China-Asean Expo in the southwestern Chinese...",
        "source": "smcp",
        "date": "2025-09-18T08:00:08+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3325860/china-pushes-closer-southeast-asia-trade-links-it-fends-us-pressure?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "da87d21ad6fed143889ad6f3b37b17bfd99b2b3a7794125d339e4175ccfc4e45",
        "title": "WTO chief finds hope in Trump trade disruption, sees chance for ‘reglobalisation’",
        "summary": "The head of the world’s trade watchdog has delivered an upbeat take on US President Donald Trump’s unilateral tariffs – one of the biggest shocks to the global trading system since its emergence after the Second World War – casting the disruptions as a chance to cut supply imbalances, open new markets and spur “reglobalisation”.\nA little over six months since Trump began slapping new levies on America’s trading partners, WTO Director-General Ngozi Okonjo-Iweala said on Wednesday that nearly...",
        "source": "smcp",
        "date": "2025-09-18T03:50:28+09:00",
        "url": "https://www.scmp.com/news/us/economy-trade-business/article/3325922/reglobalisation-wto-chief-finds-hope-trumps-trade-disruption?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "256b7b54b814991e0035f1ce8bedfa142f51041da44f46e271c8431405b3121e",
        "title": "Ex-Ecuador president calls bribery case over belt and road dam a ‘farce’",
        "summary": "Former Ecuadorian president Lenin Moreno on Tuesday denounced as “a farce” the bribery charges that prosecutors say link him and his family to US$76 million in payments from a Chinese state builder that managed part of one of the biggest South American projects in Beijing’s global Belt and Road Initiative.\nLenin insisted the accusations are a political vendetta orchestrated by former president Rafael Correa, under whose government the controversial Coca Codo Sinclair hydroelectric plant was...",
        "source": "smcp",
        "date": "2025-09-18T01:50:45+09:00",
        "url": "https://www.scmp.com/news/china/article/3325917/ex-ecuador-president-calls-bribery-case-over-belt-and-road-dam-farce?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "73722fa6d802cdad29e25479fae5bb6b38f988c4b20a64d81f18ed07cd8ba806",
        "title": "China’s AI weapons warning, busy ‘golden week’ predicted: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. China warns terrorists could use AI to create and fire their own weapons\nChina has warned that artificial intelligence will allow people to learn how to make their own world-destroying weapons, such as nuclear missiles and biological and chemical weapons.\n2. Trump’s China trip may hinge on jet and soybean deals, sources say\nChina and the United States are...",
        "source": "smcp",
        "date": "2025-09-18T01:36:53+09:00",
        "url": "https://www.scmp.com/news/china/article/3325916/chinas-ai-weapons-warning-what-trumps-beijing-trip-may-hinge-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b0073b83487c615dfb52c12578b496f4887ba071d4872ad1855246591cccf5ef",
        "title": "Wang Yi: China, ROK should jointly oppose trade protectionism",
        "summary": "Chinese Foreign Minister Wang Yi said on Wednesday that China and the Republic of Korea (ROK) should jointly oppose trade protectionism during talks with ROK Foreign Minister Cho Hyun in Beijing.",
        "source": "cgtn",
        "date": "2025-09-18T00:11:08+09:00",
        "url": "https://news.cgtn.com/news/2025-09-17/Wang-Yi-China-South-Korea-should-jointly-oppose-trade-protectionism-1GKtMbVOqfm/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "6c9a7ea409f547ce8eb35fa298e66e9a66b3ca0c5dee40fd64cfde37dc240168",
        "title": "DeepSeek secrets unveiled: engineers reveal science behind Chinese AI model",
        "summary": "Engineers behind the viral Chinese artificial intelligence (AI) reasoning model DeepSeek-R1 have unveiled the deep science behind its training.\nUpon its release in January, the open-source model developed by Hangzhou-based AI start-up DeepSeek sent shock waves through the industry when it became a challenger to US-based OpenAI’s industry-leading o1 model.\nNow, the DeepSeek AI team has revealed how they used rewards to train their R1 model to solve problems, allowing them to bypass some of the...",
        "source": "smcp",
        "date": "2025-09-18T00:00:18+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3325895/deepseek-secrets-unveiled-engineers-reveal-science-behind-chinas-viral-ai-model?utm_source=rss_feed",
        "reportUrl": ""
    }
]