[
    {
        "id": "fc37bd6893da35df0e8446d23d553b7ae302e5bcfb3fe968d0d45ab1ef50a8e0",
        "title": "How have China’s 5-year plans shaped its economic trajectory?",
        "summary": "Though China moved away from a command economy decades ago, its successive five-year plans have remained a pillar of macroeconomic policymaking.\nDespite that seeming contradiction, under the 14 plans implemented since 1953, Beijing has turned what was a limited industrial capacity into a scale of mass production that has earned China a reputation as the “world’s factory.”\nBeijing is now endeavouring to move higher in the value chain and become a global hub for innovation in cutting-edge sectors...",
        "source": "smcp",
        "date": "2025-09-24T09:00:29+09:00",
        "url": "https://www.scmp.com/economy/policy/article/3326547/how-have-chinas-5-year-plans-shaped-countrys-economic-trajectory?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c13405f4233497996da3204005129be8abe5f0b86cdd22456d7e60556a806a5d",
        "title": "Legendary China scholar, Jerome Cohen, dies at 95",
        "summary": "Jerome Cohen, a pioneering scholar of Chinese law who shaped global debates on the country’s legal system, trade, and human rights for over six decades, has died at 95.\nCohen, who died on Monday, was professor emeritus at New York University’s School of Law and the founder of its US-Asia Law Institute, as well as a senior fellow for Asia studies at the Council on Foreign Relations think tank.\nThe author and editor of over a dozen books and dozens of journal articles, Cohen began his career in...",
        "source": "smcp",
        "date": "2025-09-24T07:21:18+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326607/jerome-cohen-respected-china-law-expert-and-regular-critic-dies-95?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "4ac430ba9430a92fed37c0f1320cc42001fae5ee9598dfadd9b7684a147f6651",
        "title": "China’s local governments urgently need cash. Can the 5-year plan find it?",
        "summary": "As China drafts its 15th five-year plan – the next entry in a line of expansive blueprints that have set the tone for the country’s development over more than seven decades – we examine how these documents inform and reflect high-level policy priorities, and what to expect in the coming iteration, such as how it could help alleviate local-level financial woes.\nFor more entries in this ongoing series, click here.\nIn late March, an announcement by the central Hubei province sent a shiver down the...",
        "source": "smcp",
        "date": "2025-09-24T07:00:10+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3326531/chinas-local-governments-urgently-need-cash-can-5-year-plan-find-it?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "52cdd0baefd3e55676c5816f0624b9c404669b7f90f245b8605f07e1ba09e64d",
        "title": "China backs Brazil’s US$125 billion fund to protect tropical forests",
        "summary": "China endorsed Brazil’s $125 billion Tropical Forests Forever Facility at a sideline event in New York on Tuesday, lending weight to a flagship fund that rewards nations for preserving tropical forests and injecting fresh momentum into one of the main initiatives set to debut at COP30 in Belem this November.\nThe TFFF, devised by Brazil with support from the World Bank and international partners, will invest in low-risk assets and channel part of the returns to tropical countries at up to $4 per...",
        "source": "smcp",
        "date": "2025-09-24T06:35:22+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3326605/china-backs-brazils-us125-billion-fund-protect-tropical-forests?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "634e88bbaa594ad6edc43a976dce000801412a75731645d074b9a9647fb059b4",
        "title": "What Scarborough nature reserve plan means for South China Sea",
        "summary": "China’s decision to establish a national nature reserve at Scarborough Shoal – known as Huangyan Island in China and Panatag Shoal in the Philippines – has hit regional headlines as the plan involving the contested South China Sea feature swiftly became a diplomatic flashpoint.\nApproved by China’s State Council and announced by the National Forestry and Grassland Administration, the plan covers some 3,500 hectares of ecologically sensitive reef and waters, divided into “core” and “experimental”...",
        "source": "smcp",
        "date": "2025-09-24T06:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3325981/what-scarborough-nature-reserve-plan-means-south-china-sea?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7571c0da4d44995925de4a3bd947249bc81d532df93def5600a1d5e8ad899d48",
        "title": "Brazil’s Lula rebukes Washington at UN, yet finds surprise US opening",
        "summary": "Brazilian President Luiz Inacio Lula da Silva used the UN rostrum on Tuesday to excoriate Washington over tariffs and military actions, promote closer ties with China, and call for reform of global institutions – only to be met moments later by an unexpected olive branch from US President Donald Trump, who proposed meeting him next week.\nLula’s address came against the backdrop of sharp tensions with the United States, including 50 per cent tariffs on imports from Brazil, which Trump has imposed...",
        "source": "smcp",
        "date": "2025-09-24T04:30:36+09:00",
        "url": "https://www.scmp.com/news/china/article/3326600/lula-rebukes-washington-un-yet-finds-surprise-us-opening?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bb63129e13877c449b1951651fca6e53d450e26d41a7612de39c9ed4f67e5264",
        "title": "Trump attacks UN in fiery General Assembly speech, slams global institutions",
        "summary": "US President Donald Trump offered up a litany of grievances in a combative UN speech on Tuesday that called on the global community to end “failed approaches”, stop supporting renewable energy and recognise that “I have ended seven unendable wars”.\nAddressing the world’s foremost diplomatic body with his typically undiplomatic rhetoric, Trump boasted about revitalising US fortunes, adding that the US has the “greatest weapons on earth” that it would rather not deploy.\n“Not only is the UN not...",
        "source": "smcp",
        "date": "2025-09-24T01:47:53+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326596/trump-attacks-un-fiery-general-assembly-speech-slams-global-institutions-and-aid?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c7deb30f8756ed6e769bb82c0387b6b62f0a567b8530ce545d272c9ff9ba1504",
        "title": "China criticises Japan’s laser weapon plans as threat to regional stability",
        "summary": "The Chinese military has warned against Japan’s laser weapon plans, accusing Tokyo of undermining regional security.\nJapan has made progress in road-mobile laser weapons and will begin a ship-mounted laser weapon programme that can intercept incoming small unmanned aerial vehicles (UAVs), a commentary in the PLA Daily on Tuesday noted.\n“These trends should be watched with high caution,” it said.\nLaser weapons are an effective measure against the fast-developing drone warfare, with the advantages...",
        "source": "smcp",
        "date": "2025-09-24T00:51:18+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3326595/china-criticises-japans-laser-weapon-plans-threat-regional-stability?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "aa2ff2dfb60492cb258dbe12cc5cabccbb7579e56f2491708dcc05df3ecac14f",
        "title": "‘Wartime readiness’: Shenzhen scrambles as Typhoon Ragasa nears China’s tech hub",
        "summary": "As Super Typhoon Ragasa barrels down on southern China, the country’s tech and manufacturing hub has gone into emergency lockdown mode.\nWith the highest alert level declared, officials in Shenzhen – the southern manufacturing powerhouse with a reputation as China’s Silicon Valley – sounded the alarm for “wartime readiness”.\nResidents responded by scrambling to stockpile supplies, boarding up or taping windows, and bracing for what forecasters are saying could be one of the most ferocious storms...",
        "source": "smcp",
        "date": "2025-09-23T22:30:08+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3326584/wartime-readiness-shenzhen-scrambles-super-typhoon-ragasa-nears-chinas-tech-hub?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "88a7ad5a1144d5d7a171e0cd237be19294feaa8f52d4ae455add96bc24465cbc",
        "title": "Pakistan interested in Chinese laser weapons, former navy commander says",
        "summary": "Pakistan is eyeing Chinese laser weapons, according to a former senior commander.\n“In the coming days, high-energy directed weapons will be more prominent… I think the world is going towards this transition. Pakistan would love to see some integration [with China] into this area,” Ahmed Saeed, president of the National Institute of Maritime Affairs, said on the sidelines of Beijing’s Xiangshan Forum on Friday.\nChina’s LY-1 shipborne laser was among the weapons on display in this month’s parade...",
        "source": "smcp",
        "date": "2025-09-23T22:00:10+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3326563/pakistan-interested-chinese-laser-weapons-former-navy-commander-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0fccb7a86393a2939b7ff84b66e82c00e3ed8e5647a34da4207632ac9dde343c",
        "title": "Chinese tech workers miss mainland weddings, rethink plans amid H-1B fee chaos",
        "summary": "Chinese technology workers in the United States saw their travel plans disrupted and reassessed their future in the world’s biggest economy, after US President Donald Trump signed a proclamation requiring companies to pay US$100,000 per year for new H-1B applications.\nThe policy change, which initially appeared vague on who was responsible for paying the fee, prompted H-1B visa holders Selena Tang and her husband to skip their planned Chinese wedding on Tuesday in Wuxi, in eastern Jiangsu...",
        "source": "smcp",
        "date": "2025-09-23T21:41:28+09:00",
        "url": "https://www.scmp.com/tech/policy/article/3326586/chinese-tech-workers-miss-mainland-wedding-rethink-plans-amid-h-1b-visa-fee-chaos?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "053ac51970b12931600524e8fd8dda9977b7b96988db38ca58bf3568035544a2",
        "title": "Xi Jinping in Xinjiang first, US-China military warning: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Xi Jinping is first Chinese president to attend Xinjiang anniversary celebration\nChina’s President Xi Jinping has arrived in Urumqi to attend the 70th anniversary of the Xinjiang Uygur autonomous region, according to Xinhua, becoming the first Chinese president to attend a landmark anniversary of its founding.\n2. ‘Final straw’: Chinese workers in US explore...",
        "source": "smcp",
        "date": "2025-09-23T21:33:14+09:00",
        "url": "https://www.scmp.com/news/china/article/3326585/chinese-workers-us-face-h-1b-chaos-xi-jinping-historic-first-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e050510f3d4ca1d612179c7b0fe6aa4ca59e31dd766ce3447c7910d2ba816db5",
        "title": "Why US-China health and drugs cooperation must top Trump-Xi agenda",
        "summary": "Last month, I joined a US think tank delegation to China, participating in a round table at a top university in Beijing. A remark by a leading professor of diplomacy struck me: “If China and the US can’t cooperate on health issues, they can’t cooperate on others.” His words underscore the dire state of bilateral relations. Even during peak Cold War tensions, public health challenges such as polio and smallpox transcended geopolitical rivalries and forged unlikely alliances.\nYet between 2017 and...",
        "source": "smcp",
        "date": "2025-09-23T21:30:09+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3326268/why-us-china-health-and-drugs-cooperation-must-top-trump-xi-agenda?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a42625a1144820704783868aab7c84fce8f7d7e3e1b33734da3d986a34e6fb61",
        "title": "China flexes western Pacific muscle with Fujian launches: analysts",
        "summary": "The successful launch of fighter jets from China’s most advanced aircraft carrier signals the country’s enhanced military influence in the western Pacific, analysts have said.\nThe J-15T fighter jet, the fifth-generation J-35 stealth fighter and the airborne early warning aircraft KJ-600 successfully completed catapult launches and arresting gear landing tests aboard the Fujian, state broadcaster CCTV reported on Monday.\nThe Fujian is China’s first fully domestically designed aircraft carrier and...",
        "source": "smcp",
        "date": "2025-09-23T21:14:28+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3326581/fujian-aircraft-carrier-launches-show-china-gaining-ground-western-pacific-analysts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0f49e54178d6dfb3e6902655c8948f6c120c050f15cac5bf20fc4620f58e92a0",
        "title": "Super Typhoon Ragasa to delay the close of Zijin Gold’s IPO",
        "summary": "Super Typhoon Ragasa is expected to force Zijin Gold International, which launched Hong Kong’s second-biggest initial public offering (IPO) this year, to delay the book close offering for its retail investors from tomorrow, according to its listing prospectus.\nThe Hong Kong Observatory on Tuesday afternoon issued the No 8 warning signal, as the typhoon is expected to bring hurricane-force winds with speeds of up to 230km/h (143mph) and thunderstorms.\nThe weather forecaster said it would assess...",
        "source": "smcp",
        "date": "2025-09-23T20:01:19+09:00",
        "url": "https://www.scmp.com/business/companies/article/3326576/super-typhoon-ragasa-delay-close-zijin-golds-ipo?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "79ab5a3f3e9426dbee85535fd3157fa288f6da421dc1fc3c6e2c669a19da9b31",
        "title": "China has policy window for more private sector support, official says",
        "summary": "China’s top economic planner acknowledged on Tuesday there is still room to improve the country’s business environment, a sign Beijing may roll out stronger support for the private sector even after this year’s passage of a law ensuring equal legal treatment and other protections for non-state firms.\n“Despite notable progress in recent years, gaps remain in meeting the demands of the private sector and private enterprises’ expectations,” wrote Wu Xiaoyan, director general of the National...",
        "source": "smcp",
        "date": "2025-09-23T20:00:16+09:00",
        "url": "https://www.scmp.com/economy/policy/article/3326554/china-has-policy-window-more-private-sector-support-official-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "82f28039ca61546801942789ba09feaca6cc186afd0f0fa4eb6a89d2287a2cf3",
        "title": "Xi Jinping is first Chinese president to attend Xinjiang anniversary celebration",
        "summary": "China’s President Xi Jinping has arrived in Urumqi to mark the 70th anniversary of the Xinjiang Uygur autonomous region, according to state media reports, making him the first national leader to be present for such a landmark celebration.\nXi arrived in the regional capital on Tuesday afternoon, along with two members of the Politburo Standing Committee, the top Communist Party body, state news agency Xinhua reported.\nAccompanying Xi are Wang Huning, China’s fourth-ranking official and chairman...",
        "source": "smcp",
        "date": "2025-09-23T19:29:31+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3326573/xi-jinping-first-chinese-president-attend-xinjiang-regions-anniversary-celebration?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8ea1f7e74d90625683869938046c0c27f28f865c5c1a4fe17c495de0cb868528",
        "title": "US official declares F-47 sixth-gen fighter is in production for 2028 take-off",
        "summary": "The United States has started manufacturing its F-47 sixth-generation fighter jet and plans for it to be flying in 2028, a senior US Air Force official announced on Monday, three weeks after China showcased its new fighter jets during its Victory Day military parade.\nDuring his keynote address at the 2025 Air, Space and Cyber Conference, US Air Force Chief of Staff General David Allvin said Boeing had started production of the F-47.\nIn March, US President Donald Trump announced that Boeing would...",
        "source": "smcp",
        "date": "2025-09-23T19:03:08+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3326558/us-official-declares-f-47-sixth-gen-fighter-production-and-set-2028-take?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b2357d892860094045b15e1aff4036a0d0c8668406db85d837232612f3c420ef",
        "title": "Car trade in reverse as Germany’s deficit with China jumps 143 per cent",
        "summary": "Europe is buying Chinese hybrid vehicles by the shipload – imports are up more than 400 per cent this year – while Germany’s car exports to China have slumped, leaving gold as its biggest single shipment going the other way.\nThese are just two findings from new statistics that show how quickly the old trade model has shifted gears, while offering a stunning snapshot of the contrasting industrial fortunes of the European Union and China.\nGermany – the bloc’s biggest economy and its manufacturing...",
        "source": "smcp",
        "date": "2025-09-23T18:00:15+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326504/car-trade-reverse-germanys-trade-deficit-china-jumps-143-cent?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "37f7b4cbdec2e2749170d48e8387992763da7355a54dab3efe99100d5890ffcd",
        "title": "How will Trump revive US shipbuilding after years of protectionist rot?",
        "summary": "US hopes of getting China to place big orders of Boeing jets have risen anew after reports of progress, including a framework agreement on TikTok, at the fourth round of trade negotiations in the Spanish capital of Madrid.\nPraising the progress, US President Donald Trump said he would meet Chinese President Xi Jinping at the Asia-Pacific Economic Cooperation (Apec) summit in Seoul, which starts at the end of next month, and plans to visit China early next year.\nBut why would China wish to buy US...",
        "source": "smcp",
        "date": "2025-09-23T17:30:08+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3326257/how-will-trump-revive-us-shipbuilding-after-years-protectionist-rot?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8c103178cd136dd72d2956d83e488977a5f5bda126b689350e2818c9f3420c0d",
        "title": "Chinese scientist developing chips for weapon systems detained by graft-buster",
        "summary": "Top scientist Yu Faxin, who develops chips for weapon systems, has been detained by anti-corruption authorities in central China, his Shanghai-listed company Zhejiang Great Microwave Technology said.\nYu is also a Qiushi distinguished professor at Zhejiang University’s School of Aeronautics and Astronautics in Hangzhou.\nHe is an expert in microwave and millimetre-wave radio frequency technology and has overcome technical hurdles in the areas of communication, navigation and radar tech. Yu also...",
        "source": "smcp",
        "date": "2025-09-23T17:00:27+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3326524/top-chinese-scientist-developing-chips-weapon-systems-detained-graft-buster?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6b113544c4956c5d94bc5ade5ec9f71b6f1364b41fe73506fba8b714fe6033a5",
        "title": "China’s record-breaking new dam, built with the help of AI, starts storing water",
        "summary": "A record-breaking mega dam project in China’s far western Xinjiang region – built with the help of artificial intelligence and digital twin technologies – has begun storing water.\nThe Dashixia Water Control Project, located in the middle and lower reaches of the Kumarak River in Xinjiang’s Aksu prefecture, started to store water on Saturday.\nDesigned by the state-owned China Energy Engineering Corporation, it is the world’s tallest concrete-faced rockfill dam at a height of 247 metres (810 feet)...",
        "source": "smcp",
        "date": "2025-09-23T16:00:14+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3326501/chinas-record-breaking-dashixia-dam-built-help-ai-starts-storing-water?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5c428ac93d531e47d7f0ccf044cb582df53cd18add353b0fe14b2f528b9e335a",
        "title": "China’s Guangdong evacuates 371,000, suspends flights as Ragasa nears",
        "summary": "The global manufacturing centre of Guangdong in southern China has come to a halt as people brace for the most powerful typhoon to hit the region in recent years.\nOn Tuesday morning, the province upgraded its typhoon alert to Level 1, the highest in a four-tier warning system, as officials declared “combat-ready” status in preparation for Super Typhoon Ragasa.\nMore than 10 cities, including the technology hub Shenzhen, have announced the closure of all markets, schools, factories and transport...",
        "source": "smcp",
        "date": "2025-09-23T15:16:15+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3326491/super-typhoon-ragasa-food-hoarding-transport-suspended-guangdong-braces-worst?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "eb235ddfbe951c3f0b9b23efcf2304d2fa933f7699a2d541184547ae8b3c7888",
        "title": "Developer Seazen joins Chinese rush back to dollar bond market",
        "summary": "Issuers from mainland China, Hong Kong and Macau are storming back into the offshore dollar bond market this year, driving total issuance to its highest level since 2022.\nAmong them is Seazen Group, a struggling developer that tested the waters a few months ago with a US$300 million bond offering – the first such sale by a major private-sector Chinese developer since 2023.\nNow it is looking for another bond deal. Once ranked among the country’s 10 biggest builders by contracted sales, Seazen...",
        "source": "smcp",
        "date": "2025-09-23T15:06:44+09:00",
        "url": "https://www.scmp.com/business/banking-finance/article/3326494/developer-seazen-joins-chinese-rush-back-dollar-bond-market?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "209518349359b6b0db33f08f7f8456fe1033ac0403b0bda27f51ccb90b7a8d16",
        "title": "US lawmaker in China warns lack of communication between militaries is dangerous",
        "summary": "A lack of military-to-military communication between the United States and China “is dangerous” and could lead to miscalculation and “larger problems”, a US lawmaker from the House Armed Services Committee said after meeting Chinese officials, including Defence Minister Dong Jun.\nAdam Smith, the committee’s top Democrat and former chairman, said Beijing needed to understand that it must have greater engagement with other large militaries – including the US – given its fast-rising military...",
        "source": "smcp",
        "date": "2025-09-23T14:24:57+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326487/us-lawmaker-china-warns-lack-communication-between-big-militaries-dangerous?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "25c2689b8d73a4044091a86e81d2251413f2421804890000c3ffc35f9e8512ce",
        "title": "China urged to create own international relations knowledge system, reject West",
        "summary": "A government adviser has urged China to develop its own international relations knowledge system, rooted in its unique history, cultural traditions and geopolitical realities.\nThis system, distinct from Western frameworks, would more effectively explain China’s foreign policy and global role to the world, according to Zheng Yongnian, dean of the school of public policy at Chinese University of Hong Kong, Shenzhen.\nIn an interview published on Monday by People’s Daily, Zheng emphasised the...",
        "source": "smcp",
        "date": "2025-09-23T13:00:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326435/china-urged-create-unique-foreign-relations-knowledge-system-reject-western-concepts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e4840b80201bf7183f1451a7911178d0fbee9d3376e52c38da8c1300da38feee",
        "title": "China's 15th 5-year plan",
        "summary": "",
        "source": "smcp",
        "date": "2025-09-23T12:21:32+09:00",
        "url": "https://www.scmp.com/article/3326468/chinas-15th-5-year-plan?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "61b9858f7df09ba3f2769a9cf56ba38412b6b4ce21129e03d0f9eb60301b19f1",
        "title": "China’s rejection of Nvidia chips a turning point in global tech race",
        "summary": "When US tech giant Nvidia unveiled its B40-series chips for China – stripped-down versions of its more advanced H20 line – many in Washington and Silicon Valley believed they had struck a clever compromise. The United States would retain its technological lead while allowing China to buy “safe” alternatives that preserved its dependence on American suppliers. Nvidia, in turn, could continue to profit from one of its largest markets.\nThe logic was simple: Beijing would accept something rather...",
        "source": "smcp",
        "date": "2025-09-23T10:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3326186/why-china-said-no-stripped-down-nvidia-chips?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "59fe0f8bbd0e7b325fde5596300b5ad57031a7891638f81d881708e3b68ac009",
        "title": "How China’s next 5-year plan shapes economic strategy from command to hybrid",
        "summary": "As China drafts its 15th five-year plan – the next entry in a line of expansive blueprints that have set the tone for the country’s development over more than seven decades – we examine how these documents inform and reflect high-level policy priorities, what to expect in the coming iteration and why Beijing has continued this tradition after the seismic economic changes of the reform era.\nFor more stories in this ongoing series, click here.\n“Plans can’t keep up with changes,” the Chinese...",
        "source": "smcp",
        "date": "2025-09-23T07:00:08+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3326401/why-chinas-five-year-plan-matters-and-how-it-could-steer-economy-turbulent-times?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1ca5cefec30b0df4bcf2470ed6329a8dab479e6c0cda0a3ea9959a67ff36c924",
        "title": "Lula, TikTok CEO discuss US$10 billion Brazil data centre amid tensions",
        "summary": "Brazilian President Luiz Inacio Lula da Silva opened his week at the United Nations on Monday by meeting with TikTok chief executive Shou Zi Chew to discuss plans for a multibillion-dollar data centre investment in Brazil, even as political controversies persist over regulation of the Chinese-owned platform.\nThe meeting, held at Brazil’s mission to the UN, was Lula’s first working engagement in New York, highlighting the importance of technology and digital policy in his international...",
        "source": "smcp",
        "date": "2025-09-23T06:43:28+09:00",
        "url": "https://www.scmp.com/news/china/article/3326450/lula-meets-tiktok-chief-push-10-billion-brazil-data-centre-amid-regulatory-tensions?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "45549fbe4e18fa3d5a2eb49d79f3aa9476b138dc8e42fd054413a2b03be4e822",
        "title": "China could shore up Scarborough Shoal control with artificial island: analyst",
        "summary": "China could build an artificial island at the fiercely contested Scarborough Shoal to shore up control of the surrounding waters if its newly established nature reserve fails to stem challenges by the Philippines, a prominent Chinese scholar on the dispute has said.\nBut a final decision would boil down to control, cost and confrontation, according to Wu Shicun of the National Institute for South China Sea Studies, a government-sponsored think tank.\nA major consideration would be “whether it...",
        "source": "smcp",
        "date": "2025-09-23T00:00:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3326420/china-could-shore-scarborough-shoal-control-artificial-island-analyst?utm_source=rss_feed",
        "reportUrl": ""
    }
]