[
    {
        "id": "bce445dc6b58755c5ec18423407ff863638429a3594c6e8cc68e7b891081ea04",
        "title": "South Korea cautious that Xi’s visit will lead to end of cultural ‘ban’",
        "summary": "South Korea has moved to calm speculation that China will lift an unofficial ban on the country’s entertainment industry in the wake of President Xi Jinping’s visit to the country.\nLawmaker Kim Young-bae said Xi had responded positively to a proposed South Korean performance in Beijing, prompting a rise in entertainment companies’ share prices.\n“I hope that this will be the moment when the door opens to full-fledged K-culture advancement beyond the lifting of the THAAD ban,” Kim wrote on social...",
        "source": "smcp",
        "date": "2025-11-04T07:00:09+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3331356/south-korea-cautious-xi-jinpings-visit-will-lead-end-cultural-ban?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7e62def42258e99b7ecb88bc7f459121e35d262d6d2d44e3ead3b68753a04428",
        "title": "Following the Xi-Trump summit, is the G2 back on track?",
        "summary": "Chinese President Xi Jinping’s high-level meeting with US President Donald Trump in Busan, South Korea, sends a positive signal for China-US relations.\nBefore the meeting, Trump posted on social media: “THE G2 WILL BE CONVENING SHORTLY!” The concept of a Group of Two (G2) refers to China and the United States collaborating to address global challenges. This idea was proposed in the 2000s by economist Fred Bergsten and touted by former US national security adviser Zbigniew Brzezinski.\nOver the...",
        "source": "smcp",
        "date": "2025-11-04T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3331281/following-xi-trump-summit-g2-back-track?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ad41534037b46de35c189ba275d0c6e5c9630e4b64db1d4c5b05139773fbaa30",
        "title": "Tariffs in court: Trump cites China deal to defend key trade policy",
        "summary": "The nine justices of the US Supreme Court will soon rule on the validity of President Donald Trump’s tariffs, a showdown that could blunt what he claims is his favourite economic and diplomatic tool.\nOn Wednesday, they will hear oral arguments in a landmark case that could reshape presidential powers, American trade policy, global commerce worth billions of dollars and international relations for decades.\nThe dispute centres on two lawsuits filed by seven small businesses and 12 US states, led...",
        "source": "smcp",
        "date": "2025-11-04T05:01:39+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3331396/trump-tariffs-court-case-could-change-global-trade-we-know-it?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ab23a144065d219524d8d2fab3cf1a925454b662dddf3ccb90027835e43b2e34",
        "title": "US wants UN sanctions on 7 ships over North Korea exports to China",
        "summary": "The United States will in the coming days ask a UN Security Council committee to impose sanctions on seven ships suspected of violating UN sanctions on North Korea, a State Department official said on Monday.\nThe seven vessels have illegally exported North Korean coal and iron ore to China, which traditionally earns Pyongyang between US$200 million and US$400 million a year, said the US official, speaking on condition of anonymity.\n“These nominations are not just bureaucratic exercises. They’re...",
        "source": "smcp",
        "date": "2025-11-04T04:48:12+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3331395/us-calls-un-sanctions-7-vessels-over-north-korea-exports?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8113d17073e630d1664f51a41ec8838f10e33401852be4d14103befae49e5ca9",
        "title": "China praises Brazil’s forest fund but holds back on cash",
        "summary": "Despite repeated pledges of support, China has yet to commit a specific financial contribution to the tropical forest-protection investment fund that Brazilian President Luiz Inacio Lula da Silva is banking on, as COP30 opens this week in Belem, northern Brazil.\nThe Tropical Forests Forever Facility (TFFF) is a Brazil-led multilateral mechanism designed to reward tropical nations for keeping forests standing rather than clearing them.\nOperating as a permanent endowment, it will blend sovereign...",
        "source": "smcp",
        "date": "2025-11-04T04:34:31+09:00",
        "url": "https://www.scmp.com/news/china/article/3331394/china-praises-brazils-forest-fund-holds-back-cash?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "8a7e4ed3cc32a5b3d5b4de1698defe9d570cfeddfb85c2f18d6acfe129f9b5e4",
        "title": "‘No structure to say yes’: can Chinese investment still find a home in America?",
        "summary": "Long-simmering debates in Washington about the benefits of increased investment from China were revived in recent weeks after Beijing reportedly pushed US President Donald Trump’s administration to roll back national security restrictions on Chinese deals in the US.\nBut despite signs of high-level political warming to the idea, analysts say the path forward for Chinese firms remains steep given federal and state restrictions and the realities of congressional and local politics.\nChina’s security...",
        "source": "smcp",
        "date": "2025-11-04T02:00:09+09:00",
        "url": "https://www.scmp.com/news/china/article/3331336/can-chinese-investment-still-find-home-america?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d1c6769afa86567684a6364e20aaa44f5e4732621924e5e0c7eb1e644534e02d",
        "title": "EU thinks it’s been left out as China eases historic rare earth curbs",
        "summary": "The European Union does not believe its industries are covered by a “de facto removal” of China’s historical restrictions on the export of rare earths and other critical minerals announced by the White House on Saturday.\nIn a fact sheet detailing the outcomes of US President Donald Trump’s summit with Chinese President Xi Jinping last Thursday, the White House said that China “will issue general licenses valid for exports of rare earths, gallium, germanium, antimony, and graphite for the benefit...",
        "source": "smcp",
        "date": "2025-11-04T01:55:51+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3331390/eu-believes-its-been-left-out-china-easing-historic-rare-earth-curbs?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "91edd1e89dbc680e9e6f8211fa10d39a4467c77d1c952d0f42bf0d12c94e0107",
        "title": "China reaches energy independence milestone by ‘breeding’ uranium from thorium",
        "summary": "An experimental reactor developed in the Gobi Desert by the Chinese Academy of Sciences’ Shanghai Institute of Applied Physics has achieved thorium-to-uranium fuel conversion, paving the way for an almost endless supply of nuclear energy.\nThe achievement makes the 2 megawatt liquid-fuelled thorium-based molten salt reactor (TMSR) the only operating example of the technology in the world to have successfully loaded and used thorium fuel.\nAccording to the academy, the experiment has provided...",
        "source": "smcp",
        "date": "2025-11-03T23:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3331312/china-reaches-energy-independence-milestone-breeding-uranium-thorium?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "97041ecb55dc8ade4a0251b924470fde157fa03d9ab5ac7ede4a8cf4f6e82f32",
        "title": "China’s ‘smart healthcare’ firms draw crowds as Canton Fair wraps up",
        "summary": "As the semi-annual Canton Fair – China’s largest and oldest trade exhibition – draws to a close, a new exhibition area dedicated to digitally and technologically powered approaches to healthcare has drawn keen interest from overseas buyers.\nThe “Intelligent Healthcare” zone, featuring 47 leading domestic manufacturers, is a showcase for medical robots and artificial intelligence (AI)-enabled imaging diagnostics, wearable devices and other applications – and a sign of China’s ambitions to rapidly...",
        "source": "smcp",
        "date": "2025-11-03T22:30:09+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3331361/chinas-smart-healthcare-firms-draw-crowds-canton-fair-wraps?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bfad911e7d42493f358c2ec8abf4dea64943f5937aaf39b0549ada32b19f9324",
        "title": "‘Historic moment’ in US-China ties; scientist deaths: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. Xi-Trump meeting ‘a historic moment’ that will help avoid missteps: Wang Yi\nChina’s top diplomat has called the summit between Chinese President Xi Jinping and US President Donald Trump “a historic moment” that would help reduce misunderstanding and prevent major fluctuations in their countries’ bilateral ties.\n2. Trump says he has assurances from Beijing...",
        "source": "smcp",
        "date": "2025-11-03T22:15:07+09:00",
        "url": "https://www.scmp.com/news/china/article/3331357/xi-trump-meet-historic-moment-top-belgian-neurologist-china-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cb9068c4f65c344bf9f346d47d5cc6c865d9b105a9aaf3bc95f91839df90d835",
        "title": "Nexperia China to meet chip orders with local wafer suppliers in months: experts",
        "summary": "Nexperia’s China unit is expected to be capable of making deliveries to clients on the back of the domestic semiconductor supply chain – even though locking in that support could take at least six months, experts said – as the European fabrication facilities under the Dutch chipmaker’s head office continue to suspend the supply of wafers.\nA number of Chinese fabs – including Wuxi NCE Power, Hangzhou Silan Microelectronics and Yangjie Technology – would be able to supply wafers to Dongguan-based...",
        "source": "smcp",
        "date": "2025-11-03T22:03:19+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3331375/how-nexperias-china-unit-can-meet-chip-orders-amid-european-fabs-suspended-wafer-supply?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "08a3823e9103b6c96f3de87a822b0833664863374250f6df62445a5a5756e636",
        "title": "China gives green light to group tours to Canada after Xi-Carney summit",
        "summary": "Beijing has officially resumed group tours to Canada, just days after the first meeting between their top leaders in eight years, signalling a further thaw in bilateral ties after years of tensions.\nChinese foreign ministry spokeswoman Mao Ning made the announcement on Monday, ending a prolonged Covid-19-era freeze that left Canada off China’s outbound tour lists, even as group travel resumed to more than 130 other destinations.\nMao said the decision was taken after “comprehensive” consideration...",
        "source": "smcp",
        "date": "2025-11-03T21:00:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3331364/china-gives-green-light-group-travel-canada-after-xi-carney-summit?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "bd13bc29bdb955ee71fc9df93538d103545fdb0edbea8c01abb75882b97ef2e2",
        "title": "China’s industrial robot production overtakes 2024 levels amid automation drive",
        "summary": "As a robot torch-bearer took the spotlight during the kick-off of the 15th National Games torch relay in Shenzhen on Sunday, China’s rapid advancements in both industrial and emerging humanoid robots were hailed as a pivotal force in the industrial economy.\nThe humanoid robot Kuavo, developed by Shenzhen-based Leju Robotics, completed a 100-metre (328-foot) leg of the relay, gripping a 1.6kg (3.5-pound) torch as it passed the baton between runners, state broadcaster CCTV reported on Sunday.\nAnd...",
        "source": "smcp",
        "date": "2025-11-03T20:30:07+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3331343/chinas-industrial-robot-production-overtakes-2024-levels-amid-automation-drive?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7d59f946aa76f200a1dd7ac31b129e845cee4476cc70c608f2c4e5faa075cfa9",
        "title": "Xiaomi’s credentials get a boost as Beijing picks smartphones as state gift",
        "summary": "Smartphone giant Xiaomi briefly took the spotlight during Saturday’s meeting between President Xi Jinping and his South Korean counterpart, Lee Jae-myung, as a pair of the company’s handsets were presented as gifts by China’s head of state.\nThe selection of its flagship consumer product as a state gift reflected Xiaomi’s growing status as a symbol of China’s technological ambitions, according to analysts, more than 15 years since the company was founded.\nThe pair of Xiaomi handsets were...",
        "source": "smcp",
        "date": "2025-11-03T20:00:10+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3331342/xiaomis-credentials-get-boost-beijing-picks-smartphones-state-gift?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "712c31c7f6457fb884c51da2342eafccdca02085b1f05eb087abd198b79abdf1",
        "title": "Xi-Trump meeting ‘a historic moment’ that will help avoid missteps: Wang Yi",
        "summary": "China’s top diplomat has called the summit between Chinese President Xi Jinping and US President Donald Trump “a historic moment” that will help reduce misunderstanding and prevent major fluctuations in their countries’ ties.\nAccording to a Chinese foreign ministry statement on Sunday, Foreign Minister Wang Yi also noted that Shenzhen in southern China was getting ready to host next year’s Apec summit, a key diplomatic event for Beijing, noting that the tech hub would “present a spectacular...",
        "source": "smcp",
        "date": "2025-11-03T19:04:46+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3331345/xi-trump-meeting-historic-moment-will-help-avoid-missteps-chinas-top-envoy-says?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "064a23102a4baf1ce9aa074e7bd527d5f71627c8014ffc9f7690a4f873c976c9",
        "title": "China’s former central bank chief loses leadership role in top advisory body",
        "summary": "China’s former central bank chief, Yi Gang, and nine other senior officials were removed from leadership roles in the country’s top political advisory body on the weekend, indicating they had been further sidelined.\nThe decision affecting the 10 was made at a meeting of the Standing Committee of the 14th National Committee of the Chinese People’s Political Consultative Conference (CPPCC) in Beijing that ended on Saturday, according to state news agency Xinhua.\n“Following a vote, it was decided...",
        "source": "smcp",
        "date": "2025-11-03T18:59:37+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3331341/chinas-former-central-bank-chief-loses-leadership-role-top-advisory-body?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "5eff23ddcc2d00f52532ed8f131de858af16f3173aa31fec5da3850230e68716",
        "title": "Communist Party discipline key to meeting China’s 5-year plan goals: Cai Qi",
        "summary": "China’s Communist Party needs to enforce strict discipline to deal with external pressure and manage tough domestic development issues over the next five years, the president’s chief of staff has said.\nIn an opinion piece in state-run People’s Daily on Monday, Cai Qi wrote of the “extreme importance of exercising full and rigorous party self-governance to achieve the economic and social development goals of the 15th five-year plan period”.\nCai, the fifth-ranking member of the Politburo Standing...",
        "source": "smcp",
        "date": "2025-11-03T17:22:39+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3331319/communist-party-discipline-key-meeting-chinas-5-year-plan-goals-cai-qi?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c26b2b1e271d4cf97dd7786b2c3e649b27f4693bc7da1e1d3cbbe343b060a0b1",
        "title": "China calls for faster, wider adoption of advanced tech to strengthen industry",
        "summary": "China’s State Council has called for the faster development and wider rollout of large-scale testing and application environments for new technologies, as Beijing pushes to boost commercialisation and build a world-leading industrial base.\nThe country should “focus on the frontiers of industrial development and key technological challenges, and prioritise the layout of new application scenarios in emerging fields and tracks, high-value niche areas and cross-regional and cross-sector domains,”...",
        "source": "smcp",
        "date": "2025-11-03T17:14:03+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3331318/china-calls-faster-broader-adoption-advanced-tech-cement-industrial-power?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ed4c3ea7b5ed899278a871ac96817ac4197b22d389c32e3be3ca050cc16bf700",
        "title": "Premier Li Qiang to highlight US-China pact at world’s largest trade fair CIIE",
        "summary": "Premier Li Qiang is expected to promote free trade, encourage foreign investment, soothe concerns about the country’s slowing economy and highlight a trade deal with the US in a keynote speech as the eighth China International Import Expo (CIIE) opens on Wednesday.\nLi will for the third consecutive year address hundreds of government officials, business leaders and merchants from about 150 countries and regions to open the world’s largest import trade fair in Shanghai, Xinhua news agency...",
        "source": "smcp",
        "date": "2025-11-03T17:00:09+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3331301/premier-li-qiang-highlight-us-china-pact-worlds-largest-trade-fair-ciie?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d876e51011a28b6c34d1337f80032a5496230b280125b9acd25b57c48e27b135",
        "title": "Top Belgian neurologist Steven Laureys joins China’s Hangzhou Normal University",
        "summary": "World-renowned neurologist and consciousness research pioneer Steven Laureys has taken up a full-time university position in eastern China’s Zhejiang province.\nThe 56-year-old Belgian scientist joined Hangzhou Normal University earlier this year as a professor at its school of basic medical sciences, according to a university statement.\nBefore moving to China, Laureys spent decades in Europe and had a brief stint in North America. He is widely recognised as one of the first researchers to use...",
        "source": "smcp",
        "date": "2025-11-03T15:00:17+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3330992/belgiums-top-neurologist-steven-laureys-joins-chinas-hangzhou-normal-university?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "dec895dc54d7dc275c311e4f808a17fd2a44164f5cc92c94ac8e03ede0576f71",
        "title": "Trump says he has assurances from Beijing of no attack on Taiwan during his term",
        "summary": "US President Donald Trump has said his Chinese counterpart Xi Jinping gave him assurances that Beijing would take no action on Taiwan, as long as the Republican leader was in power.\nIn an extract from a CBS News interview first released on Sunday, Trump said the island, which Beijing regards as part of its territory, to be reunited by force if necessary, “never even came up as a subject” when the two leaders met last week.\n\n\nMost countries, including the United States, do not recognise Taiwan as...",
        "source": "smcp",
        "date": "2025-11-03T13:28:25+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3331279/trump-says-he-has-assurances-beijing-no-attack-taiwan-during-his-term?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "669ebf9c65a1356755f0dec7203a7d14e63ec4f746baa6bb19a83560d043058d",
        "title": "Database of younger scientists’ deaths triggers heated debate in China",
        "summary": "A database tracking the deaths of young Chinese scientists has triggered a heated debate amid growing concern about whether there is a disturbing pattern emerging among the academic community.\nBut the list also triggered a public backlash, with critics raising ethical concerns about the way the information was used and questioning whether it was giving the full picture.\nAccording to the file posted on CSND, an online platform for computer programmers, last week, at least 76 researchers under the...",
        "source": "smcp",
        "date": "2025-11-03T13:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3331244/database-younger-scientists-deaths-triggers-heated-debate-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9de428e2b465f005e5784368a1e82fa0c072b6679e3aa90175947599dcddec20",
        "title": "‘Affordable dignity’: Chinese develop taste for Japan’s budget restaurant chains",
        "summary": "Students, white-collar workers and families filled the tables during a recent dinner rush at a branch of Saizeriya – a Japanese-owned chain of Italian restaurants – in the southern Chinese city of Guangzhou.\nIn the same shopping district, a queue stretched outside a Sushiro conveyor belt sushi restaurant at 8pm. “We waited two hours for a seat, but it was worth it,” said one diner.\nSuch scenes present a contrast to China’s generally sluggish catering market, with analysts saying that budget...",
        "source": "smcp",
        "date": "2025-11-03T11:00:17+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3331087/japans-budget-restaurants-survivors-lost-decades-find-fans-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6c39b22791dc44151e6c7bd30752eaaa3649460b3ab441e7387b6db88c31279f",
        "title": "Michael Sandel on Donald Trump’s rise, meritocracy and the US-China rivalry",
        "summary": "Michael Sandel is a political philosopher and the Anne T. and Robert M. Bass Professor of Government at Harvard University. His course on justice was the first at Harvard to be made freely available online and has been viewed by tens of millions of people. Sandel recently received the 2025 Berggruen Prize for Philosophy and Culture, which some have described as the Nobel Prize for philosophy. In this interview, Sandel discusses the roots of Donald Trump’s rise to power, the crisis in American...",
        "source": "smcp",
        "date": "2025-11-03T07:00:19+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3331224/michael-sandel-donald-trumps-rise-meritocracy-and-us-china-rivalry?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "fd71370a6d29754a00f5d5261f58eb36a9f645cbdcbe115115c3874436f335ff",
        "title": "Hong Kong must do more to empower women in the workforce",
        "summary": "More than 200 C-suite women senior executives, including global chief executives and chief financial officers, are gathering in the epicentre of Hong Kong’s financial district for the city’s first ever Women Chief Executives summit today. The conference is symbolic as much as it is significant. Women in this city have progressed by leaps and bounds over the past decade.\nA recent report by one of the summit’s organisers, the Women Chief Executive Network, as well as KPMG and the Women’s...",
        "source": "smcp",
        "date": "2025-11-03T06:30:08+09:00",
        "url": "https://www.scmp.com/opinion/hong-kong-opinion/article/3331112/hong-kong-must-do-more-empower-women-workforce?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d3e5f31ca88fa699bed5c18814ded5eb9414c68a6e0dcc1be1788ee1209f7a20",
        "title": "Trump says Xi understands ‘consequences’ if Beijing takes Taiwan",
        "summary": "US President Donald Trump said Xi Jinping understands the consequences if Beijing takes Taiwan, while refusing to specifically say the United States would defend the island, according to an extract of a CBS News interview broadcast on Sunday.\nTrump said Taiwan “never even came up as a subject” when he met the Chinese president in South Korea on Thursday for their first face-to-face meeting in six years.\nAsked on CBS’ 60 Minutes whether he would order US forces into action if Beijing moved...",
        "source": "smcp",
        "date": "2025-11-03T02:06:23+09:00",
        "url": "https://www.scmp.com/news/us/diplomacy/article/3331252/trump-says-xi-understands-consequences-if-china-invades-taiwan?utm_source=rss_feed",
        "reportUrl": ""
    }
]