[
    {
        "id": "2102eba602bf1f000f1a7d999f558718ce2c57dbfb98efc577b1fe6df6955732",
        "title": "China’s youth unemployment hits 11-month high as graduates join job hunt",
        "summary": "China’s youth unemployment rate rose to its highest level in 11 months in July, as a record number of graduates enter an already shaky labour market.\nThe urban jobless rate for the 16-24 age group, excluding students, rose to 17.8 per cent last month from 14.5 per cent in June, putting an end to four straight months of decline and marking the metric’s highest level since last August, according to data released by the National Bureau of Statistics on Tuesday.\nThe figures come as a record 12.2...",
        "source": "smcp",
        "date": "2025-08-19T16:06:16+09:00",
        "url": "https://www.scmp.com/economy/economic-indicators/article/3322347/chinas-youth-unemployment-hits-11-month-high-army-graduates-joins-job-hunt?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "489ff25b9f5af6df300873ee5bf1efef2689fe56eb3cc901d03b2c992e0e1ff1",
        "title": "China unveils crewed tilt-rotor aircraft but how does it compare with US Osprey?",
        "summary": "A Chinese version of the US military’s Osprey tilt-rotor aircraft has been captured conducting what appears to be its maiden flight in a photograph that began circulating on social media in China on Monday.\nThe picture shows a white prototype tilt-rotor aircraft hovering in front of a residential building with its rotors positioned vertically, indicating that it was in helicopter mode.\n\nThe cockpit design suggests it is crewed, although it is unclear from the photo whether there is a pilot on...",
        "source": "smcp",
        "date": "2025-08-19T15:00:15+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3322304/china-unveils-crewed-tilt-rotor-aircraft-how-does-it-compare-us-osprey?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c0ae36d5238a73d7fb466246c4c68113d48b92e2815290c2ff472218a99f36ad",
        "title": "Why are honeybees dying en masse in the United States but thriving in China?",
        "summary": "While the US suffered its largest recorded collapse in its commercial honeybee colonies, China’s bee population has reached a historic high, maintaining the country’s long-standing position as the world’s largest producer of apiary goods.\nAround 62 per cent of managed colonies perished in a devastating wave of losses that swept across the US from June 2024 to January this year, to the alarm of the agricultural sector which relies on bee pollination for about one-third of its crops.\nScientists...",
        "source": "smcp",
        "date": "2025-08-19T13:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322217/why-are-honeybees-dying-massively-united-states-thriving-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "89423b1a5db6345dc99451b44a09d2a7d5949e3fb8f006eb01b8d1721d2a2f09",
        "title": "China’s exports, investments to Global South surge in ‘age of tariffs’: report",
        "summary": "China is accelerating its pivot to the Global South to reduce reliance on the United States, potentially creating “a new order of global commerce”, according to a new report.\nChinese exports to the Global South – covering most of the developing world – have doubled since 2015, with growth seeing a notable uptick after the US-China trade war during US President Donald Trump’s first term, S&amp;P analysts said on Tuesday.\nIn the past five years, these exports have risen by 65 per cent – tripling the...",
        "source": "smcp",
        "date": "2025-08-19T11:00:13+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3322225/chinas-exports-investments-global-south-surge-age-tariffs-report?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "b1e2bae4189c48e59e9c6ee2194178deeb70ef5fdef7c327391194000cdfb69f",
        "title": "Hong Kong can’t afford to outsource its healthcare to mainland China",
        "summary": "In recent years, Hongkongers have developed a new habit: going north for their medical check-ups. A 2024 survey found nearly one in three residents had sought medical care in mainland China. The reasons are as predictable as they are troubling: shorter queues, cheaper drugs and upfront prices.\nIf this trend sounds like a temporary release valve for a stressed system, think again. What we’re seeing isn’t a convenient side option; it’s an unofficial outsourcing of healthcare. Left unchecked, it...",
        "source": "smcp",
        "date": "2025-08-19T10:30:09+09:00",
        "url": "https://www.scmp.com/opinion/hong-kong-opinion/article/3322178/hong-kong-cant-afford-outsource-its-healthcare-mainland-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cc7542beeb3bb7309ff78c081934c7b83f67729a51203d3791baf61200fa55f9",
        "title": "China’s Type 99A main battle tank sets benchmark for capability, survivability",
        "summary": "China is preparing for a military parade next month to celebrate the 80th anniversary of Japan’s defeat in World War II, with the People’s Liberation Army expected to showcase its latest line-up of land-based weapons systems.\nOne of the systems playing a crucial role in Chinese ground forces is the Type 99A main battle tank (MBT), which incorporates multiple advanced technologies to enhance survivability and firing capability.\nWhile China continues to focus on modernising its navy and air force,...",
        "source": "smcp",
        "date": "2025-08-19T10:00:08+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3320318/type-99a-chinas-most-advanced-tank-delivers-firepower-agility-and-survivability?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "022c2eec174fc4e15a4c068e8c893b845a890557b407024433bdb4c8be749567",
        "title": "Putin taps Brazil in China-linked peace push as Trump hosts Zelensky",
        "summary": "As US President Donald Trump prepared for the arrival of his Ukrainian counterpart Volodymyr Zelensky, Russia’s Vladimir Putin turned to another partner to discuss a possible path out of the war: Brazil.\nThe South American country’s President Luiz Inácio Lula da Silva spoke by phone with Putin on Monday, the Planalto Palace said, as Moscow pressed its case for new diplomatic efforts over the conflict.\nAccording to the official readout, Putin used the 40-minute call to brief Lula on his meeting...",
        "source": "smcp",
        "date": "2025-08-19T09:44:21+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322294/putin-taps-brazil-china-linked-peace-push-trump-hosts-zelensky?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d32d119083bd16aaf31dbda1076786a5541e57fe6715dea412fd064236a725aa",
        "title": "Alibaba’s Qwen 3 AI coding model gains on Claude Sonnet 4 in popularity",
        "summary": "Alibaba Group Holding’s artificial intelligence coding model Qwen 3 Coder has been gaining popularity globally amid intensified competition in the AI-assisted coding sector, according to data from a third-party agency.\nThe model’s usage share on AI marketplace OpenRouter soared to more than 20 per cent as of mid-August, trailing only Amazon.com-backed Anthropic’s Claude Sonnet 4 with 31 per cent of usage.\nAlibaba’s Qwen team released the Qwen 3 Coder on July 23, claiming it delivers top-tier AI...",
        "source": "smcp",
        "date": "2025-08-19T09:00:20+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3322264/alibabas-ai-coding-model-qwen-3-coder-soars-popularity-challenging-claude-sonnet-4?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "eb2a1c3156a0c29b568c4600e852912042ba9e553673e744b77ee7bc864664b2",
        "title": "China’s coastal provinces look to ride economic wave with offshore action plans",
        "summary": "China’s coastal provinces are leveraging their geographic advantages to align with the national strategy surrounding the marine economy, with plans to foster new growth in digitalised governance, offshore energy and tourism.\nSince China incorporated the marine economy into its 2035 vision, 10 provincial-level regions, including Shanghai, have rolled out marine-focused economic development plans since last year, according to a summary by Founder Securities.\nSoutheast China’s Fujian province will...",
        "source": "smcp",
        "date": "2025-08-19T09:00:09+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3322246/chinas-coastal-provinces-look-ride-economic-wave-offshore-action-plans?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "21a0035b9972d67986d963e737a716ee0ac2ba3db185602eb73f3cd93f39e567",
        "title": "China’s involution problem is not just about supply but also demand",
        "summary": "In economic policy documents, Beijing’s leadership used the term “involution”, neijuan in Chinese, in efforts to combat excessive competition in market segments such as photovoltaics and lithium batteries.\nThe authorities, who criticised the domestic dumping of products, have directed local governments to behave and stop offering unreasonable incentives that would lure enterprises into highly competitive segments.\nThe potential worst-case scenario for continued involution would be to drive many...",
        "source": "smcp",
        "date": "2025-08-19T08:00:07+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3322265/chinas-involution-problem-not-just-about-supply-also-demand?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "a9f1d6718acf51a25c3133b718d155da31d7e9f8f5f656a320aaf9e0bec1dc8a",
        "title": "HKU virologist says next pandemic inevitable and world may not be ready",
        "summary": "In the fourth instalment of a series to mark the 10th anniversary of the Future Science Prize, Victoria Bela and Holly Chik look at Professor Malik Peiris’s contributions to public health and virology, which earned him the 2021 award in life science. Click here for parts one, two and three.\nThe next pandemic is inevitable, yet the world may not be any better prepared than it was before Covid-19, a top virologist has warned, and to prevent it, a more resilient world integrating human, animal and...",
        "source": "smcp",
        "date": "2025-08-19T07:00:22+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322249/next-pandemic-inevitable-top-hong-kong-virologist-says-and-world-may-not-be-ready?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "92a36b7a1f3d0e1cc8ffbec521c2cc9ba78fae869b4efec2ff6f5aec804a731a",
        "title": "How Beijing’s proposed new embassy in London could benefit Britain",
        "summary": "In a world increasingly defined by digital diplomacy and virtual communication, the persistent struggle over bricks and mortar might seem like an old-fashioned skirmish.\nHowever, the ongoing saga of China’s proposed new embassy in London, England, proves that physical buildings remain potent symbols of power, prestige and national ambition. The dispute over the diplomatic compound is more than just a planning row; it is a microcosm of the complex, often fraught relationship between the UK and...",
        "source": "smcp",
        "date": "2025-08-19T06:30:07+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3322136/how-beijings-proposed-new-embassy-london-could-benefit-britain?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "d7e67ff146683fee5757bbf30a6a9c2eb56eec71bf376b932dd022c394e62775",
        "title": "Trump was put up for Nobel Peace Prize, so he must be a top mediator. Right?",
        "summary": "US President Donald Trump’s methods for mediating international conflicts may backfire and lead to more confrontation, experts in China have warned.\nTrump’s mediation tactics revealed a power politics approach and constituted ill-advised interference in the long term, Zhang Luwei, a research associate at the China Institutes of Contemporary International Relations, said in an article published on the institute’s social media account last week.\nShe said Trump was known for taking a high profile...",
        "source": "smcp",
        "date": "2025-08-18T23:00:08+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322166/trump-being-put-forward-nobel-peace-prize-so-he-must-be-top-mediator-right?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7e69240e173feb2595ad31214884a31ce14e1c465bae591e03de135bacf98057",
        "title": "Chinese spacesuit reaches 20 spacewalks, extending in-orbit lifespan",
        "summary": "Chinese spacesuit reaches 20 spacewalks, extending in-orbit lifespan",
        "source": "cgtn",
        "date": "2025-08-18T22:59:23+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Chinese-spacesuit-reaches-20-spacewalks-extending-in-orbit-lifespan-1FWyUx3xGuc/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "98535dc7dfe6de8987d1b43e5d97b45ce9a7359a76ae5b01f597869abca117da",
        "title": "China’s latest weapons on show, US human rights slammed: SCMP daily highlights",
        "summary": "Catch up on some of SCMP’s biggest China stories of the day. If you would like to see more of our reporting, please consider subscribing.\n1. EU envoys mull skipping China military parade over Putin’s attendance: sources\nEuropean envoys in Beijing are discussing plans to skip China’s massive military parade next month after considering the attendance of Russian President Vladimir Putin and the possible participation of Russian troops, the Post has learned.\n2. What new weapons were on show in...",
        "source": "smcp",
        "date": "2025-08-18T22:15:07+09:00",
        "url": "https://www.scmp.com/news/china/article/3322263/chinas-latest-weapons-show-beijing-slams-us-human-rights-scmp-daily-highlights?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2c8f07076fc4b196204d633a1c272a68332104eb0846600fcbeba18d44ec0ef2",
        "title": "Mainland China IDs may mean loss of job, Taiwanese status, Taipei warns public",
        "summary": "Taiwan on Monday warned government employees and the wider public against obtaining mainland Chinese identification documents, stating that violators could lose Taiwanese citizenship and be disqualified from civil or military service.\nThe announcement is part of a wider effort by the William Lai Ching-te administration to counter what it describes as “mounting influence operations” from Beijing, which it says pose an increasing threat to Taiwan’s security.\nThe warning came as Taiwan’s Ministry...",
        "source": "smcp",
        "date": "2025-08-18T22:14:47+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3322270/taiwanese-mainland-china-ids-risk-losing-jobs-citizenship-taipei-warns?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "061aa57ac8c528847d549bc127b389b5264c68029641048190d27e70e17eeeed",
        "title": "Alibaba, Baidu lead China’s fast-growing market for AI cloud services",
        "summary": "Baidu and Alibaba Group Holding led the market for public cloud services supporting artificial intelligence in China last year, as the industry embraced “disruptive innovations” towards generative and agentic AI, according to consultancy IDC.\nThe mainland AI public cloud market reached 19.6 billion yuan (US$2.7 billion) in 2024, increasing 55 per cent on the back of surging demand for AI training and applications, IDC said on Monday.\nThe top two market players each accounted for roughly 25 per...",
        "source": "smcp",
        "date": "2025-08-18T22:00:14+09:00",
        "url": "https://www.scmp.com/tech/article/3322250/alibaba-baidu-lead-chinas-ai-cloud-boom-market-surges-55-us27-billion?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "51187a4ec65e193626c23dbdaee03883a4aef6858d6d16412dad27d0436542fe",
        "title": "Can China forge an offshore economic empire? EV producers are feeling the way",
        "summary": "The electric vehicle (EV) industry, formerly one of China’s most inward-focused industrial sectors, is now leading a push overseas, carrying the government’s hopes of forging an offshore economic empire to sidestep cutthroat competition at home.\nLast year, for the first time, Chinese EV companies invested more overseas than they did at home, despite higher costs, delays and risks abroad, according to a report published by Rhodium Group on Monday.\nThat marked a historic shift after years of...",
        "source": "smcp",
        "date": "2025-08-18T22:00:08+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3322247/how-ev-industry-driving-chinas-going-global-strategy?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "9c92dc8ef74f3e3af312ac7e128eb86290e15f6c538b44459f3d28ac4a7cd808",
        "title": "US negotiators face tough task to secure trade deal with China",
        "summary": "With the tariff truce extended to November 10, US and Chinese negotiators can now focus on shaping a trade deal in the lead-up to a possible summit between US President Donald Trump and Chinese President Xi Jinping this autumn. While engagement has occurred at senior levels since the first meeting in Geneva, Switzerland, several months ago, it appears that much of the discussion since then has centred around ensuring the smooth flow of Chinese critical minerals and magnets to the United...",
        "source": "smcp",
        "date": "2025-08-18T21:30:07+09:00",
        "url": "https://www.scmp.com/opinion/world-opinion/article/3322129/us-negotiators-face-tough-task-secure-trade-deal-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "57ddc501653d22395c2179d9e93c2e3e56b532f12516ddb91db3df34f27e3b34",
        "title": "China to face greater pressure if US gives Ukraine Nato-style security: analysts",
        "summary": "China is likely to face “increasing” geopolitical pressure if the US extends Nato-style security protection to Ukraine to end its war with Russia following the Trump-Putin summit, Chinese analysts have warned.\nRussian President Vladimir Putin agreed at the meeting in Alaska to allow the United States and Europe to “effectively offer Article 5-like” security guarantees to Kyiv as part of a potential peace deal, US President Donald Trump’s special envoy Steve Witkoff, who attended the high-stakes...",
        "source": "smcp",
        "date": "2025-08-18T21:00:07+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322254/china-face-increasing-pressure-if-us-gives-ukraine-nato-style-protection-analysts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "97932d8bab5141a91acb5d82d4ef21db189dc12ad65992c5fb0900e90f7c0817",
        "title": "China urges relevant nations to stop interfering in Hong Kong affairs",
        "summary": "China urges relevant nations to stop interfering in Hong Kong affairs",
        "source": "cgtn",
        "date": "2025-08-18T20:49:10+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/China-urges-relevant-nations-to-stop-interfering-in-Hong-Kong-affairs-1FWmhpRomSA/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d5e4b34869c9180d2f687cf35dea30698b187bafca73f44699706c03a8bfead4",
        "title": "Chinese surgeons save patient who was nearly beheaded by robotic arm",
        "summary": "Chinese doctors have saved a patient whose head was nearly severed by a robotic arm.\nDoctors said the patient’s cervical vertebrae had been severed and crucial neurovascular structures had been damaged, but the spinal cord remained intact despite sustaining serious contusions.\n“We have looked through much literature at home and abroad, but have never come across a case of such severe cervical vertebra separation, let alone one that survived after treatment,” Chen Huajiang, director of the...",
        "source": "smcp",
        "date": "2025-08-18T20:39:05+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322257/chinese-surgeons-save-patient-who-was-nearly-beheaded-robotic-arm?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "97f3b86483fbe0d4eac28e24b9d4c7104b8cb66e851182d165026e757a9d1dbc",
        "title": "BizFocus Ep.132: China's humanoid robotics market reshaping workforce",
        "summary": "BizFocus Ep.132: China's humanoid robotics market reshaping workforce",
        "source": "cgtn",
        "date": "2025-08-18T20:32:25+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/BizFocus-Ep-132-China-s-humanoid-robotics-market-reshaping-workforce-1FWpiv81GFi/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "fac588f645b378981a4aa218b0898a0b61be60861f666a34104429ecc01ea3fb",
        "title": "Tibetan village doctor",
        "summary": "Although Padma Yudron feels frustrated at times, her has become determined to improve healthcare for all.",
        "source": "cgtn",
        "date": "2025-08-18T19:39:49+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Tibetan-village-doctor--1FWf5DIXPig/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "cc57afaa3a410c7dc8525d9e95e0518b4ee5e2450f4791ab79fa15e0c3fc435e",
        "title": "Sunrise over the Plateau: Vibrant Roof of the World",
        "summary": "Sixty years have passed in the unfolding of time. Through the shifting chords, \"Vibrant Roof of the World\" invites you to witness an economic leap across time.",
        "source": "cgtn",
        "date": "2025-08-18T19:39:39+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Sunrise-over-the-Plateau-Vibrant-Roof-of-the-World-1FWkgdmJRo4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "73436903460768809d79a42e35614583a930a12e6a32956a3e56a0dfc1bd84f6",
        "title": "Xtep’s interim profit rises as China’s running craze lifts Saucony sales",
        "summary": "Xtep International Holdings’ interim earnings surged to a record, as the sportswear maker and distributor of the Saucony brand of running shoes benefited from the new-found popularity of marathons and trail running in China.\nNet profit rose to a record 913.6 million yuan (US$127.3 million) in the first half, 6.4 per cent more than the revised interim earnings last year, Xtep said in a statement on Monday. Sales increased 7.1 per cent to 6.84 billion yuan, from the restated revenue of 6.38...",
        "source": "smcp",
        "date": "2025-08-18T19:30:24+09:00",
        "url": "https://www.scmp.com/business/companies/article/3322241/xtep-posts-record-interim-profit-chinas-marathon-boom-boosts-sales-saucony-shoes?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1b2bb6af38c4dbc5538ef9636ecb725e2d1e829b4f9ef4748f16bd51b6e3d0d7",
        "title": "China to work with India to boost peace, tranquility in border areas",
        "summary": "China to work with India to boost peace, tranquility in border areas",
        "source": "cgtn",
        "date": "2025-08-18T19:16:18+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/China-to-work-with-India-to-boost-peace-tranquility-in-border-areas-1FWjRrhAFOM/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "7c6f2b8e183c5d15f0b3c1c864f66749562a6a455c4f8d68b56b175a3849f9b1",
        "title": "Pandas win over participants of World Games",
        "summary": "No one can resist giant pandas. These black-and-white wonders have captured the hearts of people from around the world, including the participants of the World Games in Chengdu.",
        "source": "cgtn",
        "date": "2025-08-18T17:52:59+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Pandas-win-over-participants-of-World-Games-1FWgF5xf1Ek/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "5b48551955e8a7ed7f79caa061155d4dbad9d4c069b901a73d7aa754c7f96be4",
        "title": "Laoniuwan Village: Where the Yellow River meets the Great Wall",
        "summary": "Laoniuwan (Old Ox Bay) Village is famous for its unique location at the point where the Yellow River enters Shanxi Province and meets the Great Wall.",
        "source": "cgtn",
        "date": "2025-08-18T17:38:03+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Laoniuwan-Village-Where-the-Yellow-River-meets-the-Great-Wall--1FWdf0hoKju/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "21a5dbb50271f4b6036848c938bbb552888e8f07c52b77da1154e12407a0a52e",
        "title": "China extends probe into EU dairy products to February 2026",
        "summary": "China extends probe into EU dairy products to February 2026",
        "source": "cgtn",
        "date": "2025-08-18T17:24:28+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/China-extends-probe-into-EU-dairy-products-to-February-2026-1FWdhuFLvI4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "32424368f203cb2b9ddebee87588c02b03c5d6b598f7ea66be325e84b6bdcf3a",
        "title": "Millennial terraces reborn: Hani people's path to poverty alleviation",
        "summary": "Millennial terraces reborn: Hani people's path to poverty alleviation",
        "source": "cgtn",
        "date": "2025-08-18T17:23:20+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Millennial-terraces-reborn-Hani-people-s-path-to-poverty-alleviation-1FW5wkqB5rG/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "68783a1309947ad62cb5ab379a8b8e08d93a6cc95f68cc505ea3a2854a4b5293",
        "title": "EU envoys mull skipping China military parade over Putin’s attendance: sources",
        "summary": "European envoys in Beijing are discussing plans to skip China’s massive military parade next month after considering the attendance of Russian President Vladimir Putin and the possible participation of Russian troops, the Post has learned.\nAccording to five sources familiar with the matter, European missions in Beijing have been invited to the parade and events on the same day but are particularly troubled by the Russian leader’s attendance as Moscow has intensified its attacks on Ukrainian...",
        "source": "smcp",
        "date": "2025-08-18T17:06:25+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322196/eu-diplomats-mull-skipping-china-military-parade-over-putins-attendance-sources?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "04f785d8091964f4b06d4852dfc8bd268bcd4f4430d924983288a71c80594bc4",
        "title": "Tidal guardians: Symphony of life in mangrove forests",
        "summary": "Tidal guardians: Symphony of life in mangrove forests",
        "source": "cgtn",
        "date": "2025-08-18T16:57:44+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Tidal-guardians-Symphony-of-life-in-mangrove-forests-1FW5Hy6jjc4/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "fc2bb4d7e40d61d6574ae636d1570a986d624144f2c1e73353d1dc98e05740ce",
        "title": "Farewell and thank you, Chengdu – World Games memories live on",
        "summary": "The World Games 2025 in Chengdu have come to an end, but the memories remain vivid. Before heading home, participants from around the globe shared their heartfelt gratitude to the city and its people.",
        "source": "cgtn",
        "date": "2025-08-18T16:39:54+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Farewell-and-thank-you-Chengdu-World-Games-memories-live-on-1FWagorwqEU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0703ba4d3a3d77d6b7f90fdeef6b874588cac90dc33bf8d10cd98205308d9f8a",
        "title": "China’s Nvidia challenger Cambricon to raise US$560 million for AI chip work",
        "summary": "Chinese semiconductor firm Cambricon Technologies, seen as a potential future challenger to Nvidia, plans to raise nearly 4 billion yuan (US$560 million) for AI chip development, boosting its standing in the country’s tech self-sufficiency drive.\nIn a statement on the weekend, Cambricon said the Shanghai Stock Exchange had given the go-ahead for its 3.98 billion yuan fundraising plan, which is pending approval from the China Securities Regulatory Commission. The move comes after its stock price...",
        "source": "smcp",
        "date": "2025-08-18T16:33:52+09:00",
        "url": "https://www.scmp.com/tech/big-tech/article/3322203/chinas-nvidia-challenger-cambricon-raise-us560-million-ai-chip-development?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "916f4a52720a9405d8cc78e9d217a41f03f9d5445087d653bb0e5bab74b1e36a",
        "title": "A Pakistani scientist's journey of cultivation in China",
        "summary": "From Pakistan to China, Mohammed Khalid Hamid is turning research into results — boosting crop yields by up to 40 percent and building China-Pakistan ties in his own way.",
        "source": "cgtn",
        "date": "2025-08-18T16:31:49+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/A-Pakistani-scientist-s-journey-of-cultivation-in-China-1FW6NJJn212/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "8e6526d79d42807963b53d726baf81c5c644d52476780fd490dac9b4e1358504",
        "title": "China's 2025 summer box office surpasses 10 billion yuan",
        "summary": "China's 2025 summer box office revenue has surpassed 10 billion yuan (about $1.4 billion) as of Monday, with domestic productions dominating the top three spots, according to ticketing platforms Maoyan and Beacon.",
        "source": "cgtn",
        "date": "2025-08-18T16:28:21+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/China-s-2025-summer-box-office-surpasses-10-billion-yuan-1FW9MQeuAQE/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0c24c1a2f06af8008244a3e4e08a810b0c9d30c88ec86581a810b58c9633dc1f",
        "title": "China to hold press conference on military parade preparations",
        "summary": "China's State Council Information Office will host a press conference at 10 a.m. on Wednesday to outline preparations for the upcoming military parade.",
        "source": "cgtn",
        "date": "2025-08-18T15:16:15+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/China-to-hold-press-conference-on-military-parade-preparations-1FW4RyGEB4k/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "80dc87ae445c40cb3b1bef5551047982663d82c4fb88510b3334780f30a81901",
        "title": "'Study in scarlet' in Leshan: Deliveryman, police save trapped woman",
        "summary": "'Study in scarlet' in Leshan: Deliveryman, police save trapped woman",
        "source": "cgtn",
        "date": "2025-08-18T15:11:54+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/-Study-in-scarlet-in-Leshan-Deliveryman-police-save-trapped-woman-1FW4bwiGGcw/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "b3ed1ab298d1cdf7accc218067ee593b3ba782013f33beac4a8ae4e68b5b3162",
        "title": "Chinese scientists transplant human brain cells to mice, boosting pleasure",
        "summary": "Chinese scientists have found a way to turn human stem cells into dopamine-producing brain cells, transplanting them into mice and helping reduce depressive behaviour and boost pleasure.\nWhen the engineered neuron-like cells were grafted into depression-model mice, they helped lessen symptoms like anxiety and resignation while increasing feelings of enjoyment.\nThe development has the potential to be employed as a therapy to treat neuropsychiatric disorders by directly targeting and repairing...",
        "source": "smcp",
        "date": "2025-08-18T15:00:13+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322054/chinese-scientists-transplant-human-brain-cells-mice-boosting-pleasure-levels?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7dfeb3ed59652b32de8692f266e55942571a224817c2c7938ce0458e1c61556b",
        "title": "Second batch-produced AG600 aircraft completes production test flight",
        "summary": "China's second batch-produced AG600 \"Kunlong\" amphibious aircraft has successfully completed its production test flight in Zhuhai City, south China's Guangdong Province, Aviation Industry Corporation of China said on Sunday, marking a step toward customer delivery and operational deployment.",
        "source": "cgtn",
        "date": "2025-08-18T14:48:41+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Second-batch-produced-AG600-aircraft-completes-production-test-flight-1FVXUHjEeNq/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a4b34bb22999979fb9061caf58a1bd80771674f41962eec79809191a54287bef",
        "title": "Chinese cities strive to power NEVs with green electricity",
        "summary": "Chinese cities strive to power NEVs with green electricity",
        "source": "cgtn",
        "date": "2025-08-18T14:39:29+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Chinese-cities-strive-to-power-NEVs-with-green-electricity-1FW188UYLPa/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0bc5b7a1f87141f0a4b53162aa96167be66921715df197360a87647db68de5e5",
        "title": "How China strengthens health care support at the grassroots level",
        "summary": "Over the past five years, China has introduced a series of measures to bring higher-quality medical services closer to people's doorsteps.",
        "source": "cgtn",
        "date": "2025-08-18T14:08:01+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/How-China-strengthens-health-care-support-at-the-grassroots-level-1FVOZTDMmre/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "9cef4715186c402a01beb5961ff2bb35a1da426a9cb4c925f0cfc0e8f4a30266",
        "title": "China highlights achievements of socialist democracy",
        "summary": "Chinese officials from different governmental departments on Monday stated achievements of socialist democracy during the 14th Five-Year Plan period (2021-2025) in a press briefing.",
        "source": "cgtn",
        "date": "2025-08-18T13:16:17+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/China-highlights-achievements-of-socialist-democracy-1FVUj2OzQUo/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "60f2148b22ded383a0be2fd84c27bcd17df964a6e70c6ed3e4ad35849028f676",
        "title": "New hypersonic missiles and drones: what’s been rolling through Beijing?",
        "summary": "New hypersonic anti-ship missiles and a road-mobile intercontinental ballistic missile system were among a line-up of advanced Chinese weaponry seen on the streets of Beijing over the weekend.\nPhotos and videos circulating online reveal some of the People’s Liberation Army’s latest hardware that was spotted by residents during a second rehearsal for next month’s military parade.\nThe images and footage show unmanned underwater vehicles, a gigantic laser weapon, a fleet of drones and unmanned...",
        "source": "smcp",
        "date": "2025-08-18T13:00:09+09:00",
        "url": "https://www.scmp.com/news/china/military/article/3322176/new-missiles-drones-and-tanks-whats-been-rolling-through-beijings-streets?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "98069830b3c597247042d61117e375f4d7827a59277b3a38c069e2af05723076",
        "title": "The rise of China’s soft power",
        "summary": "",
        "source": "smcp",
        "date": "2025-08-18T12:54:15+09:00",
        "url": "https://www.scmp.com/news/china/series/3322179/rise-chinas-soft-power?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c4312a8bce195860314466882da03c0c38bfc22b59b1b9295ac058077f9615eb",
        "title": "Trailer | The Power of Ideas: The Path to Peace",
        "summary": "Trailer | The Power of Ideas: The Path to Peace",
        "source": "cgtn",
        "date": "2025-08-18T12:47:37+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/Trailer-The-Power-of-Ideas-The-Path-to-Peace-1FVUHDZAwAU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "754db4e8810b5a0860c80c7c6d91d13eb6b319e7ab2f491b42e80cab9a2d0508",
        "title": "China’s key stock index climbs to 10-year high as investors chase higher returns",
        "summary": "Mainland Chinese stocks rose on Monday, driving a key gauge to a decade high amid increasing signs that investors have been rotating out of bonds and bank deposits into equities in hunt for better returns.\nThe Shanghai Composite Index advanced 0.9 per cent to 3,728.03 at the close, a level not seen since August 19, 2015. The CSI 300 Index climbed 0.9 per cent, finishing at the highest level in almost a year.\nShares worth 2.75 trillion yuan (US$382.9 billion) changed hands on the mainland’s...",
        "source": "smcp",
        "date": "2025-08-18T11:43:56+09:00",
        "url": "https://www.scmp.com/business/china-business/article/3322169/hong-kong-stocks-steady-investors-await-key-quarterly-results-powells-speech?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "c6ff7d68545ff320f7dfe187f95810d160f47f9194bb98e07fa9522dd0945e0d",
        "title": "‘Bargaining chips in power games’: China report slams US on human rights",
        "summary": "China has accused the United States of using human rights as a “bargaining chip” in its latest annual report on the issue.\nThe report released on Sunday criticised what it called the hypocrisy of the US political system, its unequal social welfare, widespread racism, and the politicisation of immigration, where immigrants become “scapegoats for political parties”.\nThe US had turned human rights into “props for political theatre” and “bargaining chips in power games”, it alleged.\nThe year 2024...",
        "source": "smcp",
        "date": "2025-08-18T11:26:37+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322151/china-report-says-us-using-human-rights-bargaining-chip-deeply-unequal-society?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "3889b91b745f8a410b48ae21b78229923fc27f8f207ae19938f8f01c6acd0b56",
        "title": "China launches low Earth orbit internet satellites",
        "summary": "China launched a new group of low Earth orbit internet satellites from the Taiyuan Satellite Launch Center in northern Shanxi Province on Sunday.",
        "source": "cgtn",
        "date": "2025-08-18T10:00:17+09:00",
        "url": "https://news.cgtn.com/news/2025-08-18/China-launches-low-Earth-orbit-internet-satellites-1FVFeFnS49y/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "31d6d28769a98b66359c877ee47dd1d78c07f8baa5cc88bb0e9de5de46c06f5a",
        "title": "Chinese pharma firms Hengrui, Hansoh expected to post strong first-half profits",
        "summary": "Jiangsu Hengrui Pharmaceuticals and Hansoh Pharmaceutical Group, two of China’s largest drug makers, are expected to report significantly improved profits, buoyed by novel drug roll-outs and revenue from technology licensing.\nOn August 21, Hengrui, China’s largest drug maker by market value, is expected to say its net profit for the first half rose 40 per cent from a year earlier to 4.1 billion yuan (US$570.8 million), with revenue up 9 per cent to 15.7 billion yuan, according to analysts’...",
        "source": "smcp",
        "date": "2025-08-18T08:30:12+09:00",
        "url": "https://www.scmp.com/business/article/3322005/chinese-pharma-firms-hengrui-hansoh-expected-post-strong-first-half-profits?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1c01d5f5ce668bd2773975578ecafa14f2547b2725cd3bd40648ed6c952e6f58",
        "title": "Jing Qian unpacks the US-China trade talks and their ‘manageable’ rivalry",
        "summary": "Jing Qian is vice-president of the Asia Society and managing director of its Centre for China Analysis (CCA), which he co-founded with Kevin Rudd, former prime minister of Australia. His research examines the interplay between domestic politics and foreign policy in the United States and China.\nIn his second Open Questions interview, he delves into the two countries’ all-important relationship, how its twists and turns play out in Europe and the numerous domestic economic challenges Beijing is...",
        "source": "smcp",
        "date": "2025-08-18T07:00:15+09:00",
        "url": "https://www.scmp.com/economy/global-economy/article/3321959/jing-qian-unpacks-us-china-trade-talks-and-their-manageable-rivalry?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e8423de2a0aec335739a29e0df7d3d1b4ac29d54c72f5e6fdb306fca5d561373",
        "title": "The big shift in ethnic affairs exposed by China’s corruption crackdown",
        "summary": "First came the investigation in January into Qizhala, the ethnic Tibetan former chairman of the Tibet autonomous region.\nThen in May, it was the turn of Lan Tianli, the ethnic Zhuang chairman of the Guangxi Zhuang autonomous region.\nIn July, just as Qizhala was being expelled from the Communist Party, Liu Hui, the ethnic Hui former chairwoman of the Ningxia Hui autonomous region, came under investigation for alleged corruption.\nThe three cadres are among just a handful of senior officials from...",
        "source": "smcp",
        "date": "2025-08-17T23:00:10+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3322070/big-shift-ethnic-affairs-exposed-chinas-corruption-crackdown?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f4ba4fab7ed3c7a90bc8dc95a6e57777a598cfeaa468cb0c541a5fe85ad08ca5",
        "title": "Swatch says sorry for ‘slant eye’ ad after social media backlash in China",
        "summary": "Swiss watchmaker Swatch has issued an apology for a “slant eye” promotional image that has triggered strong criticism on Chinese social media, with the gesture widely considered offensive to Asians.\nIn statements posted to Instagram and China’s Weibo on Saturday, the Swatch Group sought to “sincerely apologise for any distress or misunderstanding this may have caused”.\nThe company said it had taken note of the “recent concerns” regarding the portrayal of a model in images for a men’s watch...",
        "source": "smcp",
        "date": "2025-08-17T22:00:10+09:00",
        "url": "https://www.scmp.com/news/china/article/3322130/swatch-says-sorry-slanted-eyes-ad-after-social-media-backlash-china?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1aec19e212074a4f41247d87e1056df2b787c4237e619316ba21ccd69b874bde",
        "title": "The World Games 2025 closes in Chengdu",
        "summary": "The World Games 2025 closes in Chengdu",
        "source": "cgtn",
        "date": "2025-08-17T21:52:32+09:00",
        "url": "https://news.cgtn.com/news/2025-08-17/news-1FUTwLUPGbC/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "016eb6bba22d9dab37d957e22ad03365e53726f345e7353fbac86db7f80af429",
        "title": "Authorities should strictly follow the law when probing business figures",
        "summary": "When it comes to entrepreneurship, China’s successful private entrepreneurs should rank among the world’s most resilient.\nTo thrive in an environment where they are treated as second-class citizens compared to state-owned enterprises, they must navigate significant challenges: limited access to markets and bank credit, unpredictable government policies, sudden and severe regulatory crackdowns, bureaucrats exploiting power for personal gain, frequent harassment from administrative agencies like...",
        "source": "smcp",
        "date": "2025-08-17T21:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3321882/authorities-should-strictly-follow-law-when-probing-business-figures?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "7fd1afc18a77b60cd23adfb1ade0fb973ee57314379bfdb2d8495fcea3df9872",
        "title": "Renowned Chinese artist Fan Zeng, 87, ‘taken away’ by new wife, daughter alleges",
        "summary": "Prominent Chinese artist Fan Zeng has been “taken away” by his new wife and most of his valuable possessions have also “gone missing”, his daughter has alleged.\n“Rumours have circulated online recently claiming my father, Fan Zeng, was forcibly removed from his home and has since gone missing,” Fan Xiaohui said in a social media post on Saturday.\n“As his daughter, I want to first thank everyone for their concern, but I am deeply anxious about his health and safety.”\nFan Zeng, 87, announced his...",
        "source": "smcp",
        "date": "2025-08-17T21:21:25+09:00",
        "url": "https://www.scmp.com/news/china/money-wealth/article/3322143/chinese-artist-fan-zeng-87-taken-away-new-wife-valuable-works-missing-daughter?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "cab975172af29ddaba0b0e2d65dea1b5a1c4ed1490d5f45304fe85592f54aca6",
        "title": "China condemns Japanese tribute to war criminals at Yasukuni Shrine",
        "summary": "China has expressed “strong dissatisfaction” to Japan after Prime Minister Shigeru Ishiba sent a ritual offering to a controversial shrine that honours war criminals on the 80th anniversary of Japan’s surrender.\nIt was a “blatant provocation against historical justice and human conscience”, the Chinese foreign ministry said, referring to the visit to the Yasukuni Shrine on Friday by several Japanese cabinet members.\n“To view and treat history correctly is an important prerequisite for Japan’s...",
        "source": "smcp",
        "date": "2025-08-17T20:30:44+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322141/china-complains-about-japanese-ministers-tribute-war-criminals-yasukuni-shrine?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ddae27adfa621ccf112df261bae711380fc365596802ceeee9f46695e540a460",
        "title": "Chinese universities face online flak over Yale researcher critical of Xinjiang",
        "summary": "Some Chinese universities appear to have distanced themselves from a US researcher invited to their events, after social media users in China took aim at his past remarks on Xinjiang and demanded an explanation from the institutes.\nThe latest in the line of fire is Central South University in Changsha, Hunan province. It has faced a barrage of online criticism since last Tuesday for having hosted Darius Longarino, who is a research scholar at Yale Law School and senior fellow at its Paul Tsai...",
        "source": "smcp",
        "date": "2025-08-17T19:02:21+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3322107/xinjiang-posts-yale-researcher-put-chinese-universities-line-online-fire?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "2dd36cb77e72c3ee72be9c92dd0b3de6cbeb14de87111d66bb2637a3945fec4d",
        "title": "Will retirees be job market winners as China targets social insurance dodgers?",
        "summary": "Increased scrutiny of businesses in China that evade their social insurance obligations looks set to further boost the employment of retirees, prompting widespread concerns as a record number of university graduates tries to find work.\nIt all came to a head recently when recruitment notices put out by the McDonald’s fast food chain, which has been employing retirees for years, sparked an emotional response on Chinese social media platforms.\n“The logic behind it is simple – hiring retirees means...",
        "source": "smcp",
        "date": "2025-08-17T17:00:14+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3321995/will-retirees-be-job-market-winners-china-targets-social-insurance-dodgers?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "1d6b121867490c69cf5c87b1f91385eb226b68f5d12b43cfdd6c3edb3c6244ca",
        "title": "China hosts exhibition emphasising ‘Russianness’ of realist painter Ilya Repin",
        "summary": "An exhibition of works by Ilya Repin – the realist painter at the centre of a culture war between Moscow and Kyiv – has opened in Beijing as part of an exchange series between China and Russia.\nA collection of 48 oil paintings and 44 sketches by Repin (1844-1930), one of the most renowned 19th-century artists in the Russian Empire, is on show at the National Museum of China.\nThe exhibition – titled “Ilya Repin: Encyclopedia of Russian Life” – will run until mid-January as part of the 2024-25...",
        "source": "smcp",
        "date": "2025-08-17T15:00:14+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3321944/china-hosts-exhibition-emphasising-russianness-realist-painter-ilya-repin?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "340f1bb8af698c1d2e5777bff6cfdf51b343d405fa15c71ef938affab7754919",
        "title": "New Chinese see-through brain technique offers clearest look inside its workings",
        "summary": "Chinese scientists have developed a technology that can make organs such as the brain or the heart transparent, allowing an exceptionally clear view of their inner workings.\nThe new method produced “highly accurate and vivid” 3D images of organs by preserving the integrity of their biological structures and enhancing the brightness of the fluorescent dyes scientists use to highlight cells and molecules.\nThe Tsinghua University-led team wrote in the journal Cell that this method was capable of...",
        "source": "smcp",
        "date": "2025-08-17T13:00:15+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322115/new-chinese-see-through-brain-technique-offers-clearest-view-its-inner-workings?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6f16d99aa6b04ca617f255aff1dce96295f80adfa516aa71c93692581331548c",
        "title": "Can China’s hypersonic drone carrier bring Nasa’s ‘scissor wing’ dream to life?",
        "summary": "Chinese aerospace engineers are revisiting a decades-old, largely abandoned aviation concept – the oblique rotating wing – and transforming it into a potential cornerstone of future warfare: an unstaffed hypersonic mother ship capable of flying at five times the speed of sound and unleashing a swarm of drones behind enemy lines.\nDrawing inspiration from Nasa’s quirky AD-1 experimental aircraft of the 1970s – a small jet-driven plane with a “scissor wing” that pivoted diagonally across the...",
        "source": "smcp",
        "date": "2025-08-17T11:00:14+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3321844/can-chinas-hypersonic-drone-carrier-bring-nasas-scissor-wing-dream-life?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "6c64d7c2ae05af3bc2ad13b90a73e5cfdc4f806787eef679f64bc28bca6d7664",
        "title": "US tariffs a big worry for Chinese sellers on Shein, Temu, TikTok Shop, Amazon",
        "summary": "A number of Chinese cross-border exporters expect the Trump administration’s erratic trade policy to continue testing their stamina and resilience, days after the tariff truce between Beijing and Washington was extended for another 90 days.\nThose concerns were raised on the sidelines at Friday’s opening of the semi-annual China Cross-Border E-Commerce Trade Fair in Guangzhou, capital of southern Guangdong province, which concludes on Sunday.\nWith booths at the fair, major online retail platforms...",
        "source": "smcp",
        "date": "2025-08-17T10:00:16+09:00",
        "url": "https://www.scmp.com/tech/tech-trends/article/3322051/us-tariffs-remain-big-concern-chinese-sellers-shein-temu-tiktok-shop-and-amazon?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "814a15fb95afaa5c4d5a8380b26aca971651cc16e19605df9f0009aa684d5390",
        "title": "Asean-China trade pact update could not have come at a better time",
        "summary": "Amid escalating tensions between the United States and China and lingering trade tensions, China and Asean have gone full steam ahead on upgrading their landmark free trade pact.\nChina and the Association of Southeast Asian Nations – two key players in the Global South – account for a quarter of the world’s population and a fifth of global gross domestic product, contributing to over 30 per cent of global economic growth.\nIn July, Chinese Foreign Minister Wang Yi announced that both sides would...",
        "source": "smcp",
        "date": "2025-08-17T06:30:09+09:00",
        "url": "https://www.scmp.com/opinion/china-opinion/article/3321731/trump-builds-tariff-walls-china-and-asean-are-building-bridges?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "0c7bd277c5db204d71d586d47eccdaf08908c792514b9dd26789e902b57348b3",
        "title": "China urged to boost space solar power technology efforts",
        "summary": "China has been urged to speed up the development of solar power in space to gain a stronger footing in the new energy sector and the space race.\nGe Changchun, an academician at the Chinese Academy of Sciences, called in an article for a top-down strategy to speed up efforts to develop the technology and narrow the gap with the United States in sectors such as materials and precision control.\nSpace solar power facilities are designed to be built and operated in orbit, where they convert solar...",
        "source": "smcp",
        "date": "2025-08-17T00:00:09+09:00",
        "url": "https://www.scmp.com/news/china/science/article/3322058/china-urged-boost-space-solar-power-technology-efforts?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "adc31f63978ff9b4d2d61ed5a36c057b8a3a0d2f75537e22522b1097150f068d",
        "title": "Trump-Putin summit: was it a win for Russia or the US?",
        "summary": "The highly anticipated US-Russia presidential summit in Alaska had raised hopes for progress on ending the Ukraine war, but instead left more questions than answers.\nStill, observers viewed Vladimir Putin’s diplomatic return to US soil – his first in a decade – as a symbolic win for Moscow.\nThe nearly three-hour talks, which both Putin and Donald Trump described as “productive”, signalled a potential thaw in the fraught US-Russia relationship despite concluding without a ceasefire agreement,...",
        "source": "smcp",
        "date": "2025-08-16T23:24:28+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322104/will-trump-putin-thaw-alaska-leave-china-facing-3-way-dilemma?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "e6537413da80adc78b69b37afdd5ab427820ec4d5db70db8e97e1ed6c5115c1f",
        "title": "Echoes across Xizang",
        "summary": "The four-part 4K documentary series \"Sunrise Over the Plateau\" is coming soon—revealing scattered sparks that light up the highlands.",
        "source": "cgtn",
        "date": "2025-08-16T22:03:45+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Echoes-across-Xizang--1FSsC41Yu2s/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "d71752dea7ca191c4e4352eb50ef6e03cbe47f4797bd179f80c3c4f95a147bed",
        "title": "China deplores Japanese politicians paying respects to Yasukuni Shrine",
        "summary": "China deplores Japanese politicians paying respects to Yasukuni Shrine",
        "source": "cgtn",
        "date": "2025-08-16T21:39:57+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/China-deplores-Japanese-politicians-paying-respects-to-Yasukuni-Shrine-1FT9DaRGe7m/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "cebccbb14f6c795d2d66d0055fac2c32202da069f1a546fa56d769123a3cbf71",
        "title": "SCO biodiversity cooperation and China's contribution",
        "summary": "SCO biodiversity cooperation and China's contribution",
        "source": "cgtn",
        "date": "2025-08-16T21:28:09+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/SCO-biodiversity-cooperation-and-China-s-contribution-1FT8asnICqc/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "7380f2f0076e1d29fe2e288f038082d845ff00debe653ace3e00be9b9cdc4348",
        "title": "Upholding Shanghai Spirit: SCO's 'friends circle' continues to expand",
        "summary": "Upholding Shanghai Spirit: SCO's 'friends circle' continues to expand",
        "source": "cgtn",
        "date": "2025-08-16T21:17:43+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Upholding-Shanghai-Spirit-SCO-s-friends-circle-continues-to-expand-1FSRgi9tbos/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "2c9ed2eb3e7163fbc536dee0016d48e087d1f32fd9878c3e937cc9ccd8f244ca",
        "title": "Europe rallies behind Ukraine after Trump-Putin summit fails to offer ceasefire",
        "summary": "European leaders have vowed to turn the screws on Moscow after a high-stakes US-Russia summit in Alaska failed to result in a ceasefire in Ukraine.\nAfter a flurry of post-summit calls on Saturday, a coalition of Ukraine allies rallied around Kyiv, insisting that Russia could not veto its future membership of Nato or the European Union.\nNor could there be limitations on “Ukraine’s armed forces or on its cooperation with third countries” as part of any peace agreement, read a statement quickly...",
        "source": "smcp",
        "date": "2025-08-16T20:49:41+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322098/european-leaders-rally-behind-ukraine-after-trump-putin-summit-fails-deliver-ceasefire?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "f362080f782138f7b145c08f4829d1e3bffaa86d13f40d91bc14894ce5361602",
        "title": "From hidden gem to viral sensation: the allure of Xizang's Gurula Co",
        "summary": "From hidden gem to viral sensation: the allure of Xizang's Gurula Co",
        "source": "cgtn",
        "date": "2025-08-16T20:29:18+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/From-hidden-gem-to-viral-sensation-the-allure-of-Xizang-s-Gurula-Co-1FSUmrNqfTi/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a0d80a56a2daed5cecab83a2f0964cd0bfaef1e4c363e82c5c6d6d93db73b31a",
        "title": "China arms Burkina Faso as Sahel turns away from Western security promises",
        "summary": "China is equipping Burkina Faso’s military and positioning itself for greater influence in the Sahel, filling a vacuum left by the collapse of security partnerships with Western nations, especially the United States and France.\nThe move is part of a broader modernisation plan that the Burkinabe government, headed by junta leader Ibrahim Traoré, announced in late 2023 amid growing insecurity waged by jihadist militants, mostly affiliated with al-Qaeda and Islamic State.\nAfter a complex diplomatic...",
        "source": "smcp",
        "date": "2025-08-16T20:00:09+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3321831/china-arms-burkina-faso-sahel-turns-away-western-security-promises?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "82e369acbc3339e704e365af4765d7212045eee257b63cf027b6517988140939",
        "title": "China’s Wang Yi to visit India for first time in 3 years for border talks",
        "summary": "Foreign Minister Wang Yi will visit India for the first time in three years to discuss the latest round of border talks, the Chinese foreign ministry has confirmed.\nDuring the trip from August 18 to 20, the top Chinese diplomat will serve as the “special representative of the China-India boundary question” in the 24th round of border talks “at the invitation of the Indian side”, according to a Saturday statement from the ministry.\nThis series of negotiations aims to address long-standing border...",
        "source": "smcp",
        "date": "2025-08-16T19:53:38+09:00",
        "url": "https://www.scmp.com/news/china/diplomacy/article/3322094/chinas-top-diplomat-wang-yi-visit-india-first-time-3-years-border-talks?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "61a64263465b8dbfc57d7f352b88b614739dacb6373e5b53451a12fe621f0896",
        "title": "China punishes medical bosses after doctor abandons surgery to defend lover",
        "summary": "Several top university and hospital administrators in China have been held accountable after a noted thoracic surgeon left an anaesthetised patient for over half an hour to confront a nurse in defence of his mistress, a junior doctor.\nThe punishments respond to widespread public anger over the scandal, which broke in April, as well as questions about hospital management, professional ethics, and accountability within China’s medical institutions.\nA total of 19 officials from five prestigious...",
        "source": "smcp",
        "date": "2025-08-16T19:10:19+09:00",
        "url": "https://www.scmp.com/news/china/politics/article/3322089/chinas-top-medical-bosses-taken-task-after-doctor-abandons-surgery-defend-mistress?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "448982c6ad11931c41c6f31a6e987a238db29636e9d660778f8d04ccab662a5c",
        "title": "How China's 'two mountains' concept shapes global green development",
        "summary": "The \"two mountains\" concept, which literally means green mountains and clear waters are as valuable as mountains of gold and silver, has become a guiding principle for China's ecological efforts and a source of inspiration for sustainable development worldwide.",
        "source": "cgtn",
        "date": "2025-08-16T18:53:52+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/How-China-s-two-mountains-concept-shapes-global-green-development-1FSGt4l2H9C/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "1e5bb6e83c19e0f0e4cbe0a54c6b760e7400ccdf790893d1e3c25f7025e285f4",
        "title": "China speeds up green transition with clean energy gains",
        "summary": "China speeds up green transition with clean energy gains",
        "source": "cgtn",
        "date": "2025-08-16T18:49:43+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/China-speeds-up-green-transition-with-clean-energy-gains-1FSVCHJMzUQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a3eee212252b402579852457c59ae15fd50e5018f0f34cb222eacbc469cb1789",
        "title": "Carving history: Shanghai exhibition of wartime woodcut art",
        "summary": "A special exhibition titled \"Carving History – Shanghai and the New Woodcut Narratives of the War of Resistance (1931–1949)\" is currently showing at the China Art Museum in Shanghai.",
        "source": "cgtn",
        "date": "2025-08-16T18:29:48+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Carving-history-Shanghai-exhibition-of-wartime-woodcut-art-1FSZJT3aZSU/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "867d2a35f37d0149735e998e3d35ddb411eae3de8f4024a3c9bae93dd138cb11",
        "title": "Digital economy opens new chapter in SCO cooperation",
        "summary": "Digital economy opens new chapter in SCO cooperation",
        "source": "cgtn",
        "date": "2025-08-16T18:19:27+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Digital-economy-opens-new-chapter-in-SCO-cooperation-1FSSLr76wk8/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "41dd2805209ca3b8e115db36ca5aa09344d200b659f38cd46f667b055bdd975d",
        "title": "How Chinese investors quietly transformed Athens – one visa at a time",
        "summary": "China has changed the Greek capital in both visible and less obvious ways.\nOn the one hand, authentic Chinese restaurants – from spicy hotpot to Cantonese cha chaan teng – have sprung up in central Athens, where many patrons speak the northeastern Chinese dialect and work for China Ocean Shipping Company, an industry giant managing Europe’s fifth-largest port.\nOn the more discreet side, Chinese buyers have snapped up thousands of flats in a rush to apply for the Greek investor residency scheme,...",
        "source": "smcp",
        "date": "2025-08-16T17:00:13+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3321996/how-chinese-investors-quietly-transformed-athens-one-visa-time?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "501a30594ce0fa3bf6bfb5b9e64a2d28d98f037a30ddb1df3236d53812de5e18",
        "title": "Life on Plateau: An overview of Xizang",
        "summary": "Life on Plateau: An overview of Xizang",
        "source": "cgtn",
        "date": "2025-08-16T16:53:30+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Life-on-Plateau-An-overview-of-Xizang--1FPZjgTTur6/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "3be8e9a2c1609d49542ffc834a2a1abe2d7abf35839c9ac8cbce531d162d1059",
        "title": "Directors' T-shirt coincidence!",
        "summary": "\"Dongji Rescue\" director Guan Hu and \"The Sinking of the Lisbon Maru\" director Fang Li wore T-shirts with the same secret on the back – the exact co-ordinates of the sunken Lisbon Maru.",
        "source": "cgtn",
        "date": "2025-08-16T16:16:29+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Directors-T-shirt-coincidence--1FSQcMXjg3K/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "c5e45b38ce8a4da33c84d9f920c28f563f993b4c0264718f754c54ee997c5a78",
        "title": "Chinese researchers lodge concerns over US debt as Beijing limits exposure",
        "summary": "Calls for China to gradually reduce its exposure to US dollar assets are growing louder as Washington’s national debt continues to set records, reigniting persistent worries over the long-term sustainability of an investment formerly considered rock solid.\n“Although US Treasuries have not yet reached the default threshold, their expansion is unsustainable,” researchers from the Bank of China wrote in the latest issue of China Money, a publication supervised by the People’s Bank of China, the...",
        "source": "smcp",
        "date": "2025-08-16T16:00:09+09:00",
        "url": "https://www.scmp.com/economy/china-economy/article/3322072/chinese-researchers-lodge-concerns-over-us-debt-beijing-limits-exposure?utm_source=rss_feed",
        "reportUrl": ""
    },
    {
        "id": "ca76a5e7d6a34c2a655cf11cead27da033d95e783d268401186265512083337a",
        "title": "Mu Us Desert transformed: Locals fight desertification",
        "summary": "Mu Us Desert was once a barren land plagued by sandstorms. Over the years, many people have actively engaged in combating desertification here, including the locals of Jingbian County, the first county in Shaanxi Province to curb the discharging of silt into the Yellow River.",
        "source": "cgtn",
        "date": "2025-08-16T15:23:56+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Mu-Us-Desert-transformed-Locals-fight-desertification-1FSMId6aOs0/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "a72c3e15e248987b365f76dd1d532cb8ad2fbc876962c447040421cc29777851",
        "title": "Chinese FM to visit India, hold talks on China-India boundary question",
        "summary": "Chinese FM to visit India, hold talks on China-India boundary question",
        "source": "cgtn",
        "date": "2025-08-16T15:23:26+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Chinese-FM-to-visit-India-hold-talks-on-China-India-boundary-question-1FSMLO076j6/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "70992c3827717968ba332c441409be78ab14c6c63d50b794591d6400110b3ece",
        "title": "“Xizang Dance Time” challenge accepted! Potala Palace style!",
        "summary": "Five-year old TikTok influencer Karma Tinley Sonam wears a Tibetan dress and takes the XizangDanceTime relay race at Potala Palace in Lhasa.",
        "source": "cgtn",
        "date": "2025-08-16T15:17:38+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/-Xizang-Dance-Time-challenge-accepted-Potala-Palace-style--1FSAnY5ndOo/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "776a2e6d1b529e48853a730d2fb310fb8342468498e7d4f7b31ef804cdfa331b",
        "title": "CMG series showcases China's answers to green development over years",
        "summary": "Marking the 20th anniversary of China's \"two mountains\" concept, China has launched a major 20-episode series, spotlighting representative cities and regions across China for their practice and achievements in ecological progress.",
        "source": "cgtn",
        "date": "2025-08-16T14:57:16+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/CMG-series-showcases-China-s-answers-to-green-development-over-years-1FSHyvmtTMI/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ee205c0267ab379f770c83814e1b0c5a15153887ee86ffeb72eb66aea7cf3fa2",
        "title": "Xinjiang-themed documentary premieres, showcasing rich diversity",
        "summary": "A new five-part documentary featuring northwest China's Xinjiang Uygur Autonomous Region is being broadcast daily from August 15 to 20, offering a panoramic, multi-dimensional exploration of the region.",
        "source": "cgtn",
        "date": "2025-08-16T14:25:33+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Xinjiang-themed-documentary-premieres-showcasing-rich-diversity-1FSBdGBTH9e/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "f9b00569c7079a6e1537402964185cfa2815e3964bc9d778005870f61aefbe9c",
        "title": "Japanese PM expresses 'remorse' over WWII",
        "summary": "Japanese PM expresses 'remorse' over WWII",
        "source": "cgtn",
        "date": "2025-08-16T11:16:44+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Japanese-PM-expresses-remorse-over-WWII-1FSrl59225y/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "9a3cd53d91584916d6cc406c8b3e7ca7175e4a2478d893393d1eae7d55ef26f8",
        "title": "China closer to manned moon landing goal after successful rocket test",
        "summary": "China's Long March-10 carrier rocket, the country's new-generation launch vehicle designed to transport astronauts to the moon, has successfully completed the first static fire test on Friday. This marks a significant new milestone in China's manned lunar exploration program and puts the country on track to meet its goal of manned missions to the moon by the end of the decade.",
        "source": "cgtn",
        "date": "2025-08-16T10:14:18+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/China-closer-to-manned-moon-landing-goal-after-successful-rocket-test-1FSjP4EkTUQ/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "0de3efccd171ae933aac2f709d9b9fbe22f571c5df1b5b5b6aac487f51a21714",
        "title": "Sunrise over the Plateau: Enduring Legacy | Trailer",
        "summary": "Explore the enduring, enriching, and ever-expanding legacy of culture and nature in southwestern China's Xizang Autonomous Region.",
        "source": "cgtn",
        "date": "2025-08-16T09:41:53+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Sunrise-over-the-Plateau-Enduring-Legacy-Trailer-1FRjdNHB876/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "aea5f7cf34b925bb03103f7576970af8ddd04f67ee754b450ec104432f96b702",
        "title": "Sunrise over the Plateau: Education on the Roof of the World",
        "summary": "From China’s highest illiteracy rate to 15 years of free education, Xizang has seen a profound shift.",
        "source": "cgtn",
        "date": "2025-08-16T09:41:45+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Sunrise-over-the-Plateau-Education-on-the-Roof-of-the-World-1FRiBzzhOow/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "757ddf353b923294bb5c00d9420d66fef2d6230120cc12b0b03aa2103c6f8845",
        "title": "Dongji Island: Legendary WWII Rescue of British POWs",
        "summary": "Dongji Island stands as an eternal monument to the human spirit.",
        "source": "cgtn",
        "date": "2025-08-16T09:41:36+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/Dongji-Island-Legendary-WWII-Rescue-of-British-POWs-1FReo8qrkVq/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "8edd0cd3ceebdcc0e897b44112a8d198826422fce56f83dbdbbbc8b6576f3bea",
        "title": "The 10th Great Wall Cup kicks off in Beijing",
        "summary": "The 10th Great Wall Cup kicks off in Beijing",
        "source": "cgtn",
        "date": "2025-08-16T09:01:42+09:00",
        "url": "https://news.cgtn.com/news/2025-08-16/The-10th-Great-Wall-Cup-kicks-off-in-Beijing-1FROe2cSH4c/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "23fc35774f24eb8ff43620e7eb6485baa43f00ffe52165ccf469c5e75e46295b",
        "title": "Mainland slams Lai Ching-te for distorting historical truth of WWII",
        "summary": "Mainland slams Lai Ching-te for distorting historical truth of WWII",
        "source": "cgtn",
        "date": "2025-08-16T00:14:54+09:00",
        "url": "https://news.cgtn.com/news/2025-08-15/Mainland-slams-Lai-Ching-te-for-distorting-historical-truth-of-WWII-1FRBS6ztG0g/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "e5f20604bb1fd8dd9f8b9a300e5f543fb07eb90223db43c4e6dd6895ed57b60c",
        "title": "China's Shenzhou-20 astronauts complete third series of EVAs",
        "summary": "The Shenzhou-20 crew on board China's orbiting space station completed their mission's third series of extravehicular activities (EVAs) on Friday, said the China Manned Space Agency (CMSA).",
        "source": "cgtn",
        "date": "2025-08-16T00:07:15+09:00",
        "url": "https://news.cgtn.com/news/2025-08-15/China-s-Shenzhou-20-astronauts-complete-third-EVA-1FRJlvtj17O/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "798c4f47053108a135118e2a3f99fc611f2db444e4b17fb7c0acd236dc1776a4",
        "title": "FMs agree to expedite resumption of Cambodia-Thailand exchanges",
        "summary": "FMs agree to expedite resumption of Cambodia-Thailand exchanges",
        "source": "cgtn",
        "date": "2025-08-15T23:54:14+09:00",
        "url": "https://news.cgtn.com/news/2025-08-15/FMs-agree-to-expedite-resumption-of-Cambodia-Thailand-exchanges-1FRHbb3Twpq/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "2380b9230d607b743fb903c42db30082a3793bb499b1ef11ed9927b54579a16b",
        "title": "How China's 'two mountains' concept shapes global green development",
        "summary": "How China's 'two mountains' concept shapes global green development",
        "source": "cgtn",
        "date": "2025-08-15T23:32:34+09:00",
        "url": "https://news.cgtn.com/news/2025-08-15/How-China-s-two-mountains-concept-shapes-global-green-development-1FRhBy6ylgY/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    },
    {
        "id": "ba68cb4738884277cfa7dbbad4f609a9d4e9e0e5b976e0bb98199f1cbe8f68cc",
        "title": "Chinese climbers sweep men's, women's speed gold medals at World Games",
        "summary": "Chinese climbers sweep men's, women's speed gold medals at World Games",
        "source": "cgtn",
        "date": "2025-08-15T14:48:31+09:00",
        "url": "https://news.cgtn.com/news/2025-08-15/Chinese-climbers-sweep-men-s-women-s-speed-gold-medals-at-World-Games-1FQHNK3VP8s/p.html?UTM_Source=cgtn&UTM_Medium=rss&UTM_Campaign=China",
        "reportUrl": ""
    }
]